&НаКлиенте
Перем Компонента;
&НаКлиенте
Перем РежимВводаАвтоматический;
&НаКлиенте
Перем Ошибка;

&НаКлиенте
Процедура НайстроитьСвойстваЭлементовФормы()
	
	ПодчинМеню = Элементы.СписокТоваровВБуфереПеремещенияОткуда.КонтекстноеМеню.ПодчиненныеЭлементы;
	
	Если Параметры.ТипСобытия <> Неопределено И  Параметры.ТипСобытия = "ОбработатьНеизвестныйШтрихкод" Тогда
		Элементы.ГруппаСтраница_2.Видимость = Ложь;
		Элементы.ГруппаСтраница_2.Доступность = Ложь;		
		
		Если Параметры.СобытиеПрисвоитьШтрихкод = Истина Тогда
			ПодчинМеню.СписокТоваровВБуфереПеремещенияОткудаКонтекстноеМенюВыбратьДляПрисвоенияШК.Видимость = Истина;	
			ПодчинМеню.СписокТоваровВБуфереПеремещенияОткудаКонтекстноеМенюВыбратьДляПеремещения.Видимость= Ложь;
		Иначе
			ПодчинМеню.СписокТоваровВБуфереПеремещенияОткудаКонтекстноеМенюВыбратьДляПрисвоенияШК.Видимость = Ложь;	
			ПодчинМеню.СписокТоваровВБуфереПеремещенияОткудаКонтекстноеМенюВыбратьДляПеремещения.Видимость= Истина;
		КонецЕсли; 
		
	Иначе
		ПодчинМеню.СписокТоваровВБуфереПеремещенияОткудаКонтекстноеМенюВыбратьДляПеремещения.Видимость = Истина;
		ПодчинМеню.СписокТоваровВБуфереПеремещенияОткудаКонтекстноеМенюВыбратьДляПрисвоенияШК.Видимость = Ложь;	
	КонецЕсли; 
	
	
КонецПроцедуры
 
 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НайстроитьСвойстваЭлементовФормы();
	
	ПолученыДанныеИзЯчейкиОткуда = Ложь;
	РезультатСтруктура = ОбщегоНазначения.ПолучитьСписокТоваровИзЯчейки(Объект.ЯчейкаОткудаГУИД, Истина);
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		Закрыть();
		Возврат;
	КонецЕсли; 
	
	ОбщегоНазначенияКлиент.ЗаполнитьТабЗначОК(ЭтаФорма);	
	ОбновитьСлуженоеСообщениеПодвал();	
	
КонецПроцедуры
 
&НаКлиенте
Процедура ОбновитьСлуженоеСообщениеПодвал() Экспорт
	
	ЭтаФорма.Подвал.Очистить();	
	СтрокаТЗ = Подвал.Добавить();

	СтрокаТЗ.ФИОСотрудинка = ОбщегоНазначенияКлиент.ПолучитьОписаниеСотрудника();
	Элементы.Подвал.Обновить();
	
	ЭтаФорма.ПодвалСообщение.Очистить();	
	СтрокаТЗ = ПодвалСообщение.Добавить();	
	СтрокаТЗ.СообщениеДляПользователя = "Смахните влево на товаре для действия";
	Элементы.ПодвалСообщение.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСвайпПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "ГруппаСтраница_ТоварыВячейкахКуда" Тогда 
		
	Иначе
		
		
	КонецЕсли; 
	
КонецПроцедуры                                                       
