
&НаКлиенте
Процедура РазместитьТовары(Команда)
	
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("ДокументГУИД", Параметры.ДокументГУИД);
	Закрыть( СписокПараметров );	

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Объект.ОписаниеДокумента = Параметры.НомерДокументаОоформление;
	
	Сообщение = "По данному документу система ";
	Сообщение = Сообщение + "обнаружила ранее размещенные Вами в ячейках ";
	Сообщение = Сообщение + "товары, которые не были отражены в документе ";
	Сообщение = Сообщение + """Размещение товаров по ячейкам"".";
	Сообщение = Сообщение + "Проверьте нахождение этих товаров";
	Сообщение = Сообщение + "в указанных ячейках и нажмите на кнопку";
	
	ЭтаФорма.Объект.ТекстСообщения = Сообщение;
			
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаписатьДанныеВРегистрСведений = Истина;
	РезультатСтруктура = ОбщегоНазначения.ПолучитьСписокТоваровИзБуфераРазмещения(Параметры.ДокументГУИД, ЗаписатьДанныеВРегистрСведений);
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		Закрыть();	
		Возврат;
	КонецЕсли; 
	
	Для каждого СтрокаДанных Из РезультатСтруктура.Данные Цикл
		
		НоваяЗапись = Объект.СписокТоваровВБуфереРазмещения.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаДанных);		
		НоваяЗапись.ДатаЗагрузки = ТекущаяДата();		
		
	КонецЦикла; 
					
	Оповестить("ОбновлениеДанных");
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновлениеДанных" Тогда
		Элементы.СписокТоваровВБуфереРазмещения.Обновить();
	КонецЕсли; 

КонецПроцедуры
