&НаКлиенте
Перем Компонента;


//Обработчики событий формы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Компонента = ОбщегоНазначенияКлиент.ПодключитьКомпоненту();
	
	Если Компонента <> Неопределено И Не Компонента.Подключить() Тогда
		ТекстОшибки = "";
		КодОшибки = Компонента.ПолучитьОшибку(ТекстОшибки);
		ПоказатьПредупреждение(,"Ошибка: "+КодОшибки+", " + ТекстОшибки);
	КонецЕсли;
	
	Адрес = ОбщегоНазначения.ПолучитьАдрес();
	
	ПодключитьОбработчикОжидания("ВключитьКнопкуВойти", 1, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Компонента <> Неопределено Тогда
		Компонента.Отключить();
	КонецЕсли;	
	
	ОтключитьОбработчикОжидания("ВключитьКнопкуВойти");
	
	Оповестить("РабочийСтолОбновление");
	
КонецПроцедуры

&НаКлиенте                                                                        
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если Событие = "UniversalBroadcastEvent" Тогда
		
		Результат = ОбщегоНазначения.ПолучитьЗначениеШтрихкода(Данные);
		Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
			ПоказатьПредупреждение(, "Ошибка сканирования штрихкода", 4);
			Возврат;			
		КонецЕсли; 
		Штрихкод = Результат.Штрихкод;
		
		// Пользователь может нажать несколько раз сканирование штрихкода, но форма уже закрыта.
		Если ВводДоступен() Тогда
			ОбработатьОтсканированныйШтрихкод();
		КонецЕсли; 
		
	ИначеЕсли Событие = "ClipboardEvent" Тогда
		
		Штрихкод = Данные;
		ОбработатьОтсканированныйШтрихкод();
		
	КонецЕсли;
		
КонецПроцедуры


&НаКлиенте
Процедура Войти(Команда)
	
	ОбработатьОтсканированныйШтрихкод();	
	
КонецПроцедуры               


&НаКлиенте
Процедура ОбработатьОтсканированныйШтрихкод()
	
	Адрес = ОбщегоНазначения.ПолучитьАдрес();
	
	РезультатВозврата = ОбщегоНазначения.АвторизоватьПользователя(Штрихкод, Пароль, Адрес);
	
	Если ЗначениеЗаполнено(РезультатВозврата.Ошибка) Тогда
		
		ПоказатьПредупреждение(, РезультатВозврата.Ошибка, 4);	
		Штрихкод = "";
		Пароль = "";
		Возврат;
		
	КонецЕсли; 
	
	Закрыть();

КонецПроцедуры
 

&НаКлиенте
Процедура Выйти(Команда)
	
	Если Компонента <> Неопределено Тогда
		Компонента.Отключить();
	КонецЕсли;	
	
	Закрыть();
	
КонецПроцедуры


&НаКлиенте
Процедура ВключитьКнопкуВойти() Экспорт
	
	Если СтрДлина(Элементы.Пароль.ТекстРедактирования) >= 1 Тогда
		Элементы.Войти.Доступность = Истина;
	Иначе
		Элементы.Войти.Доступность = Ложь;
	КонецЕсли; 
	
КонецПроцедуры
 


#Область ОпределениеШК_ПоКамере
//&НаКлиенте
//Процедура ПоискПоШК(Команда)
//	
//	#Если МобильноеПриложениеКлиент  Тогда
//		Если НЕ СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда
//			Сообщить("Сканирование штрихкодов не поддерживается");
//		Иначе
//			ОбработчикСканирования = Новый ОписаниеОповещения("ОбработкаСканирования", ЭтаФорма);
//            СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Наведите камеру на штрихкод", ОбработчикСканирования, , ТипШтрихКода.Все);
//		КонецЕсли;
//	#КонецЕсли
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОбработкаСканирования(Штрихкод, Результат, Сообщение, ДополнительныеПараметры) Экспорт
//	
//	#Если МобильноеПриложениеКлиент  Тогда
//		Если Результат И ЗначениеЗаполнено(Штрихкод) Тогда		
//			СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
//			ЭтаФорма.Штрихкод = Штрихкод;
//			ОбработатьОтсканированныйШтрихкод();
//			
//		Иначе		
//			Сообщить("Ошибка сканирования штрих-кода");
//		КонецЕсли;
//	#КонецЕсли
//	
//КонецПроцедуры

#КонецОбласти  

