
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтрокаТЗ = Параметры.НабраноЗначение[0];
	
	НоваяСтрока = Набрано.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
	
	НоваяСтрока.ОписаниеКоличестваТовара = "на складе: " + Строка(СтрокаТЗ.НаСкладе) + " ед., в резерве: " + Строка(СтрокаТЗ.ВРезерве) + " ед.";
			
	СписокЯчеекВыбранногоТовара.Параметры.УстановитьЗначениеПараметра("Владелец", Параметры.Владелец);
	СписокЯчеекВыбранногоТовара.Параметры.УстановитьЗначениеПараметра("ПоказыватьСлужебныеЯчейки", Ложь);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокЯчеекВыбранногоТовараПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Ключи = Строки.ПолучитьКлючи();
	Для Индекс = 0  По Ключи.Количество()-1 Цикл

		СтрокаСписка = Строки[Ключи[Индекс]];
		СтрокаСписка.Данные["ОписаниеКоличества"]  = "Кол.: " + Строка(СтрокаСписка.Данные["КоличествоОстаток"]);
		Если СтрокаСписка.Данные["НеУчитыватьВОперативномУчете"] = Истина Тогда	
			СтрокаСписка.Оформление["Ячейка"].УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(191, 191, 191));			
		КонецЕсли;
		//Попытка
		//	Если СтрДлина(СтрокаСписка.Данные["Ячейка"])>12 Тогда
		//		СтрокаСписка.Оформление["Ячейка"].УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(СтрокаСписка.Оформление["Ячейка"].НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Шрифт")),9,Истина));
		//	КонецЕсли;
		//Исключение 			
		//КонецПопытки;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСлуженоеСообщениеПодвал() Экспорт                                     
	
	ЭтаФорма.Подвал.Очистить();	
	СтрокаТЗ = Подвал.Добавить();

	СтрокаТЗ.ФИОСотрудинка = ОбщегоНазначенияКлиент.ПолучитьОписаниеСотрудника();
	Элементы.Подвал.Обновить();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьСлуженоеСообщениеПодвал();
	
КонецПроцедуры

&НаКлиенте
Процедура ИскатьВСлужебныхЯчейках(Команда)
	
	ПоказыватьСлужебныеЯчейки = Не ПоказыватьСлужебныеЯчейки;
	
	Если ПоказыватьСлужебныеЯчейки = Истина Тогда		
		
		Элементы.ФормаИскатьВСлужебныхЯчейках.Заголовок = "Искать в служебных ячейках.  V";
		СписокЯчеекВыбранногоТовара.Параметры.УстановитьЗначениеПараметра("Владелец", Параметры.Владелец);
		СписокЯчеекВыбранногоТовара.Параметры.УстановитьЗначениеПараметра("ПоказыватьСлужебныеЯчейки", Истина);
		
	Иначе
		
		Элементы.ФормаИскатьВСлужебныхЯчейках.Заголовок = "Искать в служебных ячейках.";
		СписокЯчеекВыбранногоТовара.Параметры.УстановитьЗначениеПараметра("Владелец", Параметры.Владелец);
		СписокЯчеекВыбранногоТовара.Параметры.УстановитьЗначениеПараметра("ПоказыватьСлужебныеЯчейки", Ложь);
		
	КонецЕсли; 

КонецПроцедуры
