&НаКлиенте
Перем Компонента;
&НаКлиенте
Перем РежимВводаАвтоматический;
&НаКлиенте
Перем Ошибка;
&НаКлиенте
Перем ЗаписьЗадНаДостСтруктура;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.СписокВсехГрузовыхМест.Доступность = Ложь;
	
	УстановитьВидимостьКоманднойПанели();
	ПодключитьВнешенюКомпоненту();
	ЗаписьЗадНаДостСтруктура = ОбщегоНазначения.ПолучитьЗаписьИзРегистраСведений("СписокЗаданийНаДоставку", "Объект", Параметры.ЗаданиеНаДоставкуГУИД);	
		
	РезультатСтруктура = ОбщегоНазначения.ПолучитьСписокГрузовыхМест(Параметры.ЗаданиеНаДоставкуГУИД);
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьСписокГрузовыхМест");			
		Возврат;
	КонецЕсли; 
	
	ОбновитьОписаниеПолейДляШапки();
	ОбщегоНазначенияКлиент.ЗаполнитьТабЗначОК(ЭтаФорма);	
	ОбновитьСлуженоеСообщениеПодвал();	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКоманднойПанели()
	
	Если Элементы.ГруппаСвайп.ТекущаяСтраница = Элементы.ГруппаСтраница_1 Тогда
		Элементы.ФормаГруппаКнопок.Видимость = Ложь;	
	Иначе
		Элементы.ФормаГруппаКнопок.Видимость = Истина;			
	КонецЕсли; 
	
КонецПроцедуры
 


&НаКлиенте
Процедура УстановитьРежимПросмотраВсехГрузовыхМест(Режим)
	
	ПодчинМеню = Элементы.СписокВсехГрузовыхМест.КонтекстноеМеню.ПодчиненныеЭлементы;			
	Если Режим = "ПоказатьВсе" Тогда
		                                                              
		СписокВсехГрузовыхМест.Параметры.УстановитьЗначениеПараметра("ОтобразитьВсеЗаписи", Истина);
		СписокВсехГрузовыхМест.Параметры.УстановитьЗначениеПараметра("Погружено", Ложь);
		Элементы.ГруппаШапкаМестПогружено.Видимость = Истина;
		Элементы.ГруппаШапкаМестНаСкладе.Видимость = Истина;
		Элементы.ШапкаГрузовыхМестВсего2.Видимость = Ложь;		
		ПодчинМеню.КонтекстноеМенюВыбрать.Видимость = Ложь;
		
	ИначеЕсли Режим = "ПоказатьМестаНаСкладе" Тогда 
		
		СписокВсехГрузовыхМест.Параметры.УстановитьЗначениеПараметра("ОтобразитьВсеЗаписи", Ложь);
		СписокВсехГрузовыхМест.Параметры.УстановитьЗначениеПараметра("Погружено", Ложь);		
		
		Элементы.ГруппаШапкаМестПогружено.Видимость = Ложь;
		Элементы.ГруппаШапкаМестНаСкладе.Видимость = Истина;
		Элементы.ШапкаГрузовыхМестВсего2.Видимость = Истина;
		ПодчинМеню.КонтекстноеМенюВыбрать.Видимость = Истина;
		
	ИначеЕсли Режим = "ПоказатьМестаВАвто" Тогда 
		
		СписокВсехГрузовыхМест.Параметры.УстановитьЗначениеПараметра("ОтобразитьВсеЗаписи", Ложь);
		СписокВсехГрузовыхМест.Параметры.УстановитьЗначениеПараметра("Погружено", Истина);		
		Элементы.ГруппаШапкаМестПогружено.Видимость = Истина;
		Элементы.ГруппаШапкаМестНаСкладе.Видимость = Ложь;
		ПодчинМеню.КонтекстноеМенюВыбрать.Видимость = Ложь;
		
	КонецЕсли; 
	
	ОбновитьСлуженоеСообщениеПодвал(Режим);	
	Элементы.СписокВсехГрузовыхМест.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура ПодключитьВнешенюКомпоненту()
	
	Компонента = ОбщегоНазначенияКлиент.ПодключитьКомпоненту();
	Если Компонента <> Неопределено И Не Компонента.Подключить() Тогда
		ТекстОшибки = "";
		КодОшибки = Компонента.ПолучитьОшибку(ТекстОшибки);
		ПоказатьПредупреждение(,"Ошибка: "+КодОшибки+", " + ТекстОшибки);
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "Компонента");					
	КонецЕсли;
	
КонецПроцедуры
 

&НаКлиенте
Процедура ОбновитьСлуженоеСообщениеПодвал(Режим = "") Экспорт
	
	ЭтаФорма.Подвал.Очистить();	
	СтрокаТЗ = Подвал.Добавить();

	СтрокаТЗ.ФИОСотрудинка = ОбщегоНазначенияКлиент.ПолучитьОписаниеСотрудника();
	Элементы.Подвал.Обновить();
	
	ЭтаФорма.ПодвалСообщение.Очистить();	
	СообщениеДляПользователя = ОбщегоНазначения.ПолучитьИнструкциюДляДействийПользователя_ЗаданиеНаДОставку(ЭтаФорма.ИмяФормы, Режим);
	
	Если Элементы.ГруппаСвайп.ТекущаяСтраница = Элементы.ГруппаСтраница_1 Тогда
		
		СтрокаТЗ = ПодвалСообщение.Добавить();				
		СтрокаТЗ.СообщениеДляПользователя = СообщениеДляПользователя;
		
	ИначеЕсли Элементы.ГруппаСвайп.ТекущаяСтраница = Элементы.ГруппаСтраница_2 Тогда
		
		Если ЗначениеЗаполнено(СообщениеДляПользователя) Тогда
			СтрокаТЗ = ПодвалСообщение.Добавить();		
			СтрокаТЗ.СообщениеДляПользователя = СообщениеДляПользователя;
		КонецЕсли;
	КонецЕсли; 	
	
	Элементы.ПодвалСообщение.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура ГруппаСвайпПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Элементы.СписокВсехГрузовыхМест.Доступность = Истина;
	Если ТекущаяСтраница.Имя = "ГруппаСтраница_2" Тогда 
			
		РезультатСтруктура = ОбщегоНазначения.ПолучитьСписокГрузовыхМест(Параметры.ЗаданиеНаДоставкуГУИД, Истина);	
		Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
			ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
			ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьСписокГрузовыхМест");			
			Возврат;
		КонецЕсли; 
		
		Элементы.ГруппаШапка.Видимость = Ложь;
		УстановитьВидимостьКоманднойПанели();
		УстановитьРежимПросмотраВсехГрузовыхМест("ПоказатьМестаНаСкладе");
		
	Иначе
		
		УстановитьВидимостьКоманднойПанели();		
		Элементы.ГруппаШапка.Видимость = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры                                                       

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокВсехГрузовыхМест.Параметры.УстановитьЗначениеПараметра("ОтобразитьВсеЗаписи", Истина);
	СписокВсехГрузовыхМест.Параметры.УстановитьЗначениеПараметра("Погружено", Ложь);

	ОбщегоНазначения.УстановитьРежимРаботыСЗаданиемНаДоставку("ГотовКСканированиюГрузовогоМеста");
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	                                                                                                   
	Если Событие = "UniversalBroadcastEvent" Тогда
		
		Результат = ОбщегоНазначения.ПолучитьЗначениеШтрихкода(Данные);
		Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
			ПоказатьПредупреждение(, "Ошибка сканирования штрихкода", 4);
			Возврат;			
		КонецЕсли; 
		
		ЭтаФорма.Штрихкод = Результат.Штрихкод;
		ЕстьМестоВПогруженных = ОбщегоНазначения.ПолучитьГрузовоеМестоВПогруженных(ЭтаФорма.Штрихкод,Параметры.ЗаданиеНаДоставкуГУИД);
		Если ЗначениеЗаполнено(ЕстьМестоВПогруженных) Тогда 			
			ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();
			ТекстСообщения = "ГРУЗОВОЕ МЕСТО УЖЕ ПОГРУЖЕНО !";
			ОписаниеОшибки = ТекстСообщения;
			
			ОбщегоНазначенияКлиент.ИнициализацияТЗ_Набрано(ЭтаФорма);
			НоваяСтрока = ЭтаФорма.Набрано[0];
			НоваяСтрока.СообщениеОбОшибке = ТекстСообщения;			
			ПоказатьСтраницу_РаботыСГрузовымМестом();
			ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();
			Возврат; 			
		КонецЕсли;
		ЭтаФорма.ГрузовоеМестоГУИД = ОбщегоНазначения.ПолучитьГрузовоеМесто(ЭтаФорма.Штрихкод);
		Если Не ЗначениеЗаполнено( ЭтаФорма.ГрузовоеМестоГУИД ) Тогда
			
			ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();			 
			ТекстСообщения = "Грузовое место не обнаружено в выбранном задании на доставку.";
			ОписаниеОшибки = ТекстСообщения;
			
			ОбщегоНазначенияКлиент.ИнициализацияТЗ_Набрано(ЭтаФорма);
	    	НоваяСтрока = ЭтаФорма.Набрано[0];
			НоваяСтрока.СообщениеОбОшибке = ТекстСообщения;
			ПоказатьСтраницу_РаботыСГрузовымМестом();
			Возврат;
			                                                                 
		КонецЕсли; 
		
		// Пользователь может нажать несколько раз сканирование штрихкода, но форма уже закрыта.
		Если ВводДоступен() Тогда
			ОбработкаОтсканированногоГрузовогоМеста();	
		КонецЕсли; 
				
	ИначеЕсли Событие = "ClipboardEvent" Тогда                 
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтсканированногоГрузовогоМеста()                                
	
	ОбщегоНазначения.УстановитьРежимРаботыСЗаданиемНаДоставку("ПоискГрузовогоМеста");
	РезультатСтруктура = ОбщегоНазначения.ОбработатьОтсканированноеГрузовоеМесто(Параметры.ЗаданиеНаДоставкуГУИД, ЭтаФорма.ГрузовоеМестоГУИД);	
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) И РезультатСтруктура.Свойство("КодРезультата",) = Ложь Тогда
		
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		Возврат;
		
	КонецЕсли;
	
	Запись = ОбщегоНазначения.ПолучитьЗаписьИзРегистраСведений("СписокГрузовыхМест", "ШтрихкодГрузовогоМеста", ЭтаФорма.Штрихкод);	
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) И РезультатСтруктура.Свойство("КодРезультата",) И РезультатСтруктура.КодРезультата < 300 Тогда
		
		ОписаниеОшибки = РезультатСтруктура.Ошибка;
		
		ОбщегоНазначенияКлиент.ИнициализацияТЗ_Набрано(ЭтаФорма);
    	НоваяСтрока = ЭтаФорма.Набрано[0];
		НоваяСтрока.СообщениеОбОшибке = ОписаниеОшибки;
		ПоказатьСтраницу_РаботыСГрузовымМестом();
		Возврат;
		
	КонецЕсли; 
	
	
	Если РезультатСтруктура.Данные.КодРезультата = 300 Тогда
		
		ПоказатьПредупреждение(, РезультатСтруктура.Данные.Сообщение, 4);
		Закрыть();
		Возврат;
		
	КонецЕсли; 
	
	КоличествоОтсканирГрузовыхМестНаТСД = КоличествоОтсканирГрузовыхМестНаТСД + 1;
	
	РезультатСтруктура = ОбщегоНазначения.ПолучитьСписокГрузовыхМест(Параметры.ЗаданиеНаДоставкуГУИД);
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьСписокГрузовыхМест");			
		Возврат;
	КонецЕсли;                                                     
	РезультатСтруктура = ОбщегоНазначения.ПолучитьСписокГрузовыхМест(Параметры.ЗаданиеНаДоставкуГУИД, Истина);	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьСписокГрузовыхМест");			
		Возврат;
	КонецЕсли;	
	ОбновитьОписаниеПолейДляШапки();
	ОбщегоНазначенияКлиент.ОтобразитьИнформациюОГрузовомМесте_Структура(Запись[0], ЭтаФорма);
	ПоказатьСтраницу_РаботыСГрузовымМестом();
	
КонецПроцедуры
 

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Компонента <> Неопределено Тогда
		Компонента.Отключить();
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ОбновитьОписаниеПолейДляШапки()                                                     
			
	ШапкаСтатус = "В работе: " + ЗаписьЗадНаДостСтруктура[0].Номер;
	ШапкаГрузовыхМестВсего = "Грузовых мест всего: " + Строка(ЗаписьЗадНаДостСтруктура[0].КоличествоВсего);
	ШапкаГрузовыхМестПогружено = "Погружено: " + Строка(ЗаписьЗадНаДостСтруктура[0].КоличествоПогружено + КоличествоОтсканирГрузовыхМестНаТСД);
	ШапкаФИОВодителя = ЗаписьЗадНаДостСтруктура[0].ВодительНаименование;
	ШапкаГрузовыхМестНаСкладе = "На складе: " + Строка(ЗаписьЗадНаДостСтруктура[0].КоличествоНеЗагружено);
	
КонецПроцедуры
 
&НаКлиенте
Процедура ОбработкаСобытия(ИмяСобытия) Экспорт
	
	Если ИмяСобытия = "СканированиеШтрихкода" Тогда
		
		#Если МобильноеПриложениеКлиент Тогда
		Если ЗначениеЗаполнено(ЭтаФорма.ОписаниеОшибки) Тогда
			Компонента.Отключить();
		Иначе
			Компонента.Подключить();
		КонецЕсли; 
		#КонецЕсли 	
	
		Возврат;		
		
	КонецЕсли; 
	
КонецПроцедуры
                                                                                              

&НаКлиенте
Процедура ПоказатьСтраницу_РаботыСГрузовымМестом() Экспорт
	
	СтатусРаботы = ОбщегоНазначения.ПолучитьСтатусРаботыСЗаданиемНаДоставку();
	ОбновитьСлуженоеСообщениеПодвал();
	
	Элементы.ГруппаШапка.Видимость = Истина;
	Элементы.Набрано.Обновить();
	Если ЗначениеЗаполнено(ЭтаФорма.ОписаниеОшибки) Тогда
		
		Элементы.ГруппаСвайп.ТекущаяСтраница = Элементы.ГруппаСтраница_1;
		Элементы.ГруппаСвайп.ТекущаяСтраница.Видимость = Истина;
		
		Элементы.Страницы_РаботыСГрузовымМестом.ТекущаяСтраница = Элементы.Страница_ОшибкиСканирования;
		Элементы.Страница_ОшибкиСканирования.Видимость = Истина;
		Элементы.СтраницаОбработкиГрузовогоМеста.Видимость = Ложь;			
		ЭтаФорма.ОписаниеОшибки = "";
		Возврат;
		
	КонецЕсли; 
		
	Если СтатусРаботы = "ГотовКСканированиюГрузовогоМеста" Или СтатусРаботы = "ПоискГрузовогоМеста" Тогда
		
		Элементы.ГруппаСвайп.ТекущаяСтраница = Элементы.ГруппаСтраница_1;
		Элементы.ГруппаСвайп.ТекущаяСтраница.Видимость = Истина;
		
		Элементы.Страницы_РаботыСГрузовымМестом.ТекущаяСтраница = Элементы.СтраницаОбработкиГрузовогоМеста;
		Элементы.СтраницаОбработкиГрузовогоМеста.Видимость = Истина;
		Элементы.Страница_ОшибкиСканирования.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура МестаВАвто(Команда)
		
	УстановитьРежимПросмотраВсехГрузовыхМест("ПоказатьМестаВАвто");
	
КонецПроцедуры


&НаКлиенте
Процедура МестаНаСкладе(Команда)
	
	УстановитьРежимПросмотраВсехГрузовыхМест("ПоказатьМестаНаСкладе");

КонецПроцедуры


&НаКлиенте
Процедура ПоказатьВсе(Команда)
	
	УстановитьРежимПросмотраВсехГрузовыхМест("ПоказатьВсе");
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура СписокВсехГрузовыхМестПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Ключи = Строки.ПолучитьКлючи();
	Для Индекс = 0  По Ключи.Количество()-1 Цикл

		СтрокаСписка = Строки[Ключи[Индекс]];
				
		Если СтрокаСписка.Данные["СтатусГрузовогоМеста"] = "Погружено" Тогда	
			
			СтрокаСписка.Оформление["СтатусГрузовогоМеста"].УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноЗеленый);
			
		ИначеЕсли СтрокаСписка.Данные["СтатусГрузовогоМеста"] = "На складе" Тогда						
			
			СтрокаСписка.Оформление["СтатусГрузовогоМеста"].УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноКрасный);				
			
		КонецЕсли; 
			
	КонецЦикла; 
	
КонецПроцедуры


&НаКлиенте
Процедура Выбрать(Команда)
	
	ЭтаФорма.Штрихкод = Элементы.СписокВсехГрузовыхМест.ТекущиеДанные.ШтрихкодГрузовогоМеста;
	ЭтаФорма.ГрузовоеМестоГУИД = Элементы.СписокВсехГрузовыхМест.ТекущиеДанные.ГрузовоеМестоГУИД;
	ОбработкаОтсканированногоГрузовогоМеста();	
	
	ОбщегоНазначения.УстановитьРежимРаботыСЗаданиемНаДоставку("ПоискГрузовогоМеста");	
	ПоказатьСтраницу_РаботыСГрузовымМестом();	
	
КонецПроцедуры

