
&НаКлиенте
Процедура Сохранить(Команда)
	//+Кабанов А.В. 04.12.2024 #UT10-4950
	Закрыть(Новый Структура("ДатаПрихода,КоличествоМест",ДатаПрихода,КоличествоМест));
	//-Кабанов А.В. 04.12.2024 #UT10-4950
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//+Кабанов А.В. 04.12.2024 #UT10-4950
	Если Параметры.Свойство("ДатаПрихода") Тогда
		ДатаПрихода = Параметры.ДатаПрихода;
	КонецЕсли;  
	
	Если Параметры.Свойство("КоличествоМест") Тогда
		КоличествоМест = Параметры.КоличествоМест;
	КонецЕсли;  
	//-Кабанов А.В. 04.12.2024 #UT10-4950	
КонецПроцедуры
