
&НаКлиенте
Перем Компонента;

&НаКлиенте
Перем ОбновитьФормуПриВведеномЗначенииПоиска;


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначения.ОчиститьРегистрСведений("СписокНайденныхТоваровПоШтрихкоду");
	ОбщегоНазначения.ОчиститьРегистрСведений("СписокТоваровЯчейки");
	
	ОбщегоНазначения.УстановитьРежимВыбораДляОстатковПоТоварам("ПоискПоШК_ОтсканируйтеТовар");
	ИскатьВСлужебныхЯчейках = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьФормуПриВведеномЗначенииПоиска = Ложь;
	Компонента = ОбщегоНазначенияКлиент.ПодключитьКомпоненту();
	
	Если Компонента <> Неопределено И Не Компонента.Подключить() Тогда
		ТекстОшибки = "";
		КодОшибки = Компонента.ПолучитьОшибку(ТекстОшибки);
		ПоказатьПредупреждение(,"Ошибка: "+КодОшибки+", " + ТекстОшибки);
	КонецЕсли;

	ОбщегоНазначенияКлиент.ЗаполнитьТабЗначОК(ЭтаФорма);		
	СтрокаТЗ = ЭтаФорма.КнопкаПоказатьОстатки.Добавить();
	СтрокаТЗ.ПоказатьОстатки = Символы.ПС + "ПОКАЗАТЬ ОСТАТКИ" + Символы.ПС;
	
	ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();
	//ПодключитьОбработчикОжидания("ОбновитьФормуПриВведеномЗначенииПоиска", 1, Ложь);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьФормуПриВведеномЗначенииПоиска() Экспорт
		
	Если ОбновитьФормуПриВведеномЗначенииПоиска И СтрДлина(Элементы.Поиск.ТекстРедактирования) >= 3 Тогда
		
		ОбновитьФормуПриВведеномЗначенииПоиска = Ложь;
		ОписаниеОшибки = "";
		ЭтаФорма.Набрано.Очистить();		
		
		Если Элементы.ГруппаСвайп.ТекущаяСтраница.Имя = "ГруппаСтраницыРаботыСЯчейкой" Тогда		
			ОбщегоНазначения.УстановитьРежимВыбораДляОстатковПоТоварам("ПоискПоЯчейке_ОтсканируйтеЯчейку");								
		Иначе
			ОбщегоНазначения.УстановитьРежимВыбораДляОстатковПоТоварам("ПоискПоШК_ОтсканируйтеТовар");
		КонецЕсли;
		
		ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();
		ЭтотОбъект.ТекущийЭлемент = Элементы.Поиск;	
		ЭтаФорма.Поиск = Элементы.Поиск.ТекстРедактирования;				
		
	КонецЕсли; 
	
КонецПроцедуры
 
 
&НаКлиенте
Процедура ОбновитьСлуженоеСообщениеПодвал() Экспорт
	
	ЭтаФорма.Подвал.Очистить();	
	СтрокаТЗ = Подвал.Добавить();

	СтрокаТЗ.ФИОСотрудинка = ОбщегоНазначенияКлиент.ПолучитьОписаниеСотрудника();
	Элементы.Подвал.Обновить();
	
	Сообщение = ОбщегоНазначения.ПолучитьИнструкциюДействийДляПользователя_ОстаткиТоваров(ЭтаФорма.ИмяФормы);
	ЭтаФорма.ПодвалСообщение.Очистить();	
	Если ЗначениеЗаполнено(Сообщение) Тогда
		
		СтрокаТЗ = ПодвалСообщение.Добавить();	
		СтрокаТЗ.СообщениеДляПользователя = Сообщение;
		Элементы.ПодвалСообщение.Обновить();
		
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте                                                              
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если Событие = "UniversalBroadcastEvent" Тогда
		
		Результат = ОбщегоНазначения.ПолучитьЗначениеШтрихкода(Данные);
		Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
			ПоказатьПредупреждение(, "Ошибка сканирования штрихкода", 4);
		КонецЕсли; 
		
		Объект.Штрихкод = Результат.Штрихкод;
		ЭтаФорма.ОписаниеОшибки = "";
		// Пользователь может нажать несколько раз сканирование штрихкода, но форма уже закрыта.
		Если ВводДоступен() Тогда
			
			Если Элементы.ГруппаСвайп.ТекущаяСтраница.Имя = "ГруппаСтраницыРаботаСТоваром" Тогда			
				
				ОбщегоНазначения.УстановитьРежимВыбораДляОстатковПоТоварам("ПоискПоШК_ОтсканируйтеТовар");
				ОбработкаОтсканированногоТовара();	
				
			ИначеЕсли Элементы.ГруппаСвайп.ТекущаяСтраница.Имя = "ГруппаСтраницыРаботыСЯчейкой" Тогда 		
			
				ОбщегоНазначения.УстановитьРежимВыбораДляОстатковПоТоварам("ПоискПоЯчейке_ОтсканируйтеЯчейку");
				ОбработкаОтсканированнойЯчейки();	
				
			КонецЕсли;
			
		КонецЕсли; 
				
	ИначеЕсли Событие = "ClipboardEvent" Тогда                 
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтсканированногоТовара(ВведеноЗначениеПоиска = Ложь, ТоварИзСпискаНайденных = "")
	
	Если ВведеноЗначениеПоиска Тогда
		Объект.Штрихкод = ЭтаФорма.Поиск;		
		ЭтаФорма.Поиск = "";
	КонецЕсли; 

	ЭтаФорма.ТоварГУИД = ТоварИзСпискаНайденных;                
	ДокументГУИД = "";
	ТипДокумента = "";
		
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Найти товар по штрихкоду
	РезультатСтруктура = ОбщегоНазначения.НайтиТоварПоШтрихкодуСОстатками(Объект.Штрихкод, ЭтаФорма.ТоварГУИД);	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		Объект.Штрихкод = "";
		Возврат;
		                                                  
	КонецЕсли; 
	
	// Заполняеть РС "Список товаров" для выбора найденными товарами по ШК из РС "СписокНайденныхТоваровПоШтрихкоду"
	ОбщегоНазначения.ЗаполнитьСписокТоваровДляВыбора();
	КоличествоНайденныхТоваровПоШК = ОбщегоНазначения.ПолучитьКоличествоЗаписейВРегистреСведений("СписокТоваровДляВыбора");
		
	Если КоличествоНайденныхТоваровПоШК  = 0 Тогда
		
		ОбновитьФормуПриВведеномЗначенииПоиска = Ложь;
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
		ОписаниеОшибки = "По введеным данным " + Объект.Штрихкод + " совпадений не найдено.";                 
		Объект.Штрихкод = "";
		ЭтаФорма.Набрано.Очистить();
		НоваяСтрока = ЭтаФорма.Набрано.Добавить();		
		НоваяСтрока.СообщениеТоварНеНайден = ОписаниеОшибки; 
		ОбщегоНазначения.УстановитьРежимВыбораДляОстатковПоТоварам("ПоискПоШК_ОтсканируйтеТовар");
		ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();
		                                                            
		Возврат;                          
		
	ИначеЕсли КоличествоНайденныхТоваровПоШК > 1 Тогда 
		
		ОписаниеОшибки = "";
		ОбщегоНазначения.УстановитьРежимВыбораДляОстатковПоТоварам("ПоискПоШК_ВыберитеТовар");		
		Оповещение = Новый ОписаниеОповещения("ПолучениеДанныхПриЗакрытииФормыВыбораТовараДокумента", ЭтотОбъект);																												
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("НайденныеТовары", РезультатСтруктура.Данные);		
		ОткрытьФорму("Обработка.ОстаткиПоЯчейкам.Форма.ФормаВыбораТовараДокумента", ПараметрыФормы, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	Иначе 
		
		ОбновитьФормуПриВведеномЗначенииПоиска = Истина;
		ОписаниеОшибки = "";
		ОбщегоНазначения.УстановитьРежимВыбораДляОстатковПоТоварам("ПоискПоШК_ПросмотрОстатковЯчейках");		
		ЭтаФорма.ТоварГУИД = РезультатСтруктура.Данные[0].Владелец; 		
		ЗаписьТЗ = ОбщегоНазначения.ПолучитьИтогиПоОстаткамПоВыбранномуТовару(ЭтаФорма.ТоварГУИД, Объект.Штрихкод);
		ОбщегоНазначенияКлиент.ОтобразитьИнформациюОТоваре_ОстаткиТоваровПоШК(ЭтаФорма, Объект.Штрихкод, ЗаписьТЗ);				
		ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();
		
	КонецЕсли;                                                                        
				                                                                         
КонецПроцедуры


&НаКлиенте		  
Процедура ПолучениеДанныхПриЗакрытииФормыВыбораТовараДокумента(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ОбновитьФормуПриВведеномЗначенииПоиска = Истина;		
		ОбщегоНазначения.УстановитьРежимВыбораДляОстатковПоТоварам("ПоискПоШК_ПросмотрОстатковЯчейках");
		ЭтаФорма.ТоварГУИД = Результат.ТоварГУИД;		
		//ЗаписьТЗ = ОбщегоНазначения.ПолучитьЗаписьИзРегистраСведений("СписокНайденныхТоваровПоШтрихкоду", "Владелец", ЭтаФорма.ТоварГУИД);
		ЗаписьТЗ = ОбщегоНазначения.ПолучитьИтогиПоОстаткамПоВыбранномуТовару(ЭтаФорма.ТоварГУИД, Объект.Штрихкод);
		ОбщегоНазначенияКлиент.ОтобразитьИнформациюОТоваре_ОстаткиТоваровПоШК(ЭтаФорма, Объект.Штрихкод, ЗаписьТЗ);		
		ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();
		
	КонецЕсли; 	
	
КонецПроцедуры
 
&НаКлиенте
Процедура Поиск(Команда)
	
	ЭтаФорма.ОписаниеОшибки = "";
	
	Если Элементы.ГруппаСвайп.ТекущаяСтраница.Имя = "ГруппаСтраницыРаботаСТоваром" Тогда			
		
		Если Не ЗначениеЗаполнено(ЭтаФорма.Поиск) Тогда
			ПоказатьПредупреждение(, "Введите штрихкод или код производителя !!!", 4);
			Возврат;
		КонецЕсли; 
		
		ВведеноЗначениеПоиска = Истина;
		ОбработкаОтсканированногоТовара(ВведеноЗначениеПоиска);
		
	ИначеЕсли Элементы.ГруппаСвайп.ТекущаяСтраница.Имя = "ГруппаСтраницыРаботыСЯчейкой" Тогда 		
		
		Если Не ЗначениеЗаполнено(ЭтаФорма.Поиск) Тогда
			ПоказатьПредупреждение(, "Введите ячейку !!!", 4);
			Возврат;
		КонецЕсли; 
		
		ВведеноЗначениеПоиска = Истина;
		Объект.Штрихкод = ЭтаФорма.Поиск;		
		ОбработкаОтсканированнойЯчейки(ВведеноЗначениеПоиска);
				
	КонецЕсли;
		
		
КонецПроцедуры


&НаКлиенте
Процедура СписокНайденныхТоваровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Закрыть();                                                                
	ЭтаФорма.ТоварГУИД = Элементы.СписокНайденныхТоваров.ДанныеСтроки(ВыбраннаяСтрока).Владелец;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Штрихкод", Объект.Штрихкод); 
	ПараметрыФормы.Вставить("ТоварГУИД", ЭтаФорма.ТоварГУИД); 
	ОткрытьФорму("Обработка.ОстаткиПоЯчейкам.Форма.СписокЯчеекВыбраногоТовара", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Компонента <> Неопределено Тогда
		Компонента.Отключить();
	КонецЕсли;

	ОтключитьОбработчикОжидания("ОбновитьФормуПриВведеномЗначенииПоиска");
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров() Экспорт
		                                                             
	ОбновитьСлуженоеСообщениеПодвал();
	Элементы.Набрано.Обновить();
	СтатусРаботыСОстаткамиТоваров = ОбщегоНазначения.ПолучитьСтатусРаботыСОстаткамиТоваров();
	
	Если Найти(СтатусРаботыСОстаткамиТоваров, "ПоискПоШК_") > 0 И ЗначениеЗаполнено(ЭтаФорма.ОписаниеОшибки) Тогда
		
		Элементы.ГруппаСвайп.ТекущаяСтраница= Элементы.ГруппаСтраницыРаботаСТоваром;																		 
		Элементы.ГруппаОшибкаСканирования.Видимость = Истина;
		Элементы.ГруппаОписаниеТовара.Видимость = Ложь;
		Возврат;
		
	ИначеЕсли Найти(СтатусРаботыСОстаткамиТоваров, "ПоискПоЯчейке_") > 0  И ЗначениеЗаполнено(ЭтаФорма.ОписаниеОшибки) Тогда 
				
		Элементы.ГруппаСвайп.ТекущаяСтраница= Элементы.ГруппаСтраницыРаботыСЯчейкой;																		 
		Элементы.ГруппаОшибкаСканированияЯчейки.Видимость = Истина;
		Элементы.ГруппаСписокТоваровЯчейки.Видимость = Ложь;
		Элементы.ЗаглушкаДляНачалаСканированияЯчейки.Видимость = Ложь;						
		Возврат;
		
	КонецЕсли; 
					
	Если СтатусРаботыСОстаткамиТоваров = "ПоискПоШК_ОтсканируйтеТовар" Тогда
		
		Элементы.ГруппаСвайп.ТекущаяСтраница= Элементы.ГруппаСтраницыРаботаСТоваром;																		 
		Элементы.ГруппаОписаниеТовара.Видимость = Истина;
		Элементы.ГруппаОшибкаСканирования.Видимость = Ложь;
		Элементы.КнопкаПоказатьОстатки.Видимость = Ложь;
		Элементы.ЗаглушкаДляНачалаСканирования.Видимость = Истина;
		Элементы.ЗаглушкаДляКнопкиПоказатьОстатки.Видимость = Ложь;
		
	ИначеЕсли СтатусРаботыСОстаткамиТоваров = "ПоискПоШК_ПросмотрОстатковЯчейках" Тогда
		
		Элементы.ГруппаСвайп.ТекущаяСтраница = Элементы.ГруппаСтраницыРаботаСТоваром;																		 
		Элементы.ГруппаОписаниеТовара.Видимость = Истина;
		Элементы.ГруппаОшибкаСканирования.Видимость = Ложь;
		Элементы.КнопкаПоказатьОстатки.Видимость = Истина;
		Элементы.ЗаглушкаДляНачалаСканирования.Видимость = Ложь;
		Элементы.ЗаглушкаДляКнопкиПоказатьОстатки.Видимость = Истина;
		
	ИначеЕсли СтатусРаботыСОстаткамиТоваров = "ПоискПоЯчейке_ОтсканируйтеЯчейку"  Тогда
		
		Элементы.ГруппаСвайп.ТекущаяСтраница = Элементы.ГруппаСтраницыРаботыСЯчейкой;																		 
		Элементы.ГруппаСписокТоваровЯчейки.Видимость = Истина;		
		Элементы.ЗаглушкаДляНачалаСканированияЯчейки.Видимость = Истина;		
		Элементы.СписокТоваровЯчейки.Видимость = Ложь;
		Элементы.ГруппаОшибкаСканированияЯчейки.Видимость = Ложь;				
		
	ИначеЕсли СтатусРаботыСОстаткамиТоваров = "ПоискПоЯчейке_ПросмотрЯчейки" Тогда 
		
		Элементы.ГруппаСвайп.ТекущаяСтраница = Элементы.ГруппаСтраницыРаботыСЯчейкой;																		 
		Элементы.ГруппаОшибкаСканированияЯчейки.Видимость = Ложь;
		
		Элементы.СписокТоваровЯчейки.Видимость = Истина;
		Элементы.ГруппаСписокТоваровЯчейки.Видимость = Истина;				
		
		Элементы.ЗаглушкаДляНачалаСканированияЯчейки.Видимость = Ложь;		
			
	КонецЕсли;	

КонецПроцедуры


&НаКлиенте
Процедура ИскатьВСлужебныхЯчейках(Команда)
	
	ИскатьВСлужебныхЯчейках = Не ИскатьВСлужебныхЯчейках;
	
	Если ИскатьВСлужебныхЯчейках = Истина Тогда		
		Элементы.ИскатьВСлужебныхЯчейках.Заголовок = "v Искать в служебных ячейках."
	Иначе
		Элементы.ИскатьВСлужебныхЯчейках.Заголовок = "Искать в служебных ячейках."
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура КнопкаПоказатьОстаткиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "КнопкаПоказатьОстаткиПоказатьОстатки" Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("НабраноЗначение", Набрано);
		ПараметрыФормы.Вставить("Владелец", ЭтаФорма.ТоварГУИД); 
	
		ОткрытьФорму("Обработка.ОстаткиПоЯчейкам.Форма.ФормаСписокЯчеекНайденногоТовараПоШК", ПараметрыФормы, ЭтаФорма,,, , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
			
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ГруппаСвайпПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ОбновитьЭлементПоиск();
	ЭтаФорма.Поиск = "";	
	ЭтаФорма.ОписаниеОшибки = "";
	Если ТекущаяСтраница.Имя = "ГруппаСтраницыРаботыСЯчейкой" Тогда
		
		ОбщегоНазначения.ОчиститьРегистрСведений("СписокТоваровЯчейки");
		Элементы.СписокТоваровЯчейки.Обновить();		
		ЭтаФорма.Набрано.Очистить();		
		ОбщегоНазначения.УстановитьРежимВыбораДляОстатковПоТоварам("ПоискПоЯчейке_ОтсканируйтеЯчейку");
		ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();
		
	Иначе 	
	
		ОбщегоНазначения.ОчиститьРегистрСведений("СписокНайденныхТоваровПоШтрихкоду");
		ЭтаФорма.Набрано.Очистить();		
		ОбщегоНазначения.УстановитьРежимВыбораДляОстатковПоТоварам("ПоискПоШК_ОтсканируйтеТовар");
		ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		
		
	КонецЕсли; 	
		
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьЭлементПоиск()
		                                              
	Если Элементы.ГруппаСвайп.ТекущаяСтраница.Имя = "ГруппаСтраницыРаботыСЯчейкой" Тогда		
		Элементы.Поиск.Заголовок = "Ячейка";
	ИначеЕсли Элементы.ГруппаСвайп.ТекущаяСтраница.Имя = "ГруппаСтраницыРаботаСТоваром" Тогда 
		Элементы.Поиск.Заголовок = "Товар";		
	КонецЕсли; 	
	
КонецПроцедуры
 
&НаКлиенте
Процедура ОбработкаОтсканированнойЯчейки(ВведеноЗначениеПоиска = Ложь)
	
	Результат = ОбщегоНазначения.ПолучитьЯчейку(Объект.Штрихкод);                     
	Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
		ОписаниеОшибки = "По введенным данным " + Объект.Штрихкод + " совпадений не найдено!" + Символы.ПС;
		ОписаниеОшибки = ОписаниеОшибки + Результат.Ошибка;
		
		ЯчейкаГУИД = "";		
		Объект.Штрихкод = "";
		
		ЭтаФорма.Набрано.Очистить();
		НоваяСтрока = ЭтаФорма.Набрано.Добавить();		
		НоваяСтрока.СообщениеТоварНеНайден = ОписаниеОшибки; 
		ОбщегоНазначения.УстановитьРежимВыбораДляОстатковПоТоварам("ПоискПоЯчейке_ОтсканируйтеЯчейку");
		ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		

		Возврат;
		
	КонецЕсли; 
	
	ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлЯчейки();		
	ЭтаФорма.Поиск = Объект.Штрихкод;
	
	Если ЗначениеЗаполнено(Результат.Данные) Тогда	
		
		ЯчейкаГУИД = Результат.Данные; 
		РезультатСтруктура = ОбщегоНазначения.ПолучитьСписокТоваровИзЯчейки(ЯчейкаГУИД, Истина);
		
		Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
			ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
			Возврат;
		КонецЕсли; 
		
		Элементы.СписокТоваровЯчейки.Обновить();		
		ОбщегоНазначения.УстановитьРежимВыбораДляОстатковПоТоварам("ПоискПоЯчейке_ПросмотрЯчейки");			
		ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();
		
	КонецЕсли;	
	
		
КонецПроцедуры
 

