
&НаКлиенте
Перем Компонента;
&НаКлиенте
Перем Ошибка;

&НаКлиенте
Процедура ЗагрузитьСписокЗаданийНаДоставку() 
	
	РезультатСтруктура = ОбщегоНазначения.ЗагрузитьСписокМаршрутовИзРазгрузкаАвто();	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "ЗагрузитьСписокМаршрутовИзРазгрузкаАвто");					
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗагрузитьСписокЗаданийНаДоставку();
	Элементы.СписокЗаданийНаДоставку.Обновить();
	
	ОбщегоНазначенияКлиент.ЗаполнитьТабЗначОК(ЭтаФорма);	
	ОбновитьСлуженоеСообщениеПодвал();	
	
КонецПроцедуры
 
&НаКлиенте
Процедура ОбновитьСлуженоеСообщениеПодвал() Экспорт
	
	ЭтаФорма.Подвал.Очистить();	
	СтрокаТЗ = Подвал.Добавить();

	СтрокаТЗ.ФИОСотрудинка = ОбщегоНазначенияКлиент.ПолучитьОписаниеСотрудника();
	Элементы.Подвал.Обновить();
	
	ЭтаФорма.ПодвалСообщение.Очистить();	
	СтрокаТЗ = ПодвалСообщение.Добавить();	
	СтрокаТЗ.СообщениеДляПользователя = "Выберите маршрут";
	Элементы.ПодвалСообщение.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСвайпПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "ГруппаСтраница_2" Тогда 
		
	Иначе
		
		
	КонецЕсли; 
	
КонецПроцедуры                                                       

&НаКлиенте                                                                                                                       
Процедура ПолучитьСписокМаршрутовИРазгрузкиАвто(Команда)
	
	ЗагрузитьСписокЗаданийНаДоставку();
	Элементы.СписокЗаданийНаДоставку.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьФормуМаршрутаИзРазгрузкаАвто() 
			
	П = Новый Структура;                                                  
	П.Вставить("МаршрутГУИД", ЭтаФорма.МаршрутГУИД); 
	П.Вставить("ЗаданиеНаДоставкуГУИД", ЭтаФорма.ЗаданиеНаДоставкуГУИД); 
	
	Оповещение = Новый ОписаниеОповещения("ОбновитьДанныеПриЗакытииФормыФормаГрузовогоМеста", ЭтотОбъект );			
	ОткрытьФорму("Обработка.ПриемкаГрузовыхМестИзРазгрузкиАвто.Форма.ФормаМаршрутаИзРазгрузкаАвто", П, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	ОбновитьСлуженоеСообщениеПодвал();	
	
КонецПроцедуры
 

&НаКлиенте
Процедура ОбновитьДанныеПриЗакытииФормыФормаГрузовогоМеста(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.СписокЗаданийНаДоставку.Обновить();
	
КонецПроцедуры
 

&НаКлиенте
Процедура ВыбратьМаршрут(Команда)
	
	ЭтаФорма.МаршрутГУИД = Элементы.СписокЗаданийНаДоставку.ТекущиеДанные.МаршрутГУИД;		
	ЭтаФорма.ЗаданиеНаДоставкуГУИД = Элементы.СписокЗаданийНаДоставку.ТекущиеДанные.ЗаданиеНаДоставкуГУИД;		
	ОткрытьФормуМаршрутаИзРазгрузкаАвто();
		
КонецПроцедуры

