&НаКлиенте
Перем Компонента;


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Компонента = ОбщегоНазначенияКлиент.ПодключитьКомпоненту();
	Если Компонента <> Неопределено И Не Компонента.Подключить() Тогда
		ТекстОшибки = "";
		КодОшибки = Компонента.ПолучитьОшибку(ТекстОшибки);
		ПоказатьПредупреждение(,"Ошибка: "+КодОшибки+", " + ТекстОшибки);
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "Компонента");					
	КонецЕсли;
	
	РезультатСтруктура = ОбщегоНазначения.ПолучитьСписокГрузовыхМест(Параметры.ЗаданиеНаДоставкуГУИД);
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьСписокГрузовыхМест");			
		Возврат;
	КонецЕсли; 
	
	ЭтаФорма.ЗаданиеНаДоставкуНомер = ОбщегоНазначения.ПолучитьНомерЗаданияНаДоставку(Параметры.ЗаданиеНаДоставкуГУИД);
	
	Оповестить("ОбновлениеДанных");
	
КонецПроцедуры


&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если Событие = "UniversalBroadcastEvent" Тогда
		
		Результат = ОбщегоНазначения.ПолучитьЗначениеШтрихкода(Данные);
		Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
			ПоказатьПредупреждение(, "Ошибка сканирования штрихкода", 4);
			Возврат;			
		КонецЕсли; 
		
		ЭтаФорма.Штрихкод = Результат.Штрихкод;
		ЭтаФорма.ГрузовоеМестоГУИД = ОбщегоНазначения.ПолучитьГрузовоеМесто(ЭтаФорма.Штрихкод);
		Если Не ЗначениеЗаполнено( ЭтаФорма.ГрузовоеМестоГУИД ) Тогда
			
			ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();			
			ТекстСообщения = "Отсканированое грузовое место " + ГрузовоеМестоГУИД + Символы.ПС;
			ТекстСообщения = ТекстСообщения + "не обнаружено в выбранном задании на доставку.";
			ПоказатьПредупреждение(, ТекстСообщения, 4);
			Возврат;
			
		КонецЕсли; 
		
		// Пользователь может нажать несколько раз сканирование штрихкода, но форма уже закрыта.
		Если ВводДоступен() Тогда
			ОбработкаОтсканированногоГрузовогоМеста();	
		КонецЕсли; 
				
	ИначеЕсли Событие = "ClipboardEvent" Тогда                 
		
	КонецЕсли;
		                                                                                
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОтсканированногоГрузовогоМеста()                                
	
	РезультатСтруктура = ОбщегоНазначения.ОбработатьОтсканированноеГрузовоеМесто(Параметры.ЗаданиеНаДоставкуГУИД, ЭтаФорма.ГрузовоеМестоГУИД);	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		Возврат;
		
	КонецЕсли; 
	
	Если РезультатСтруктура.Данные.КодРезультата = 300 Тогда
		
		ПоказатьПредупреждение(, РезультатСтруктура.Данные.Сообщение, 4);
		Закрыть();
		Возврат;
		
	КонецЕсли; 
			
	РезультатСтруктура = ОбщегоНазначения.ПолучитьСписокГрузовыхМест(Параметры.ЗаданиеНаДоставкуГУИД);
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьСписокГрузовыхМест");			
		Возврат;
	КонецЕсли; 
			
	Оповестить("ОбновлениеДанных");
		
КонецПроцедуры

&НаКлиенте
Процедура СписокГрузовыхМестВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ЭтаФорма.ГрузовоеМестоГУИД = Элементы.СписокГрузовыхМест.ДанныеСтроки(ВыбраннаяСтрока).ГрузовоеМестоГУИД;	
	ОбработкаОтсканированногоГрузовогоМеста();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновлениеДанных" Тогда
		Элементы.СписокГрузовыхМест.Обновить();
		
		КоличествоЗаписей = ОбщегоНазначения.ПолучитьКоличествоЗаписейВРегистреСведений("СписокЗаданийНаДоставку");
		Если КоличествоЗаписей = 0 Тогда
			ПоказатьПредупреждение(, "Отсутвуют задания на доставку.", 4);
			Закрыть();
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Компонента <> Неопределено Тогда
		Компонента.Отключить();
	КонецЕсли;
	
КонецПроцедуры
 


