
&НаКлиенте
Процедура ОчиститьЛогОшибок(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("РезультатВопроса", ЭтотОбъект, Параметры);
	ТекстВопроса = "Лог ошибок будет полностью очищен. Продолжить?";
	ПоказатьВопрос(Оповещение, ТекстВопроса, Режим); 
	
КонецПроцедуры


&НаКлиенте
Процедура РезультатВопроса(Результат, Параметры) Экспорт 
	
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;	
	
	ОчиститьЛогОшибокНаСервере();
	Элементы.ЛогОшибок.Обновить();
	
КонецПроцедуры
 
&НаСервере
Процедура ОчиститьЛогОшибокНаСервере() Экспорт
	
	НаборЗаписей = РегистрыСведений.РасширенныйЛог.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();	
	
КонецПроцедуры                                               