
&НаКлиенте
Процедура ПоказатьРазмещенные(Команда)
	РазмещенныеТоварыПоказаны = Истина;
	ПоказатьПунктМенюРазмещенныеСтроки();
КонецПроцедуры

&НаКлиенте
Процедура СкрыватьРазмещенные(Команда)	
	РазмещенныеТоварыПоказаны = Ложь;
	ПоказатьПунктМенюРазмещенныеСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПунктМенюРазмещенныеСтроки()
	
	Если РазмещенныеТоварыПоказаны = Ложь Тогда
		Элементы.МенюПоказатьРазмещенные.Видимость  = Истина;
		Элементы.МенюСкрыватьРазмещенные.Видимость = Ложь;
		ТоварыДокумента.Параметры.УстановитьЗначениеПараметра("ПоказыватьРазмещенные", Ложь);
	Иначе
		Элементы.МенюПоказатьРазмещенные.Видимость  = Ложь;
		Элементы.МенюСкрыватьРазмещенные.Видимость = Истина;		
		ТоварыДокумента.Параметры.УстановитьЗначениеПараметра("ПоказыватьРазмещенные", Истина);
	КонецЕсли; 

	Элементы.ТоварыДокумента.Обновить();	
	
КонецПроцедуры
 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПараметрыРаботы = ОбщегоНазначения.ПолучитьПараметрыРаботыСДокументомПТУ();	
	ЗаполнитьЗначенияСвойств(Объект, ПараметрыРаботы);	
	
	РезультатСтруктура = ОбщегоНазначения.ЗагрузитьСписокДокументовПТУ(, Объект.ДокументГУИД);	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		Возврат;
	КонецЕсли; 
	
	Запись = РезультатСтруктура.Данные[0];
	ЭтаФорма.Шапка.Очистить();
	СтрокаТЗ = Шапка.Добавить();
	СтрокаТЗ.ЗаголовокСкладскогоДокумента = "В работе";
	СтрокаТЗ.НомерСкладскогоДокумента = Объект.НомерСкладскогоДокумента;
	ОсталосьЗначение = Строка(Запись.КоличествоТовараОсталостьРазместить);
	
	СтрокаТЗ.ОписаниеСтатусаДокумента = "не размещено: " + Строка(Запись.КоличествоНеРазмещеннныхСтрокНоменклатуры) + " строк, " + ОсталосьЗначение 
									    + " единиц";
	
	РазмещенныеТоварыПоказаны = Ложь;
	ПоказатьПунктМенюРазмещенныеСтроки();
	
	ТоварыДокумента.Параметры.УстановитьЗначениеПараметра("СсылкаПТУ", Параметры.ДокументГУИД);
	ОбщегоНазначенияКлиент.ЗаполнитьТабЗначОК(ЭтаФорма);		
	ОбновитьСлуженоеСообщениеПодвал();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСлуженоеСообщениеПодвал() Экспорт
	
	ЭтаФорма.Подвал.Очистить();	
	СтрокаТЗ = Подвал.Добавить();
	СтрокаТЗ.ФИОСотрудника = ОбщегоНазначенияКлиент.ПолучитьОписаниеСотрудника();
	Элементы.Подвал.Обновить();
	
КонецПроцедуры

