&НаКлиенте
Перем Компонента;


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначения.ОчиститьРегистрСведений("СписокНайденныхТоваровПоШтрихкоду");

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Компонента = ОбщегоНазначенияКлиент.ПодключитьКомпоненту();
	
	Если Компонента <> Неопределено И Не Компонента.Подключить() Тогда
		ТекстОшибки = "";
		КодОшибки = Компонента.ПолучитьОшибку(ТекстОшибки);
		ПоказатьПредупреждение(,"Ошибка: "+КодОшибки+", " + ТекстОшибки);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если Событие = "UniversalBroadcastEvent" Тогда
		
		Результат = ОбщегоНазначения.ПолучитьЗначениеШтрихкода(Данные);
		Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
			ПоказатьПредупреждение(, "Ошибка сканирования штрихкода", 4);
			Возврат;			
		КонецЕсли; 
		
		Объект.Штрихкод = Результат.Штрихкод;
		// Пользователь может нажать несколько раз сканирование штрихкода, но форма уже закрыта.
		Если ВводДоступен() Тогда
			ОбработкаОтсканированногоТовара();	
		КонецЕсли; 
				
	ИначеЕсли Событие = "ClipboardEvent" Тогда                 
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтсканированногоТовара(ВведеноЗначениеПоиска = Ложь, ТоварИзСпискаНайденных = "")
	
	Если ВведеноЗначениеПоиска Тогда
		Объект.Штрихкод = ЭтаФорма.ЗначениеДляПоиска;		
	КонецЕсли; 

	ТоварГУИД = ТоварИзСпискаНайденных;
	ДокументГУИД = "";
	ТипДокумента = "";
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Найти товар по штрихкоду
	РезультатСтруктура = ОбщегоНазначения.НайтиТоварПоШтрихкоду(Объект.Штрихкод, ТипДокумента, ДокументГУИД, ТоварГУИД);	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		Объект.Штрихкод = "";
		Возврат;
		
	КонецЕсли; 
	
	Если РезультатСтруктура.Данные.Количество() = 0 Тогда
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
		ПоказатьПредупреждение(, "Товар со штрихкодом " + Объект.Штрихкод + " не найден.", 4);                 
		Объект.Штрихкод = "";
		Возврат;                          
		
	КонецЕсли;                                                                        
	
	
	ОбщегоНазначения.ЗаписатьРегистрСведений("СписокНайденныхТоваровПоШтрихкоду", РезультатСтруктура.Данные);
	Оповестить("СписокНайденныхТоваровПоШтрихкоду");
	
	КоличествоЗаписей = ОбщегоНазначения.ПолучитьКоличествоЗаписейВРегистреСведений("СписокНайденныхТоваровПоШтрихкоду");
	Если КоличествоЗаписей = 1 Тогда
				
		Закрыть();          
		
		Результат = ОбщегоНазначения.ПолучитьПервуюЗаписьИзРегистраСведений("СписокНайденныхТоваровПоШтрихкоду");		
		ЭтаФорма.ТоварГУИД = Результат[0].Владелец; 
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Штрихкод", Объект.Штрихкод); 		
		ПараметрыФормы.Вставить("ТоварГУИД", ЭтаФорма.ТоварГУИД); 
		ОткрытьФорму("Обработка.ОстаткиПоЯчейкам.Форма.СписокЯчеекВыбраногоТовара", ПараметрыФормы);
		
	КонецЕсли;
		                                                                         
КонецПроцедуры


&НаКлиенте
Процедура Поиск(Команда)
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.ЗначениеДляПоиска) Тогда
		ПоказатьПредупреждение(, "Введите штрихкод или код производителя !!!", 4);
		Возврат;
	КонецЕсли; 
	
	ВведеноЗначениеПоиска = Истина;
	ОбработкаОтсканированногоТовара(ВведеноЗначениеПоиска);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СписокНайденныхТоваровПоШтрихкоду" Тогда
		Элементы.СписокНайденныхТоваров.Обновить();
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура СписокНайденныхТоваровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Закрыть();                                                                
	ЭтаФорма.ТоварГУИД = Элементы.СписокНайденныхТоваров.ДанныеСтроки(ВыбраннаяСтрока).Владелец;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Штрихкод", Объект.Штрихкод); 
	ПараметрыФормы.Вставить("ТоварГУИД", ЭтаФорма.ТоварГУИД); 
	ОткрытьФорму("Обработка.ОстаткиПоЯчейкам.Форма.СписокЯчеекВыбраногоТовара", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Компонента <> Неопределено Тогда
		Компонента.Отключить();
	КонецЕсли;

КонецПроцедуры
 

 



