&НаКлиенте
Перем Компонента;
&НаКлиенте
Перем ВозвратИзСписка;
&НаКлиенте
Процедура ПриОткрытии(Отказ)		
	СписокЯчеек.Параметры.УстановитьЗначениеПараметра("ЗаданиеСсылка", Параметры.ЗаданиеНаИнвентаризациюГУИД);	
	
	Компонента = ОбщегоНазначенияКлиент.ПодключитьКомпоненту();	
	
	Если Компонента <> Неопределено И Не Компонента.Подключить() Тогда		
		ТекстОшибки = "";
		КодОшибки = Компонента.ПолучитьОшибку(ТекстОшибки);                                                   
		ПоказатьПредупреждение(,"Ошибка: "+КодОшибки+", " + ТекстОшибки);
	КонецЕсли;	
	
	ОбновитьЭлементыФормы();
	ВозвратИзСписка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	// Пользователь может нажать несколько раз сканирование штрихкода, но форма уже закрыта.	
	Если Не ВводДоступен() Тогда
		Возврат;
	КонецЕсли; 
	
	Если ВозвратИзСписка Тогда ВозвратИзСписка = Ложь; Возврат; КонецЕсли;
	
	Если Событие = "UniversalBroadcastEvent" Тогда
		
		Результат = ОбщегоНазначения.ПолучитьЗначениеШтрихкода(Данные);
		Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
			ПоказатьПредупреждение(, "Ошибка сканирования штрихкода", 4);
			Возврат;
		КонецЕсли;
		
		ЗапроситьЯчейкуСсервера(Результат.Штрихкод);
									
	КонецЕсли;
		                                                       
КонецПроцедуры
	
&НаКлиенте
Процедура ЗапроситьЯчейкуСсервера(Текст)
	
	ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлЯчейки();
	
	Результат = ОбщегоНазначения.ПолучитьЯчейку(Текст);                     
	Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();
		ТекстОшибки = "Ячейка " + Текст + " некорректна !!!" + Символы.ПС;
		ТекстОшибки = ТекстОшибки + Результат.Ошибка;                              
		ПоказатьПредупреждение(,"Ошибка: " + ТекстОшибки, 3);	
		Штрихкод = "";
		Возврат;
	КонецЕсли; 
	
	ЯчейкаКод = ОбщегоНазначения.ПроверитьПринадлежностьЯчейкиВыбранномуЗаданиюНаИнввентаризацию(Результат.Данные, Параметры.ЗаданиеНаИнвентаризациюГУИД);
	Если ЯчейкаКод = Неопределено Тогда
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();
		ТекстОшибки = "Ячейка " + Текст + " не принадлежит выбранному заданию !!!" + Символы.ПС;
		ТекстОшибки = ТекстОшибки + Результат.Ошибка;
		ПоказатьПредупреждение(,"Ошибка: " + ТекстОшибки, 3);	
		Штрихкод = "";
		Возврат;		
	КонецЕсли; 
	
	
	Если ЗначениеЗаполнено(Результат.Данные) Тогда
		
		Штрихкод = Результат.Данные;
		
		П = Новый Структура;
		П.Вставить("ЗаданиеНаИнвентаризациюГУИД", Параметры.ЗаданиеНаИнвентаризациюГУИД);
		П.Вставить("ЯчейкаГУИД", Штрихкод);
		П.Вставить("ЯчейкаКод", ЯчейкаКод);
		//Кабанов А.В. 17.03.2021 UT10-1585 
		Если  ОбщегоНазначения.ПроверитьЗавершениеЯчейкиИзЗаданияНаИнвентаризацию(Результат.Данные,Параметры.ЗаданиеНаИнвентаризациюГУИД) Тогда 
			Режим = РежимДиалогаВопрос.ДаНет;
			Оповещение = Новый ОписаниеОповещения("ОбработатьОткрытиеЗавершеннойЯчейки", ЭтотОбъект, П);
			ТекстВопроса = "Работа с данной ячейкой завершена " + Символы.ПС;
			ТекстВопроса = ТекстВопроса + " уверены что хотите продолжить ?";
			ПоказатьВопрос(Оповещение, ТекстВопроса, Режим); 
		Иначе			
			Если Компонента <> Неопределено Тогда
				Компонента.Отключить();
			КонецЕсли;			
			Оповещение = Новый ОписаниеОповещения("ОбновитьДанныеПриЗакытииФормыРаботыСЗаданиемНаИнвентаризацию", ЭтотОбъект );
			ОткрытьФорму("Обработка.ИнвентаризацияПоЯчейкам.Форма.ФормаРаботыСЗаданиемНаИнвентаризацию", 
			П, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
		//Кабанов А.В. 17.03.2021 UT10-1585 
	КонецЕсли; 		
КонецПроцедуры

&НаКлиенте
Процедура Выбор(Команда)
	
	ТекущиеДанные = Элементы.СписокЯчеек.ТекущиеДанные;
	Ячейки = ОбщегоНазначения.ПроверитьЗавершениеЯчейкиИзЗаданияНаИнвентаризацию(ТекущиеДанные.ЯчейкаГУИД,Параметры.ЗаданиеНаИнвентаризациюГУИД); 

	П = Новый Структура;
	П.Вставить("ЗаданиеНаИнвентаризациюГУИД", ТекущиеДанные.ЗаданиеНаИнвентаризациюГУИД);   
	П.Вставить("ЯчейкаГУИД", ТекущиеДанные.ЯчейкаГУИД);
	П.Вставить("ЯчейкаКод", ТекущиеДанные.КодЯчейки);
	
	//Кабанов А.В. 17.03.2021 UT10-1585 
	Если ТекущиеДанные.Статус =  "Завершено" Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ОбработатьОткрытиеЗавершеннойЯчейки", ЭтотОбъект, П);
		ТекстВопроса = "Работа с данной ячейкой завершена " + Символы.ПС;
		ТекстВопроса = ТекстВопроса + " уверены что хотите продолжить ?";
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим); 
	Иначе
		Если Компонента <> Неопределено Тогда
			Компонента.Отключить();
		КонецЕсли; 		
		Оповещение = Новый ОписаниеОповещения("ОбновитьДанныеПриЗакытииФормыРаботыСЗаданиемНаИнвентаризацию", ЭтотОбъект );
		ОткрытьФорму("Обработка.ИнвентаризацияПоЯчейкам.Форма.ФормаРаботыСЗаданиемНаИнвентаризацию", 
		П, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	//Кабанов А.В. 17.03.2021 UT10-1585 	
КонецПроцедуры

//Кабанов А.В. 17.03.2021 UT10-1585
&НаКлиенте
Процедура ОбработатьОткрытиеЗавершеннойЯчейки(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли; 	
	Если Компонента <> Неопределено Тогда		
		Компонента.Отключить();
	КонецЕсли; 	
	Оповещение = Новый ОписаниеОповещения("ОбновитьДанныеПриЗакытииФормыРаботыСЗаданиемНаИнвентаризацию", ЭтотОбъект );
	ОткрытьФорму("Обработка.ИнвентаризацияПоЯчейкам.Форма.ФормаРаботыСЗаданиемНаИнвентаризацию", 
	Параметры, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
//Кабанов А.В. 17.03.2021 UT10-1585

&НаКлиенте
Процедура ОбновитьДанныеПриЗакытииФормыРаботыСЗаданиемНаИнвентаризацию(Результат, ДополнительныеПараметры)  Экспорт
	
	Если Компонента <> Неопределено Тогда
		Компонента.Подключить();
	КонецЕсли;

	Элементы.СписокЯчеек.Обновить();
	ОбновитьЭлементыФормы();
	
КонецПроцедуры
 

&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	
	Ячейки = ОбщегоНазначения.ПолучитьЯчейкиИзЗаданияНаИнвентаризацию(ЭтаФорма.Параметры.ЗаданиеНаИнвентаризациюГУИД);
	Проверка = ОбщегоНазначения.МожноВыгрузитьПроинвентаризируемыеТоварыПоВсемЯчейкам(Параметры.ЗаданиеНаИнвентаризациюГУИД, Ячейки);
	
	Если Проверка Тогда		
		Элементы.ВыгрузитьДанные.Видимость = Истина;
	Иначе		
		Элементы.ВыгрузитьДанные.Видимость = Ложь;		
	КонецЕсли; 
	Элементы.КнВыгрузитьДанные.Видимость = Проверка;	
КонецПроцедуры
 

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Компонента <> Неопределено Тогда
		Компонента.Отключить();
	КонецЕсли;		
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокЯчеекПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Ключи = Строки.ПолучитьКлючи();
	Для Индекс = 0  По Ключи.Количество()-1 Цикл

		СтрокаСписка = Строки[Ключи[Индекс]];
				
		Если СтрокаСписка.Данные["Статус"] = "Не начат" Тогда	
			
			СтрокаСписка.Оформление["Статус"].УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноЗеленый);
			
		ИначеЕсли СтрокаСписка.Данные["Статус"] = "В работе" Тогда						
			
			СтрокаСписка.Оформление["Статус"].УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноОранжевый);				
			
		ИначеЕсли СтрокаСписка.Данные["Статус"] = "Завершено" Тогда						
			
			СтрокаСписка.Оформление["Статус"].УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноСиний);				
			
		КонецЕсли; 
			
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанные(Команда)
	
	Ячейки = ОбщегоНазначения.ПолучитьЯчейкиИзЗаданияНаИнвентаризацию(ЭтаФорма.Параметры.ЗаданиеНаИнвентаризациюГУИД);
	РезультатСтруктура = ОбщегоНазначения.ВыгрузитьДанныеИзРСвЗаданиеНаИнвентаризацию(Параметры.ЗаданиеНаИнвентаризациюГУИД, Ячейки);
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		Возврат;
	КонецЕсли; 
	
	// Обновить данные списка задании на инвентаризацию
	РезультатСтруктура = ОбщегоНазначения.ЗагрузитьЗаданияНаИнвентаризцию();
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		Возврат;
	КонецЕсли; 
	
	//Элементы.СписокЗаданий.Обновить();
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Ячейки = ОбщегоНазначения.ПолучитьЯчейкиИзЗаданияНаИнвентаризацию(ЭтаФорма.Параметры.ЗаданиеНаИнвентаризациюГУИД);
	РезультатСтруктура = ОбщегоНазначения.ПроверитьЯчейкиДляВозможностиИхРазблокировки(Ячейки, ЭтаФорма.Параметры.ЗаданиеНаИнвентаризациюГУИД);
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		Возврат;
	КонецЕсли; 
	
	
	Если РезультатСтруктура.Данные = Истина Тогда
		
		УстановитьБлокировку = Ложь;
		РезультатСтруктура = 	ОбщегоНазначения.УстановитьБлокировкуНаЯчейки(Параметры.ЗаданиеНаИнвентаризациюГУИД, Ячейки, УстановитьБлокировку) ;
		
		Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
			ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
			Возврат;
		КонецЕсли; 
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Закрытие" И Параметр = "Список" Тогда
		 ВозвратИзСписка = Истина;
	КонецЕсли;	
КонецПроцедуры



