
&НаКлиенте
Процедура Сборка(Команда) 
	
	Объект.ПроцессМаркировки = "Сборка"; 
	
	Элементы.Сборка.Пометка           = Не Элементы.Сборка.Пометка;	
	Элементы.Оклейка.Пометка          = Ложь;	
	Элементы.Оклейка.ЦветРамки        = Новый Цвет();
	Элементы.Размещение.Пометка       = Ложь;
	Элементы.Размещение.ЦветРамки     = Новый Цвет();
	
	Элементы.Сборка.ЦветРамки         = ?(Элементы.Сборка.Пометка ,WebЦвета.Малиновый,Новый Цвет());
	Элементы.Сборка.КнопкаПоУмолчанию =  Элементы.Сборка.Пометка ; 
	
КонецПроцедуры

&НаКлиенте
Процедура Оклейка(Команда)
	
	Объект.ПроцессМаркировки = "Оклейка";
	
	Элементы.Оклейка.Пометка           = Не Элементы.Оклейка.Пометка;	
	Элементы.Сборка.Пометка            = Ложь;	
	Элементы.Сборка.ЦветРамки          = Новый Цвет();
	Элементы.Размещение.Пометка        = Ложь;
	Элементы.Размещение.ЦветРамки      = Новый Цвет();
	
	Элементы.Оклейка.ЦветРамки         = ?(Элементы.Оклейка.Пометка ,WebЦвета.Малиновый,Новый Цвет());
	Элементы.Оклейка.КнопкаПоУмолчанию =  Элементы.Оклейка.Пометка ; 
	
КонецПроцедуры

&НаКлиенте
Процедура Размещение(Команда)
	
	Объект.ПроцессМаркировки = "Размещение";
	
	Элементы.Размещение.Пометка           = Не Элементы.Размещение.Пометка;	
	
	Элементы.Сборка.Пометка               = Ложь;	
	Элементы.Сборка.ЦветРамки             = Новый Цвет();
	Элементы.Оклейка.Пометка              = Ложь;
	Элементы.Оклейка.ЦветРамки            = Новый Цвет();
	
	Элементы.Размещение.ЦветРамки         = ?(Элементы.Размещение.Пометка ,WebЦвета.Малиновый,Новый Цвет());
	Элементы.Размещение.КнопкаПоУмолчанию =  Элементы.Размещение.Пометка ; 
	
КонецПроцедуры
