&НаКлиенте                                                                            
Процедура ПриОткрытии(Отказ)
	
	Если Параметры.ОтображатьРезультатПроверкиЯчеек  = Ложь Тогда
		ОбщегоНазначения.ОчиститьРегистрСведений("ПроверкаЯчеекДляИнвентаризации");	
		Элементы.СписокЯчеек.ПодчиненныеЭлементы.СписокЯчеекГруппа1.
			ПодчиненныеЭлементы.ГруппаЯчеек1.ПодчиненныеЭлементы.ПризнакИнвентаризации.Видимость = Ложь;
		Элементы.СписокЯчеек.КонтекстноеМеню.ПодчиненныеЭлементы.СписокЯчеекКонтекстноеМенюВыборЯчейки.Видимость = Ложь;
	Иначе 
		Элементы.СписокЯчеек.ПодчиненныеЭлементы.СписокЯчеекГруппа1.
			ПодчиненныеЭлементы.ГруппаЯчеек1.ПодчиненныеЭлементы.ПризнакИнвентаризации.Видимость = Истина;
		Элементы.СписокЯчеек.КонтекстноеМеню.ПодчиненныеЭлементы.СписокЯчеекКонтекстноеМенюВыборЯчейки.Видимость = Истина;
	КонецЕсли;
	
	Компонента = ОбщегоНазначенияКлиент.ПодключитьКомпоненту();	
	
	Если Компонента <> Неопределено И Не Компонента.Подключить() Тогда		
		ТекстОшибки = "";
		КодОшибки = Компонента.ПолучитьОшибку(ТекстОшибки);                                                   
		ПоказатьПредупреждение(,"Ошибка: "+КодОшибки+", " + ТекстОшибки);
	КонецЕсли;	
	
	СписокЯчеек.Параметры.УстановитьЗначениеПараметра("ЗаданиеСсылка", Параметры.ЗаданиеНаИнвентаризациюГУИД);
	Элементы.СписокЯчеек.Обновить();
	
КонецПроцедуры                                                                                       

&НаСервереБезКонтекста
Процедура СписокЯчеекПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Ключи = Строки.ПолучитьКлючи();
	Для Индекс = 0  По Ключи.Количество()-1 Цикл

		СтрокаСписка = Строки[Ключи[Индекс]];                       
		
		Если СтрокаСписка.Данные["ПризнакИнвентаризации"] = "Запрет" Тогда
			
			Если ЗначениеЗаполнено(СтрокаСписка.Оформление.Получить("ПризнакИнвентаризации")) Тогда
				СтрокаСписка.Оформление["ПризнакИнвентаризации"].УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
			КонецЕсли;
			
		ИначеЕсли СтрокаСписка.Данные["ПризнакИнвентаризации"] = "Разрешено" Тогда
			
			Если ЗначениеЗаполнено(СтрокаСписка.Оформление.Получить("ПризнакИнвентаризации")) Тогда
				СтрокаСписка.Оформление["ПризнакИнвентаризации"].УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноСиний);
			КонецЕсли;
			
		КонецЕсли;			
					
		Если СтрокаСписка.Данные["Статус"] = "Не начат" Тогда	
			
			СтрокаСписка.Оформление["Статус"].УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноЗеленый);
			
		ИначеЕсли СтрокаСписка.Данные["Статус"] = "В работе" Тогда						
			
			СтрокаСписка.Оформление["Статус"].УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноОранжевый);				
					
		ИначеЕсли СтрокаСписка.Данные["Статус"] = "Завершено" Тогда						
			
			СтрокаСписка.Оформление["Статус"].УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноСиний);				
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборЯчейки(Команда)
	
	ТекущиеДанные = Элементы.СписокЯчеек.ТекущиеДанные;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЯчейкаГУИД", ТекущиеДанные.СсылкаЯчейки);
	ОткрытьФорму("Обработка.ИнвентаризацияПоЯчейкам.Форма.ФормаСпискаСборокПоЯчейке", ПараметрыФормы);

КонецПроцедуры


