&НаКлиенте
Перем Ошибка;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗагрузитьСписокСлужебныхЗаписок();
	ОбновитьСлуженоеСообщениеПодвал();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСлуженоеСообщениеПодвал() Экспорт
	
	ЭтаФорма.Подвал.Очистить();	
	СтрокаТЗ = Подвал.Добавить();

	СтрокаТЗ.ФИОСотрудинка = ОбщегоНазначенияКлиент.ПолучитьОписаниеСотрудника();
	Элементы.Подвал.Обновить();
	
	ЭтаФорма.ПодвалСообщение.Очистить();	
	СтрокаТЗ = ПодвалСообщение.Добавить();	
	СтрокаТЗ.СообщениеДляПользователя = "Выберите документ";
	Элементы.ПодвалСообщение.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСписокСлужебныхЗаписок()
	
	РезультатСтруктура = ОбщегоНазначения.ЗагрузитьСписокСлужебныхЗаписок();	
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		Возврат;
		
	КонецЕсли; 
	
	Если РезультатСтруктура.Результат Тогда
		Оповестить("ОбновлениеДанных");
	КонецЕсли;     

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокСлужебныхЗаписок(Команда)
	ЗагрузитьСписокСлужебныхЗаписок();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновлениеДанных" Тогда 
		Элементы.СписокСлужебныхЗаписок.Обновить();  
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСписокГрузовыхМест()
	
	Закрыть();	
	П = Новый Структура;
	П.Вставить("СлужебнаяЗапискаГУИД"  , ЭтаФорма.СлужебнаяЗапискаГУИД); 
	П.Вставить("СлужебнаяЗапискаНомер" , ЭтаФорма.СлужебнаяЗапискаНомер);
	ОткрытьФорму("Обработка.СлужебныеЗаписки.Форма.ФормаГрузовогоМеста", П);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСлужебнуюЗаписку(Команда)
	
	ЭтаФорма.СлужебнаяЗапискаГУИД  = Элементы.СписокСлужебныхЗаписок.ТекущиеДанные.СсылкаСлужебнаяЗаписка;
	ЭтаФорма.СлужебнаяЗапискаНомер = Элементы.СписокСлужебныхЗаписок.ТекущиеДанные.НомерДокумента;
	ОткрытьФормуСписокГрузовыхМест();

КонецПроцедуры
