&НаКлиенте
Перем РежимВводаАвтоматический;
&НаКлиенте
Перем Ошибка;                                               

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ГлавноеСообщениеМакет = ПолучитьОбщийМакет("СообщениеОНеПеремещенныхТоваров");
	Результат = ОбщегоНазначения.ПолучитьПервуюЗаписьИзРегистраСведений("СписокТоваровВБуфереПеремещения");		
	Объект.ЯчейкаКуда = Результат[0].ЯчейкаКуда;
	Объект.ЯчейкаОткуда = Результат[0].ЯчейкаОткуда;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
			
	ОбщегоНазначенияКлиент.ЗаполнитьТабЗначОК(ЭтаФорма);	
	ОбщегоНазначенияКлиент.ЗаполнитьТЗРазместитьТовары(ЭтаФорма);
	ОбновитьСлуженоеСообщениеПодвал();	
	
КонецПроцедуры
 
&НаКлиенте
Процедура ОбновитьСлуженоеСообщениеПодвал() Экспорт
	
	ЭтаФорма.Подвал.Очистить();	
	СтрокаТЗ = Подвал.Добавить();

	СтрокаТЗ.ФИОСотрудинка = ОбщегоНазначенияКлиент.ПолучитьОписаниеСотрудника();
	Элементы.Подвал.Обновить();
	
	ЭтаФорма.ПодвалСообщение.Очистить();	
	СтрокаТЗ = ПодвалСообщение.Добавить();	
	СтрокаТЗ.СообщениеДляПользователя = "Смахните влево для просмотра товаров";
	Элементы.ПодвалСообщение.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСвайпПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "ГруппаСтраница_Обзор" Тогда 
		Элементы.ПодвалСообщение.Видимость = Ложь;
	Иначе
		Элементы.ПодвалСообщение.Видимость = Истина;		
	КонецЕсли; 
	
КонецПроцедуры                                                       


&НаКлиенте
Процедура КнопкаРазместитьТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "КнопкаРазместить" Тогда		
		
		ТекстСообщения = СоздатьДокументПеремещенияПослеСканирЯчейкиКуда();
		
		СписокПараметров = Новый Структура;
		СписокПараметров.Вставить("ПризнакВозврата", Истина);
		СписокПараметров.Вставить("ТекстСообщения", ТекстСообщения);
		Закрыть( СписокПараметров );
		
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Функция СоздатьДокументПеремещенияПослеСканирЯчейкиКуда()
	
	РезультатСтруктура = ОбщегоНазначения.ПолучитьСписокЯчеекДляПеремещения();
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		Возврат "";                                                                                    
	КонецЕсли; 
	
	ТекстСообщения = "Создан документ перемещения по ячейкам № %1 %2. Документ проведен.";
	ТекстСообщенияРезультат = "";
	СообщениеОбОшибке = "";
	Для Индекс = 0 По РезультатСтруктура.Данные.Количество() - 1 Цикл
		
		ЯчейкаОткудаGUID = РезультатСтруктура.Данные[Индекс].СсылкаЯчейки;
		ЯчейкаКудаGUID = РезультатСтруктура.Данные[Индекс].СсылкаЯчейкиКуда;
		
		Результат = ОбщегоНазначения.СоздатьДокументПеремещенияМеждуЯчейкам(ЯчейкаОткудаGUID, ЯчейкаКудаGUID);
		Если ЗначениеЗаполнено(Результат.Ошибка) Тогда                                                      
			СообщениеОбОшибке = СообщениеОбОшибке + "Ошибка: " + Результат.Ошибка + Символы.ПС;						
			Продолжить;
		КонецЕсли; 
		
		ТекстСообщенияРезультат = ТекстСообщенияРезультат 
								  + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, 
									Строка(Результат.Данные.НомерДокумента),
									Строка(Результат.Данные.ДатаДокумента) 
									) + Символы.ПС;						
		
	КонецЦикла;  
	
	ТекстСообщенияРезультат =  СообщениеОбОшибке + ТекстСообщенияРезультат;
	//ПоказатьПредупреждение(, ТекстСообщенияРезультат, 5);	
	Возврат ТекстСообщенияРезультат;
	
КонецФункции



