
&НаКлиенте
Процедура РазместитьТовары(Команда)
	
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("ДокументГУИД", Параметры.ДокументГУИД);
	Закрыть( СписокПараметров );	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	РезультатСтруктура = ОбщегоНазначения.ПолучитьСписокТоваровИзБуфераРазмещения(Параметры.ДокументГУИД);
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		Закрыть();	
		Возврат;
	КонецЕсли; 
	
	Оповестить("ОбновлениеДанных");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Объект.ОписаниеДокумента = Параметры.НомерДокументаОоформление;
	
	Сообщение = "По данному документу система ";
	Сообщение = Сообщение + "обнаружила ранее размещенные Вами в ячейках ";
	Сообщение = Сообщение + "товары, которые не были отражены в документе ";
	Сообщение = Сообщение + """Размещение товаров по ячейкам"". ";
	Сообщение = Сообщение + "Проверьте нахождение этих товаров ";
	Сообщение = Сообщение + "в указанных ячейках на другой закладке ";
	Сообщение = Сообщение + "и нажмите на кнопку ""Разместить товары"" "; 
	
	ЭтаФорма.Объект.ТекстСообщения = Сообщение;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновлениеДанных" Тогда
		Элементы.СписокТоваровВБуфереРазмещения.Обновить();
	КонецЕсли; 
	
КонецПроцедуры
