&НаКлиенте
Перем Компонента;
&НаКлиенте
Перем Ошибка;


&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ПодключитьВнешенюКомпоненту();
			
	РезультатСтруктура = ОбщегоНазначения.ПолучитьСписокГрузовыхМестСлужебныхЗаписок(Параметры.СлужебнаяЗапискаГУИД);
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьСписокГрузовыхМестСлужебныхЗаписок");			
		Возврат;
		
	КонецЕсли; 
	
	Если РезультатСтруктура.Результат Тогда
		
		ЭтаФорма.КоличествоГрузовыхМестВсего = РезультатСтруктура.Данные.Количество();
		Оповестить("ОбновлениеДанных");

	КонецЕсли;   
	
	ОбновитьОписаниеПолейДляШапки();
	ОбновитьСлуженоеСообщениеПодвал();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьВнешенюКомпоненту()
	
	Компонента = ОбщегоНазначенияКлиент.ПодключитьКомпоненту();
	Если Компонента <> Неопределено И Не Компонента.Подключить() Тогда
		ТекстОшибки = "";
		КодОшибки = Компонента.ПолучитьОшибку(ТекстОшибки);
		ПоказатьПредупреждение(,"Ошибка: "+КодОшибки+", " + ТекстОшибки);
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "Компонента");					
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Компонента <> Неопределено Тогда
		Компонента.Отключить();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСлуженоеСообщениеПодвал(Режим = "") Экспорт
	
	ЭтаФорма.Подвал.Очистить();	
	СтрокаТЗ = Подвал.Добавить();

	СтрокаТЗ.ФИОСотрудинка = ОбщегоНазначенияКлиент.ПолучитьОписаниеСотрудника();
	Элементы.Подвал.Обновить();
	
	ЭтаФорма.ПодвалСообщение.Очистить();	
	СообщениеДляПользователя = "";   

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновлениеДанных" Тогда 
		Элементы.СписокГрузовыхМест.Обновить();  
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОписаниеПолейДляШапки()                                                     
			
	ШапкаСтатус = "В работе: " + Параметры.СлужебнаяЗапискаНомер;
	ШапкаГрузовыхМестВсего = "Грузовых мест всего: " + Строка(КоличествоГрузовыхМестВсего);
	ШапкаГрузовыхМестПогружено = "Погружено: " + Строка(КоличествоОтсканирГрузовыхМестНаТСД);
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ЭтаФорма.ШтрихКод = Элементы.СписокГрузовыхМест.ТекущиеДанные.ШтрихкодГрузовогоМеста;		
	ОбработкаОтсканированногоГрузовогоМеста(); 
	Оповестить("ОбновлениеДанных");

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтсканированногоГрузовогоМеста() 
	
	РезультатСтруктура = ОбщегоНазначения.ОбработатьОтсканированноеГрузовоеМестоСлужебнойЗаписки(Параметры.СлужебнаяЗапискаГУИД , ЭтаФорма.ШтрихКод);	
	
	КоличествоОтсканирГрузовыхМестНаТСД = КоличествоОтсканирГрузовыхМестНаТСД + 1;
	
	ОбновитьОписаниеПолейДляШапки();
	
	Если ОбщегоНазначения.ПроверитьОстатокНепогруженныхМестСлужебнаяЗаписка(Параметры.СлужебнаяЗапискаГУИД) Тогда
		
		РезультатСтруктура = ОбщегоНазначения.ОбработатьОтсканированнуюСлужебнуюЗаписку(Параметры.СлужебнаяЗапискаГУИД);	
		
		Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) И РезультатСтруктура.Свойство("КодРезультата",) = Ложь Тогда
			
			ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
			Возврат;
			
		КонецЕсли;
		
		Если РезультатСтруктура.Данные.КодРезультата = 300 Тогда
			
			ПоказатьПредупреждение(, "Товар по служебной записке принят."+Символы.ПС+" Положите на полку рекламационных возвратов ", 15);
			Закрыть();
			//ОткрытьФорму("Обработка.СлужебныеЗаписки.Форма.ФормаСлужебныеЗаписки");
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	                                                                                                   
	Если Событие = "UniversalBroadcastEvent" Тогда
		
		Результат = ОбщегоНазначения.ПолучитьЗначениеШтрихкода(Данные);
		
		Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
			
			ПоказатьПредупреждение(, "Ошибка сканирования штрихкода", 4);
			Возврат;			
			
		КонецЕсли; 
		
		ЭтаФорма.Штрихкод = Результат.Штрихкод;
		
		ЕстьМестоВПогруженных = ОбщегоНазначения.ПолучитьГрузовоеМестоСлужебныеЗапискиВПогруженных(ЭтаФорма.Штрихкод,Параметры.СлужебнаяЗапискаГУИД);
		
		Если ЗначениеЗаполнено(ЕстьМестоВПогруженных) Тогда
			
			ПоказатьПредупреждение(,"ГРУЗОВОЕ МЕСТО УЖЕ ПОГРУЖЕНО !", 3);	
			Возврат;
			
		КонецЕсли;
		
		ЕстьСлужебнаяЗаписка = ОбщегоНазначения.ПолучитьГрузовоеМестоСлужебныеЗаписки(ЭтаФорма.Штрихкод);
		
		Если НЕ ЗначениеЗаполнено(ЕстьСлужебнаяЗаписка) ИЛИ НЕ ЕстьСлужебнаяЗаписка = Параметры.СлужебнаяЗапискаГУИД Тогда
			
			ПоказатьПредупреждение(,"Грузовое место не обнаружено в выбранной служебной записке !", 3);	
			Возврат;
			
		КонецЕсли;
	
		// Пользователь может нажать несколько раз сканирование штрихкода, но форма уже закрыта.
		Если ВводДоступен() Тогда
			ОбработкаОтсканированногоГрузовогоМеста();	
		КонецЕсли; 
		
	КонецЕсли;

КонецПроцедуры

