&НаКлиенте
Перем Ошибка;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗагрузитьСписокОбъединений();
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗагрузитьСписокОбъединений()
	
	РезультатСтруктура = ОбщегоНазначения.ЗагрузитьСписокОбъединений();	
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		ПоказатьПредупреждение(, "Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		Возврат;
		
	КонецЕсли; 
	
	Если РезультатСтруктура.Результат Тогда
		Оповестить("ОбновлениеДанных");
	КонецЕсли;     

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	ЗагрузитьСписокОбъединений();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновлениеДанных" Тогда 
		Элементы.СписокОбъединений.Обновить(); 
	ИначеЕсли ИмяСобытия = "ОбновитьСписокОбъединений" Тогда
		ОбновитьСписок(Неопределено);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОбъединение(Команда)
		

КонецПроцедуры  

&НаКлиенте
Процедура Завершенные(Команда)
	
	Форма = ПолучитьФорму("Обработка.Объединения.Форма.ФормаОбъединенийЗавершенных", , ЭтаФорма);	
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбъединенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СписокОбъединений.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат	
	КонецЕсли; 
	
	СтруктураШапки = Новый Структура();
	СтруктураШапки.Вставить("НомерДокументаОформление", ТекущиеДанные.НомерДокументаОформление);
	СтруктураШапки.Вставить("Статус", ТекущиеДанные.Статус);
	СтруктураШапки.Вставить("Контрагент", ТекущиеДанные.Контрагент); 
	СтруктураШапки.Вставить("КоличествоГрузомест", ТекущиеДанные.КоличествоГрузомест);
	СтруктураШапки.Вставить("НеОбъединено", ТекущиеДанные.НеОбъединено);
	
	Форма = ПолучитьФорму("Обработка.Объединения.Форма.ФормаОбъединения", Новый Структура("ГУИДОбъединения, СтруктураШапки", ТекущиеДанные.СсылкаОбъединение, СтруктураШапки), ЭтаФорма);	
	Форма.Открыть();	
	
КонецПроцедуры
