
&НаКлиенте
Перем Компонента;
&НаКлиенте
Перем Ошибка;

&НаКлиенте
Процедура ЗагрузитьСписокЗаданийНаДоставку() 
	
	РезультатСтруктура = ОбщегоНазначения.ЗагрузитьСписокЗаданийНаДоставку();	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "ЗагрузитьСписокЗаданийНаДоставку");					
		Возврат;
	КонецЕсли; 
	
	Элементы.СписокЗаданийНаДоставку.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначения.УстановитьРежимРаботыСЗаданиемНаДоставку("ПоискЗаданияНаДоставку");
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Компонента = ОбщегоНазначенияКлиент.ПодключитьКомпоненту();	
	
	Если Компонента <> Неопределено И Не Компонента.Подключить() Тогда		
		ТекстОшибки = "";
		КодОшибки = Компонента.ПолучитьОшибку(ТекстОшибки);                                                   
		ПоказатьПредупреждение(,"Ошибка: "+КодОшибки+", " + ТекстОшибки);
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "Компонента");					
	КонецЕсли;
	
	ЗагрузитьСписокЗаданийНаДоставку();
	ОбщегоНазначенияКлиент.ЗаполнитьТабЗначОК(ЭтаФорма);	
	ОбновитьСлуженоеСообщениеПодвал();	
	
КонецПроцедуры
 
&НаКлиенте
Процедура ОбновитьСлуженоеСообщениеПодвал() Экспорт
	
	ЭтаФорма.Подвал.Очистить();	
	СтрокаТЗ = Подвал.Добавить();

	СтрокаТЗ.ФИОСотрудинка = ОбщегоНазначенияКлиент.ПолучитьОписаниеСотрудника();
	Элементы.Подвал.Обновить();
	
	ЭтаФорма.ПодвалСообщение.Очистить();	
	СтрокаТЗ = ПодвалСообщение.Добавить();	
	СтрокаТЗ.СообщениеДляПользователя = ОбщегоНазначения.ПолучитьИнструкциюДляДействийПользователя_ЗаданиеНаДОставку(ЭтаФорма.ИмяФормы);
	Элементы.ПодвалСообщение.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСвайпПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "ГруппаСтраница_2" Тогда 
		
	Иначе
		
		
	КонецЕсли; 
	
КонецПроцедуры                                                       

&НаКлиенте
Процедура ПолучитьСписокЗаданийНаДоставку(Команда)
	
	ЗагрузитьСписокЗаданийНаДоставку();
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если Не ВводДоступен() Тогда
		Возврат;
	КонецЕсли; 
	
	Если Событие = "UniversalBroadcastEvent" Тогда
		
		Результат = ОбщегоНазначения.ПолучитьЗначениеШтрихкода(Данные);
		Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
			ПоказатьПредупреждение(, "Ошибка сканирования штрихкода", 4);
			Возврат;
		КонецЕсли; 
		
		ЭтаФорма.Штрихкод = Результат.Штрихкод;				
		ЭтаФорма.ЗаданиеНаДоставкуГУИД = ОбщегоНазначения.ПолучитьЗаданиеНаДоставку(ЭтаФорма.Штрихкод);
		
		Если Не ЗначениеЗаполнено(ЭтаФорма.ЗаданиеНаДоставкуГУИД) Тогда
			
			ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();
			СтрокаСообщения = "Задание на доставку с данным штрихкодом не обнаружено.";
			
			//СтрокаСообщения = "Отсканированый штрикод " + ЭтаФорма.Штрихкод + Символы.ПС;
			//СтрокаСообщения = СтрокаСообщения + "Задание на доставку не найдено";
			ПоказатьПредупреждение(, СтрокаСообщения, 4);
			Возврат;
			                              
		КонецЕсли; 
		
		ОбщегоНазначения.УстановитьРежимРаботыСЗаданиемНаДоставку("ГотовКСканированиюГрузовогоМеста");
		//ОбщегоНазначения.УстановитьРежимРаботыСЗаданиемНаДоставку("ПоискГрузовогоМеста");
		ОткрытьФормуСписокГрузовыхМест();
		
	ИначеЕсли Событие = "ClipboardEvent" Тогда
		ЭтаФорма.Штрихкод = Данные;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ОткрытьФормуСписокГрузовыхМест()
	
	Закрыть();	
	П = Новый Структура;
	П.Вставить("ЗаданиеНаДоставкуГУИД", ЭтаФорма.ЗаданиеНаДоставкуГУИД); 
	ОткрытьФорму("Обработка.ПогрузкаВАвто.Форма.ФормаГрузовогоМеста", П);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗаданиеНаДоставку(Команда)
	
	ЭтаФорма.ЗаданиеНаДоставкуГУИД = Элементы.СписокЗаданийНаДоставку.ТекущиеДанные.Объект;
	ОткрытьФормуСписокГрузовыхМест();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокЗаданийНаДоставкуПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Ключи = Строки.ПолучитьКлючи();
	Для Индекс = 0  По Ключи.Количество()-1 Цикл

		СтрокаСписка = Строки[Ключи[Индекс]];
				
		Если СтрокаСписка.Данные["Статус"] = "Не начата" Тогда	
			
			СтрокаСписка.Оформление["Статус"].УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноЗеленый);
			
		ИначеЕсли СтрокаСписка.Данные["Статус"] = "В работе" Тогда						
			
			СтрокаСписка.Оформление["Статус"].УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноОранжевый);				
			
		ИначеЕсли СтрокаСписка.Данные["Статус"] = "Погрузка прервана" Тогда									
			
			СтрокаСписка.Оформление["Статус"].УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);							
			
		КонецЕсли; 
			
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Компонента <> Неопределено Тогда
		Компонента.Отключить();
	КонецЕсли;

КонецПроцедуры


