
&НаКлиенте
Процедура ПолучитьЗаданияНаИнвентаризацию(Команда)
	ЗагрузитьЗаданияНаИнвентаризацию();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗагрузитьЗаданияНаИнвентаризацию();	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗаданияНаИнвентаризацию()
	
	РезультатСтруктура = ОбщегоНазначения.ЗагрузитьЗаданияНаИнвентаризцию();
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		Возврат;
	КонецЕсли; 
	
	Элементы.СписокЗаданий.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗаданиеНаИнвентаризацию(Команда)
	
	ЭтаФорма.ЗаданиеНаИнвентаризациюГУИД = Элементы.СписокЗаданий.ТекущиеДанные.Ссылка;
	
	Ячейки = ОбщегоНазначения.ПолучитьЯчейкиИзЗаданияНаИнвентаризацию(ЭтаФорма.ЗаданиеНаИнвентаризациюГУИД);
	РезультатСтруктура = ОбщегоНазначения.ПроверитьЯчейкиДляБлокировкиПриИнвентаризации(ЗаданиеНаИнвентаризациюГУИД, Ячейки);
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		Возврат;
	КонецЕсли; 
	
	Если Не ОбщегоНазначения.ПолучитьРезультатПроверкиЯчеекДляИнвентаризации() Тогда
		
		ОтображатьРезультатПроверкиЯчеек = Истина;
		ПросмотретьЯчейкиИзЗаданияИнвентаризации(ОтображатьРезультатПроверкиЯчеек);
		
		Возврат;
	КонецЕсли; 
		
	Закрыть();	                                                                            
	ОткрытьФормуВыбораЯчейкиИзСпискаЯчеек();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораЯчейкиИзСпискаЯчеек()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗаданиеНаИнвентаризациюГУИД", ЭтаФорма.ЗаданиеНаИнвентаризациюГУИД);
	ОткрытьФорму("Обработка.ИнвентаризацияПоЯчейкам.Форма.ФормаВыбораЯчейкиИзСпискаЯчеек", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьЯчейки(Команда)
	
	ЭтаФорма.ЗаданиеНаИнвентаризациюГУИД = Элементы.СписокЗаданий.ТекущиеДанные.Ссылка;
	ПросмотретьЯчейкиИзЗаданияИнвентаризации();

КонецПроцедуры
 
 
&НаКлиенте
Процедура ПросмотретьЯчейкиИзЗаданияИнвентаризации(ОтображатьРезультатПроверкиЯчеек = Ложь)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗаданиеНаИнвентаризациюГУИД", ЭтаФорма.ЗаданиеНаИнвентаризациюГУИД);
	ПараметрыФормы.Вставить("ОтображатьРезультатПроверкиЯчеек", ОтображатьРезультатПроверкиЯчеек);
	
	ОткрытьФорму("Обработка.ИнвентаризацияПоЯчейкам.Форма.ФормаСпискаЯчеекВыбранногоЗадания",
				 ПараметрыФормы, ЭтаФорма,,, , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
		ОбщегоНазначения.ОчиститьРегистрСведений("СписокЗаданийНаИнвентаризацию");
		ОбщегоНазначения.ОчиститьРегистрСведений("ПроверкаЯчеекДляИнвентаризации");
		
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаданийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбратьЗаданиеНаИнвентаризацию(Неопределено);
КонецПроцедуры
                                                                                        



