&НаКлиенте
Перем Компонента;
&НаКлиенте
Перем РежимВводаАвтоматический;
&НаКлиенте
Перем Ошибка;
&НаКлиенте
Перем ЗаписьРазгрузкаАвтоСтруктура;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.СписокВсехГрузовыхМест.Доступность = Ложь;
	
	УстановитьВидимостьКоманднойПанели();
	ПодключитьВнешенюКомпоненту();
	ЗаписьРазгрузкаАвтоСтруктура = ОбщегоНазначения.ПолучитьЗаписьИзРегистраСведений("СписокЗаданийНаДоставку", "РазгрузкаАвтоГУИД", Параметры.РазгрузкаАвтоГУИД);	
		
	РезультатСтруктура = ОбщегоНазначения.ПолучитьСписокГрузовыхМестИзРазгрузкаАвто(Параметры.РазгрузкаАвтоГУИД);
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьСписокГрузовыхМестИзРазгрузкаАвто");			
		Возврат;
	КонецЕсли; 
	
	ОбновитьОписаниеПолейДляШапки();
	ОбщегоНазначенияКлиент.ЗаполнитьТабЗначОК(ЭтаФорма);	
	ОбновитьСлуженоеСообщениеПодвал();	
	
	Результат = ОбщегоНазначения.ЕстьНеРазгруженныеГрузовыеМеста(Параметры.РазгрузкаАвтоГУИД);	
	Если Не Результат Тогда
		ПоказатьПредупреждение(, "Разгрузка по грузополучателю " + ЗаписьРазгрузкаАвтоСтруктура[0].ГрузополучательНаименование + " завершена !!!", 4);		
		Отказ = Истина;		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКоманднойПанели()
	
	Если Элементы.ГруппаСвайп.ТекущаяСтраница = Элементы.ГруппаСтраница_1 Тогда
		Элементы.ФормаГруппаКнопок.Видимость = Ложь;	
	Иначе
		Элементы.ФормаГруппаКнопок.Видимость = Истина;			
	КонецЕсли; 
	
КонецПроцедуры
 

&НаКлиенте
Процедура УстановитьРежимПросмотраВсехГрузовыхМест(Режим)
	
	Элементы.ГруппаСвайп.ТекущаяСтраница = Элементы.ГруппаСтраница_2;
	Элементы.ГруппаСвайп.ТекущаяСтраница.Видимость = Истина;
	Элементы.ГруппаШапка.Видимость = Ложь;	
	
	ПодчинМеню = Элементы.СписокВсехГрузовыхМест.КонтекстноеМеню.ПодчиненныеЭлементы;			
	Если Режим = "ПоказатьВсе" Тогда
		                                                              
		СписокВсехГрузовыхМест.Параметры.УстановитьЗначениеПараметра("ОтобразитьВсеЗаписи", Истина);
		СписокВсехГрузовыхМест.Параметры.УстановитьЗначениеПараметра("Разгружено", Ложь);
			
		Элементы.ГруппаШапкаМестРазгружено.Видимость = Истина;
		Элементы.ГруппаШапкаМестВАвто.Видимость = Истина;
		Элементы.ШапкаГрузовыхМестВсего2.Видимость = Ложь;		
		
		ПодчинМеню.КонтекстноеМенюВыбрать.Видимость = Ложь;
		
	ИначеЕсли Режим = "ПоказатьМестаНаСкладе" Тогда 
		
		СписокВсехГрузовыхМест.Параметры.УстановитьЗначениеПараметра("ОтобразитьВсеЗаписи", Ложь);
		СписокВсехГрузовыхМест.Параметры.УстановитьЗначениеПараметра("Разгружено", Истина);		
		
		Элементы.ГруппаШапкаМестРазгружено.Видимость = Истина;
		Элементы.ГруппаШапкаМестВАвто.Видимость = Ложь;
		Элементы.ШапкаГрузовыхМестВсего2.Видимость = Ложь;		
		
		ПодчинМеню.КонтекстноеМенюВыбрать.Видимость = Ложь;
		
	ИначеЕсли Режим = "ПоказатьМестаВАвто" Тогда 
				
		СписокВсехГрузовыхМест.Параметры.УстановитьЗначениеПараметра("ОтобразитьВсеЗаписи", Ложь);
		СписокВсехГрузовыхМест.Параметры.УстановитьЗначениеПараметра("Разгружено", Ложь);		
		
		Элементы.ГруппаШапкаМестРазгружено.Видимость = Ложь;
		Элементы.ГруппаШапкаМестВАвто.Видимость = Истина;
		Элементы.ШапкаГрузовыхМестВсего2.Видимость = Истина;		
		
		ПодчинМеню.КонтекстноеМенюВыбрать.Видимость = Истина;
		
	КонецЕсли; 
	
	ОбновитьСлуженоеСообщениеПодвал(Режим);	
	Элементы.СписокВсехГрузовыхМест.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура ПодключитьВнешенюКомпоненту()
	
	Компонента = ОбщегоНазначенияКлиент.ПодключитьКомпоненту();
	Если Компонента <> Неопределено И Не Компонента.Подключить() Тогда
		ТекстОшибки = "";
		КодОшибки = Компонента.ПолучитьОшибку(ТекстОшибки);
		ПоказатьПредупреждение(,"Ошибка: "+КодОшибки+", " + ТекстОшибки);
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "Компонента");					
	КонецЕсли;
	
КонецПроцедуры
 

&НаКлиенте
Процедура ОбновитьСлуженоеСообщениеПодвал(Режим = "") Экспорт
	
	ЭтаФорма.Подвал.Очистить();	
	СтрокаТЗ = Подвал.Добавить();

	СтрокаТЗ.ФИОСотрудинка = ОбщегоНазначенияКлиент.ПолучитьОписаниеСотрудника();
	Элементы.Подвал.Обновить();
	
	ЭтаФорма.ПодвалСообщение.Очистить();	
	СообщениеДляПользователя = ОбщегоНазначения.ПолучитьИнструкциюДляДействийПользователя_РазгрузкаАвто(ЭтаФорма.ИмяФормы, Режим);
	
	Если Элементы.ГруппаСвайп.ТекущаяСтраница = Элементы.ГруппаСтраница_1 Тогда
		
		СтрокаТЗ = ПодвалСообщение.Добавить();				
		СтрокаТЗ.СообщениеДляПользователя = СообщениеДляПользователя;
		
	ИначеЕсли Элементы.ГруппаСвайп.ТекущаяСтраница = Элементы.ГруппаСтраница_2 Тогда
		
		Если ЗначениеЗаполнено(СообщениеДляПользователя) Тогда
			СтрокаТЗ = ПодвалСообщение.Добавить();		
			СтрокаТЗ.СообщениеДляПользователя = СообщениеДляПользователя;
		КонецЕсли;
	КонецЕсли; 	
	
	Элементы.ПодвалСообщение.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура ГруппаСвайпПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Элементы.СписокВсехГрузовыхМест.Доступность = Истина;
	Если ТекущаяСтраница.Имя = "ГруппаСтраница_2" Тогда 
			
		РезультатСтруктура = ОбщегоНазначения.ПолучитьСписокГрузовыхМестИзРазгрузкаАвто(Параметры.РазгрузкаАвтоГУИД);	
																								  
		Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
			ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
			ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьСписокГрузовыхМестИзРазгрузкаАвто");			
			Возврат;
		КонецЕсли; 
		
		Элементы.ГруппаШапка.Видимость = Ложь;
		УстановитьВидимостьКоманднойПанели();
		УстановитьРежимПросмотраВсехГрузовыхМест("ПоказатьМестаВАвто");
		
	Иначе
		
		УстановитьВидимостьКоманднойПанели();		
		Элементы.ГруппаШапка.Видимость = Истина;
		ОбновитьСлуженоеСообщениеПодвал();
		
	КонецЕсли; 
	
КонецПроцедуры                                                       

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокВсехГрузовыхМест.Параметры.УстановитьЗначениеПараметра("ОтобразитьВсеЗаписи", Истина);
	СписокВсехГрузовыхМест.Параметры.УстановитьЗначениеПараметра("Разгружено", Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	                                                                                                   
	Если Событие = "UniversalBroadcastEvent" Тогда
		
		Результат = ОбщегоНазначения.ПолучитьЗначениеШтрихкода(Данные);
		Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
			ПоказатьПредупреждение(, "Ошибка сканирования штрихкода", 4);
			Возврат;			
		КонецЕсли; 
		
		ЭтаФорма.Штрихкод = Результат.Штрихкод;
		ЭтаФорма.ГрузовоеМестоГУИД = ОбщегоНазначения.ПолучитьГрузовоеМестоИзРазгрузкаАвто(ЭтаФорма.Штрихкод);
		Если Не ЗначениеЗаполнено( ЭтаФорма.ГрузовоеМестоГУИД ) Тогда
			
			ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();			 
			ТекстСообщения = "Грузовое место не обнаружено в выбранном задании на доставку.";
			ОписаниеОшибки = ТекстСообщения;
			
			ОбщегоНазначенияКлиент.ИнициализацияТЗ_Набрано(ЭтаФорма);
	    	НоваяСтрока = ЭтаФорма.Набрано[0];
			НоваяСтрока.СообщениеОбОшибке = ТекстСообщения;
			ПоказатьСтраницу_РаботыСГрузовымМестом();
			Возврат;
			                                                                 
		КонецЕсли; 
		
		// Пользователь может нажать несколько раз сканирование штрихкода, но форма уже закрыта.
		Если ВводДоступен() Тогда
			ОбработкаОтсканированногоГрузовогоМеста();	
		КонецЕсли; 
				
	ИначеЕсли Событие = "ClipboardEvent" Тогда                 
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтсканированногоГрузовогоМеста()
	
	//ОбщегоНазначения.УстановитьРежимРаботыСЗаданиемНаДоставку("ПоискГрузовогоМеста");
	РезультатСтруктура = ОбщегоНазначения.ОбработатьОтсканированноеГрузовоеМестоИзРазгрузкаАвто(Параметры.ЗаданиеНаДоставкуГУИД, Параметры.РазгрузкаАвтоГУИД, ЭтаФорма.ГрузовоеМестоГУИД);		
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "ОбработатьОтсканированноеГрузовоеМестоИзРазгрузкаАвто");			
		Возврат;
	КонецЕсли;                                                      
	
	Запись = ОбщегоНазначения.ПолучитьЗаписьИзРегистраСведений("СписокГрузовыхМестИзРазгрузкиАвто", "ШтрихкодГрузовогоМеста", ЭтаФорма.Штрихкод);	
		
	КоличествоОтсканирГрузовыхМестНаТСД = КоличествоОтсканирГрузовыхМестНаТСД + 1;
	
	РезультатСтруктура = ОбщегоНазначения.ПолучитьСписокГрузовыхМестИзРазгрузкаАвто(Параметры.РазгрузкаАвтоГУИД);
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьСписокГрузовыхМестИзРазрузкаАвто");			
		Возврат;
	КонецЕсли;                                                     
	
	Результат = ОбщегоНазначения.ЕстьНеРазгруженныеГрузовыеМеста(Параметры.РазгрузкаАвтоГУИД);
	Если Не Результат Тогда
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();
		ПоказатьПредупреждение(, "Для данного клиента все места выгружены на склад. !!!", 4);
		Закрыть();
		Возврат;

	КонецЕсли; 
	
	ОбновитьОписаниеПолейДляШапки();
	ОбщегоНазначенияКлиент.ОтобразитьИнформациюОГрузовомМесте_Структура(Запись[0], ЭтаФорма);
	ПоказатьСтраницу_РаботыСГрузовымМестом();
	
КонецПроцедуры
 

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Компонента <> Неопределено Тогда
		Компонента.Отключить();
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ОбновитьОписаниеПолейДляШапки()
			
	ШапкаСтатус = "В работе: " + ЗаписьРазгрузкаАвтоСтруктура[0].Номер + " (РА " + ЗаписьРазгрузкаАвтоСтруктура[0].РазгрузкаАвтоНомер + ")";
	ШапкаГрузовыхМестВсего = "Грузовых мест всего: " + Строка(ЗаписьРазгрузкаАвтоСтруктура[0].КоличествоВсего);
	ШапкаГрузовыхМестРазгружено = "Разгружено: " + Строка(ЗаписьРазгрузкаАвтоСтруктура[0].КоличествоРазгружено + КоличествоОтсканирГрузовыхМестНаТСД);
	ШапкаФИОВодителя = ЗаписьРазгрузкаАвтоСтруктура[0].ВодительНаименование;
	ШапкаГрузовыхМестВАвто = "В авто: " + Строка(ЗаписьРазгрузкаАвтоСтруктура[0].КоличествоВсего - ЗаписьРазгрузкаАвтоСтруктура[0].КоличествоРазгружено - КоличествоОтсканирГрузовыхМестНаТСД);
	
КонецПроцедуры
 
&НаКлиенте
Процедура ОбработкаСобытия(ИмяСобытия) Экспорт
	
	Если ИмяСобытия = "СканированиеШтрихкода" Тогда
		
		#Если МобильноеПриложениеКлиент Тогда
		Если ЗначениеЗаполнено(ЭтаФорма.ОписаниеОшибки) Тогда
			Компонента.Отключить();
		Иначе
			Компонента.Подключить();
		КонецЕсли; 
		#КонецЕсли 	
	
		Возврат;		
		
	КонецЕсли; 
	
КонецПроцедуры
                                                                                              

&НаКлиенте
Процедура ПоказатьСтраницу_РаботыСГрузовымМестом() Экспорт
	
	//СтатусРаботы = ОбщегоНазначения.ПолучитьСтатусРаботыСЗаданиемНаДоставку();
	ОбновитьСлуженоеСообщениеПодвал();
	
	Элементы.ГруппаШапка.Видимость = Истина;
	Элементы.Набрано.Обновить();
	Если ЗначениеЗаполнено(ЭтаФорма.ОписаниеОшибки) Тогда
		
		Элементы.ГруппаСвайп.ТекущаяСтраница = Элементы.ГруппаСтраница_1;
		Элементы.ГруппаСвайп.ТекущаяСтраница.Видимость = Истина;
		
		Элементы.Страницы_РаботыСГрузовымМестом.ТекущаяСтраница = Элементы.Страница_ОшибкиСканирования;
		Элементы.Страница_ОшибкиСканирования.Видимость = Истина;
		Элементы.СтраницаОбработкиГрузовогоМеста.Видимость = Ложь;			
		ЭтаФорма.ОписаниеОшибки = "";
		Возврат;
		
	КонецЕсли; 
	
	Элементы.ГруппаСвайп.ТекущаяСтраница = Элементы.ГруппаСтраница_1;
	Элементы.ГруппаСвайп.ТекущаяСтраница.Видимость = Истина;
	
	Элементы.Страницы_РаботыСГрузовымМестом.ТекущаяСтраница = Элементы.СтраницаОбработкиГрузовогоМеста;
	Элементы.СтраницаОбработкиГрузовогоМеста.Видимость = Истина;
	Элементы.Страница_ОшибкиСканирования.Видимость = Ложь;
	
		
КонецПроцедуры


&НаКлиенте
Процедура МестаВАвто(Команда)
		
	УстановитьРежимПросмотраВсехГрузовыхМест("ПоказатьМестаВАвто");
	
КонецПроцедуры


&НаКлиенте
Процедура МестаНаСкладе(Команда)
	
	УстановитьРежимПросмотраВсехГрузовыхМест("ПоказатьМестаНаСкладе");

КонецПроцедуры


&НаКлиенте
Процедура ПоказатьВсе(Команда)
	
	УстановитьРежимПросмотраВсехГрузовыхМест("ПоказатьВсе");
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура СписокВсехГрузовыхМестПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Ключи = Строки.ПолучитьКлючи();
	Для Индекс = 0  По Ключи.Количество()-1 Цикл

		СтрокаСписка = Строки[Ключи[Индекс]];
				
		Если СтрокаСписка.Данные["СтатусГрузовогоМеста"] = "Разгружено" Тогда	
			
			СтрокаСписка.Оформление["СтатусГрузовогоМеста"].УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноЗеленый);
			
		ИначеЕсли СтрокаСписка.Данные["СтатусГрузовогоМеста"] = "В машине" Тогда						
			
			СтрокаСписка.Оформление["СтатусГрузовогоМеста"].УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноКрасный);				
			
		КонецЕсли; 
			
	КонецЦикла; 
	
КонецПроцедуры


&НаКлиенте
Процедура Выбрать(Команда)
	
	ЭтаФорма.Штрихкод = Элементы.СписокВсехГрузовыхМест.ТекущиеДанные.ШтрихкодГрузовогоМеста;
	ЭтаФорма.ГрузовоеМестоГУИД = Элементы.СписокВсехГрузовыхМест.ТекущиеДанные.ГрузовоеМестоГУИД;
	ОбработкаОтсканированногоГрузовогоМеста();	
	
	//ОбщегоНазначения.УстановитьРежимРаботыСЗаданиемНаДоставку("ПоискГрузовогоМеста");	
	ПоказатьСтраницу_РаботыСГрузовымМестом();	
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	РезультатСтруктура = ОбщегоНазначения.ЗагрузитьСписокЗаданийНаДоставкуДляРазгрузкиАвто();	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "ЗагрузитьСписокЗаданийНаДоставкуДляРазгрузкиАвто");					
		Возврат;
	КонецЕсли; 

КонецПроцедуры

