
&НаКлиенте
Процедура ТоварыДокумента(Команда)
	
	РезультатСтруктура = ОбщегоНазначения.ПолучитьОстатокПоВсемТоварамИзДокумента(Объект.ДокументГУИД);
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		Возврат;
	КонецЕсли; 
	
	
	Оповещение = Новый ОписаниеОповещения("ПолучениеДанныхПриЗакрытииФормыТоварыДокумента", ЭтаФорма);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДокументГУИД", Объект.ДокументГУИД);
	
	ИмяФормыОткрываемой = "Обработка.ПриемкаКоллективная.Форма.ФормаТоварыДокумента";
	ОткрытьФорму(ИмяФормыОткрываемой, ПараметрыФормы, ЭтаФорма,,, , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры


&НаКлиенте
Процедура ПолучениеДанныхПриЗакрытииФормыТоварыДокумента(Результат, ДополнительныеПараметры) Экспорт
	
	ПараметрЗакрытия = Новый Структура;
	ПараметрЗакрытия.Вставить("Ошибка", Ложь);
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ЭтаФорма.ТоварГУИД = Результат.ТоварГУИД;	
	РезультатСтруктура = ОбщегоНазначения.ПрисвоитьШтрихкодТовару(Параметры.Штрихкод, ЭтаФорма.ТоварГУИД);
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 5);	
		ПараметрЗакрытия.Вставить("Ошибка", Истина);
		Закрыть(ПараметрЗакрытия);
		
	Иначе 
		
		ПараметрЗакрытия.Вставить("ТоварГУИД", ЭтаФорма.ТоварГУИД);
		ПараметрЗакрытия.Вставить("Штрихкод", Параметры.Штрихкод);
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗакрытьФорму", ЭтаФорма, ПараметрЗакрытия);
		ПоказатьПредупреждение(ОписаниеОповещения,"Штрихкод " + Строка(Параметры.Штрихкод) + " добавлен.", 5);	
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Результат) Экспорт
	Закрыть( Результат );		
КонецПроцедуры
 

&НаКлиенте
Процедура Ок(Команда)
	ПолучитьСписокТоваров();	
КонецПроцедуры                                                                     

&НаКлиенте
Процедура ЗначениеДляПоискаПриИзменении(Элемент)
	ПолучитьСписокТоваров();	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПараметрыРаботы = ОбщегоНазначения.ПолучитьПараметрыРаботыСДокументомПТУ();	
	ЗаполнитьЗначенияСвойств(Объект, ПараметрыРаботы);

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокТоваров()
	
	Если НЕ ЗначениеЗаполнено(ЗначениеДляПоиска) Тогда
		ПоказатьПредупреждение(, "Введите код производителя.", 4);
		Возврат;
	КонецЕсли; 
	
	РезультатСтруктура = ОбщегоНазначения.ПолучитьНайденныеТоварыПоВведенномуЗначению(ЗначениеДляПоиска, "ПоступлениеТоваровУслуг", Объект.ДокументГУИД);
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		Возврат;
	КонецЕсли; 
	
	ПреобразоватьДанныеВТаблицуЗначений(РезультатСтруктура.Данные);
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПреобразоватьДанныеВТаблицуЗначений(Данные)
	
	ЭтаФорма.НайденныеТовары.Очистить();
	
	Для Индекс = 0 По Данные.Количество()-1 Цикл
		
		ДанныеСтруктура = Данные[Индекс];
		ЗаписьНайденныеТовары = ЭтаФорма.НайденныеТовары.Добавить();
		
		ЗаполнитьЗначенияСвойств(ЗаписьНайденныеТовары, ДанныеСтруктура);
		
		ТекстШаблона = """%1"" %2 (%3)";		
		ТекстШаблона  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстШаблона, 
				Строка(ЗаписьНайденныеТовары.КодПроизводителя),
				ЗаписьНайденныеТовары.Наименование,
				ЗаписьНайденныеТовары.ЕдИзмНаименование
				);						
	
		ЗаписьНайденныеТовары.ОписаниеТовара = ТекстШаблона;
		
	КонецЦикла;  
	
	
КонецПроцедуры


&НаКлиенте
Процедура НайденныеТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// Владелец - это ГУИД на номенклатуру, к который будет привязан штрихкод
	ЭтаФорма.ТоварГУИД = Элементы.НайденныеТовары.ДанныеСтроки(ВыбраннаяСтрока).Владелец;
	РезультатСтруктура = ОбщегоНазначения.ПрисвоитьШтрихкодТовару(Параметры.Штрихкод, ЭтаФорма.ТоварГУИД);
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 5);	
		Закрыть();
	Иначе 
		ПоказатьПредупреждение(,"Штрихкод " + Строка(Параметры.Штрихкод) + " добавлен.", 5);	
	КонецЕсли; 
	
	ПараметрЗакрытия = Новый Структура;
	ПараметрЗакрытия.Вставить("ТоварГУИД", ЭтаФорма.ТоварГУИД);
	ПараметрЗакрытия.Вставить("Штрихкод", Параметры.Штрихкод);                         
	
	Закрыть( ПараметрЗакрытия );	
	
КонецПроцедуры
 

 
