 
&НаКлиенте
Процедура ДиалогНеизвестныйШтрихкод(Параметры) Экспорт
	                                                                                     
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПрисвоитьШтрихкод", ЭтотОбъект, Параметры);
	ТекстВопроса = "Неизвестный ШК." + Символы.ПС;
	ТекстВопроса = ТекстВопроса + "По штрихкоду """ + Параметры.Штрихкод + """ не найден товар" + Символы.ПС;
	ТекстВопроса = ТекстВопроса + "Присвоить штрихкод.";
	ПоказатьВопрос(Оповещение, ТекстВопроса, Режим); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПрисвоитьШтрихкод(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда		
		
		Параметры.ЭтаФорма.Поиск = "";
		Оповестить("ГруппаПоискаТовара", Истина);
		 
		Параметры.ЭтаФорма.ОписаниеОшибки = "";
		Параметры.ЭтаФорма.ОписаниеНайденногоТовара =  "";
		Параметры.ЭтаФорма.Штрихкод = "";
		Параметры.ЭтаФорма.Поиск = "";
	
		ОбщегоНазначенияКлиент.ОчиститьПоляНайденныйТовар(Параметры.ЭтаФорма);			
		ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборНоменклатуры");
		Параметры.ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		
		 
		Возврат;				
	КонецЕсли;                                                            
	
	ПараметрыОткрытияФормы = Новый Структура("Штрихкод", Параметры.Штрихкод );	  
	Если Параметры.ЭтаФорма.ИмяФормы = "Обработка.ПриемкаКоллективная.Форма.ФормаРазмещениеТовара" Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПрисвоенияШтрихкодаТовару", ЭтотОбъект, Параметры);			
		ОткрытьФорму("Обработка.ПриемкаКоллективная.Форма.ФормаПрисвоитьШтрихкод", ПараметрыОткрытияФормы, , , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);		
		
	ИначеЕсли Параметры.ЭтаФорма.ИмяФормы = "Обработка.ПеремещениеТовараИзЯчейки.Форма.ФормаВыбораНоменклатуры" Тогда 
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПрисвоенияШтрихкодаТовару", ЭтотОбъект, Параметры);			
		ОткрытьФорму("Обработка.ПеремещениеТовараИзЯчейки.Форма.ФормаПрисвоитьШтрихкод", ПараметрыОткрытияФормы, , , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);		
				
	КонецЕсли; 
	
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеПрисвоенияШтрихкодаТовару(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Ошибка = Неопределено;
	Результат.Свойство("Ошибка", Ошибка);
	Если Ошибка = Истина  Тогда
		Возврат;
	КонецЕсли; 
	
	
	Параметры.ЭтаФорма.ТоварГУИД = Результат.ТоварГУИД;
	Параметры.ЭтаФорма.Штрихкод = Результат.Штрихкод;
	
	Оповестить("ОбработатьДобавленныйШтрихкод");
	
КонецПроцедуры                                                            
 

