///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
&НаКлиенте
Функция  ОбработкаШтрихкодаВРучномРежиме(ЭтаФорма, ТипДокумента, ГМ = Ложь) Экспорт
	
	Ошибка = "";
	Объект        = ЭтаФорма.Объект;
	Штрихкод      = ЭтаФорма.Штрихкод; 
	ТоварГУИД     =  ЭтаФорма.ТоварГУИД;
	ДокументГУИД  = Объект.ДокументГУИД;   
	
	Если ГМ Тогда     
		
		ИнформацияОТоваре = Новый Структура("Наименование", Штрихкод);	
		ОбщегоНазначенияКлиент.ОтобразитьИнформациюОГМ_Структура(ИнформацияОТоваре, ЭтаФорма.ОписаниеОшибки, ЭтаФорма);
		ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();   
		
		Возврат ""; 
		
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Найти товар по штрихкоду
	РезультатСтруктура = ОбщегоНазначения.НайтиТоварПоШтрихкоду(Штрихкод, ТипДокумента, ДокументГУИД, ТоварГУИД);	
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();			
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		Возврат "";
		
	КонецЕсли; 
	
	Если РезультатСтруктура.Данные.Количество() = 1 Тогда
		
		Если РезультатСтруктура.Данные[0].ТипСтрокиЗапроса = "Ячейка" Тогда
	
			Если ТипДокумента = "ПоступлениеТоваровУслуг" Тогда				
				
				Результат = ОбработатьВыбраннуюЯчейкуДляРазмещенияТовара(ЭтаФорма);
				Возврат Результат;
				
			ИначеЕсли ТипДокумента = "ПеремещениеТовараИзЯчейки" Тогда 				
				
				Результат = ОбработатьВыбраннуюЯчейкуДляПеремещенияТовара(ЭтаФорма);				
				Возврат Результат;
				
			ИначеЕсли ТипДокумента = "ЗаданиеНаИнвентаризацию" Тогда 				
				
				Результат = ОбработатьВыбраннуюЯчейкуИзЗаданияНаИнвентаризацию(ЭтаФорма);				
				Возврат Результат;
				
			КонецЕсли;
			
			Возврат "";						
			
		КонецЕсли; 
		
		ЭтаФорма.НайденныйТовар = РезультатСтруктура.Данные[0];
		
		Если ТипДокумента = "ПоступлениеТоваровУслуг" Тогда
			
		   ОбработкаШтрихкодаВРучномРежиме_ПоступлениеТоваровУслуг(ЭтаФорма, ТипДокумента);
			  
   	    ИначеЕсли ТипДокумента = "ПеремещениеТовараИзЯчейки" Тогда 
			  
		  ОбработкаШтрихкодаВРучномРежиме_ПеремещениеТовараИзЯчейки(ЭтаФорма, ТипДокумента);
			  
	   ИначеЕсли ТипДокумента = "ЗаданиеНаИнвентаризацию" Тогда 							  
			  
		  ОбработкаШтрихкодаВРучномРежиме_ДляИнвентаризируемойЯчейки(ЭтаФорма, ТипДокумента);

		КонецЕсли; 
		
	ИначеЕсли РезультатСтруктура.Данные.Количество() >  1 Тогда		
		
		Оповестить("СканированиеШтрихкода");	
		ДополнительныеПараметры  = Новый Структура("ЭтаФорма, ТипДокумента, НайденныеТовары", ЭтаФорма, ТипДокумента, РезультатСтруктура.Данные);		
		Оповещение = Новый ОписаниеОповещения("ПолучениеДанныхПриЗакрытииФормыВыбораТовараДокумента", ЭтотОбъект, ДополнительныеПараметры);
																												
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("НайденныеТовары", РезультатСтруктура.Данные);		
		//ОткрытьФорму("Обработка.ПриемкаКоллективная.Форма.ФормаВыбораТовараДокумента", ПараметрыФормы, ЭтаФорма,,, , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ОткрытьФорму("Обработка.ОбщиеФормы.Форма.ФормаВыбораТовараДокумента", ПараметрыФормы, ЭтаФорма,,, , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);		
		
	Иначе                 
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
		Возврат "НеизвестныйШтрихкод";                          
		
	КонецЕсли;                                                                        
				
КонецФункции 

&НаКлиенте		  
Процедура ПолучениеДанныхПриЗакрытииФормыВыбораТовараДокумента(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ЭтаФорма = ДополнительныеПараметры.ЭтаФорма;
		Если Результат.ТипСтрокиЗапроса = "Ячейка" Тогда
			
			Если ДополнительныеПараметры.ТипДокумента = "ПоступлениеТоваровУслуг" Тогда
				
				ОбработатьВыбраннуюЯчейкуДляРазмещенияТовара(ЭтаФорма);				
				
			ИначеЕсли ДополнительныеПараметры.ТипДокумента = "ПеремещениеТовараИзЯчейки" Тогда 
				
				ОбработатьВыбраннуюЯчейкуДляПеремещенияТовара(ЭтаФорма);
				
			ИначеЕсли ДополнительныеПараметры.ТипДокумента = "ЗаданиеНаИнвентаризацию" Тогда 
				
				ОбработатьВыбраннуюЯчейкуИзЗаданияНаИнвентаризацию(ЭтаФорма);
				ДополнительныеПараметры.ЭтаФорма.Закрыть();
				
			КонецЕсли; 
			
			Возврат;
			
		КонецЕсли; 
		
		ДополнительныеПараметры.ЭтаФорма.ТоварГУИД = Результат.ТоварГУИД;		
		Для Счетчик = 0 По ДополнительныеПараметры.НайденныеТовары.Количество() - 1 Цикл
			
			Строка = ДополнительныеПараметры.НайденныеТовары [Счетчик];
			Если Строка.Владелец = Результат.ТоварГУИД Тогда
				ДополнительныеПараметры.ЭтаФорма.НайденныйТовар = Строка;			
				Прервать;
			КонецЕсли; 			
		КонецЦикла;
		
		
		Если ДополнительныеПараметры.ТипДокумента = "ПоступлениеТоваровУслуг" Тогда
			
			  ОбработкаШтрихкодаВРучномРежиме_ПоступлениеТоваровУслуг(ДополнительныеПараметры.ЭтаФорма, ДополнительныеПараметры.ТипДокумента);
			  
		  ИначеЕсли ДополнительныеПараметры.ТипДокумента = "ПеремещениеТовараИзЯчейки" Тогда 
			  
			  ОбработкаШтрихкодаВРучномРежиме_ПеремещениеТовараИзЯчейки(ДополнительныеПараметры.ЭтаФорма, ДополнительныеПараметры.ТипДокумента);
			  
		  ИначеЕсли ДополнительныеПараметры.ТипДокумента = "ЗаданиеНаИнвентаризацию" Тогда 
			  
			  ОбработкаШтрихкодаВРучномРежиме_ДляИнвентаризируемойЯчейки(ДополнительныеПараметры.ЭтаФорма, ДополнительныеПараметры.ТипДокумента);
			  
		КонецЕсли; 
		
	Иначе
		
		РежимВводаАвтоматический = ОбщегоНазначения.УстановленРежимВводаАвтоматический();
		Если  Не РежимВводаАвтоматический  Тогда
			ОбщегоНазначения.УстановитьРежимВводаНаСервере();	
		КонецЕсли; 			

		ОбщегоНазначения.УстановитьРежимВыбораДляДокументаИнвентаризации("ВыборНоменклатуры");
		ДополнительныеПараметры.ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();
				
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Функция ОбработатьВыбраннуюЯчейкуДляРазмещенияТовара(ЭтаФорма)
	
	Проверка = ОбщегоНазначенияКлиент.СканированныйШтрихкодЯвляетсяЯчейкой(ЭтаФорма.Штрихкод, ЭтаФорма.Объект.ЯчейкаПриемки);		
	Если Проверка Тогда        
		
		ЭтаФорма.ОбработатьЯчейкуДляЗакрытияПриемкиТовара();		
		ОбщегоНазначения.УстановитьРежимВводаНаСервере(Истина);
		ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборЯчейки");
		Результат =  "ЗакрытиеЯчейкиПриемки";									
		
	Иначе                                               		
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();		
		ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборНоменклатуры");
		Результат = "ЯчейкаНеСоотвестЯчейкиПриемки";
		
	КонецЕсли; 
	
	ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();					
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОбработатьВыбраннуюЯчейкуДляПеремещенияТовара(Этаформа)
	
	Проверка = ОбщегоНазначенияКлиент.СканированныйШтрихкодЯвляетсяЯчейкой(ЭтаФорма.Штрихкод, ЭтаФорма.Объект.ЯчейкаКуда);		
	Если Проверка Тогда                                  
				
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлЯчейки();
		ОбщегоНазначения.УстановитьРежимВводаНаСервере(Истина);
		ЭтаФорма.СоздатьДокументПеремещенияПослеСканирЯчейкиКуда(ЭтаФорма.Объект);				
		Результат =  "ЗакрытиеЯчейкиПриемки";									
		
	Иначе                                               
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();
		ОбщегоНазначения.УстановитьРежимВвыбораДляПеремещенияТовара("ПоискНоменклатуры");
		Результат = "ЯчейкаНеСоотвестЯчейкиПриемки";
		
	КонецЕсли; 
	
	ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();					
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОбработатьВыбраннуюЯчейкуИзЗаданияНаИнвентаризацию(ЭтаФорма)
	
	Проверка = ОбщегоНазначенияКлиент.СканированныйШтрихкодЯвляетсяЯчейкой(ЭтаФорма.Штрихкод, ЭтаФорма.КодЯчейкиФормат);		
	Если Проверка Тогда                                  
				
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлЯчейки();
		Результат =  "ЗакрытиеЯчейкиПриемки";									
		
	Иначе                                               
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();
		ОбщегоНазначения.УстановитьРежимВыбораДляДокументаИнвентаризации("ПоискНоменклатуры");
		Результат = "ЯчейкаНеСоотвестЯчейкеИнвентаризации";
		
	КонецЕсли; 
	
	ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();					
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОбработкаШтрихкодаВРучномРежиме_ПеремещениеТовараИзЯчейки(ЭтаФорма, ТипДокумента)
	
	Ошибка = "";
	Объект        = ЭтаФорма.Объект;
	Штрихкод      = ЭтаФорма.Штрихкод; 
	ТоварГУИД     =  ЭтаФорма.ТоварГУИД;                                              
	ДокументГУИД  = Объект.ДокументГУИД;                                                  
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Получить остаток по найденному товару в ячейке ОТКУДА		
	ТоварГУИД = ЭтаФорма.НайденныйТовар.Владелец;
	РезультатСтруктура = ОбщегоНазначения.ПолучитьОстатокПоТоваруВЯчейке(Объект.ЯчейкаОткудаГУИД, Штрихкод, ТоварГУИД);
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();			
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		
		ЭтаФорма.Элементы.ГруппаВведенооеКоличествоВРучную.Видимость = Ложь;
		Возврат "";
		
	КонецЕсли; 
	
	Если РезультатСтруктура.Данные.Количество() = 0 Или РезультатСтруктура.Данные[0].ОстатокВЯчейке = 0 Тогда
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
		ПоказатьПредупреждение(,"Ошибка: Номенклатура со штрихкодом " + ЭтаФорма.Штрихкод + " " + ЭтаФорма.НайденныйТовар.Наименование
			+ " в ячейке " + Объект.ЯчейкаОткуда + " не найдена.", 4);	
			
		ЭтаФорма.Элементы.ГруппаВведенооеКоличествоВРучную.Видимость = Ложь;		
		Возврат "";
		
	КонецЕсли; 	                                                    
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
	ЭтаФорма.ОстатокПоТоваруВЯчейке = РезультатСтруктура.Данные[0];
	
	// Получить остаток по найденному товару в ячейке КУДА			
	РезультатСтруктура = ОбщегоНазначения.ПолучитьОстатокПоТоваруВЯчейке(Объект.ЯчейкаКудаГУИД, Штрихкод, ТоварГУИД);

	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();			
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		Возврат "";
		
	КонецЕсли; 
	
	Если РезультатСтруктура.Данные.Количество() = 0 Или РезультатСтруктура.Данные[0].ОстатокВЯчейке = 0 Тогда
		ЭтаФорма.ОстатокВЯчейкеКуда = 0;
	Иначе
		ЭтаФорма.ОстатокВЯчейкеКуда = РезультатСтруктура.Данные[0].ОстатокВЯчейке;
	КонецЕсли; 
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	// Получить ВЕСЬ остаток по найденному товару 
	РезультатСтруктура = ОбщегоНазначения.ПолучитьОстатокТовара(ТоварГУИД);	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();			
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		Возврат "";
		
	КонецЕсли; 	
	
	ЭтаФорма.ОстатокВыбранногоТовараНаСкладе = РезультатСтруктура.Данные;
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
																									 
	ИнформацияОТоваре = ОбщегоНазначенияКлиент.ПолучитьОписаниеОтсканированногоТовара_Структура_Перемещение(ЭтаФорма.НайденныйТовар,  
															   	 							   			    ЭтаФорма.ОстатокПоТоваруВЯчейке,
														   			                                        ЭтаФорма.ОстатокВЯчейкеКуда,
														   			                                        ЭтаФорма.ОстатокВыбранногоТовараНаСкладе);
																								 																								
	ОбщегоНазначенияКлиент.ОтобразитьИнформациюОТоваре_Структура(ИнформацияОТоваре, Ошибка, ЭтаФорма);	
	
	ЭтаФорма.РучнойВводКоличества[0].ВведенноеКоличествоВРучную = 1;
	
	Возврат "";

КонецФункции

&НаКлиенте
Функция ОбработкаШтрихкодаВРучномРежиме_ПоступлениеТоваровУслуг(ЭтаФорма, ТипДокумента)
	
	Ошибка = "";
	Объект        = ЭтаФорма.Объект;
	Штрихкод      = ЭтаФорма.Штрихкод; 
	ТоварГУИД     =  ЭтаФорма.ТоварГУИД;                                              
	ДокументГУИД  = Объект.ДокументГУИД;                                                  
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Получить остаток по найденному товару	
	ТоварГУИД = ЭтаФорма.НайденныйТовар.Владелец;
	РезультатСтруктура = ОбщегоНазначения.ПолучитьОстатокПоТоваруИзДокумента(ДокументГУИД, Штрихкод, ТоварГУИД);			
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда                               
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();			
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		Возврат "";
		
	КонецЕсли; 
			
	Если РезультатСтруктура.Данные.Количество() = 0 Тогда
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();			
		ПоказатьПредупреждение(,"Ошибка: Номенклатура со штрихкодом " + ЭтаФорма.Штрихкод + " " + ЭтаФорма.НайденныйТовар.Наименование
			+ " в документе не найдена.", 4);	
		Возврат "";
		
	КонецЕсли;  
	
	
	// КоличествоВДокументе, КоличествоВБуфере, СсылкаТовара	
	ЭтаФорма.ОстатокПоТоваруВДокументе = РезультатСтруктура.Данные[0];
	
	//ИнформацияОТоваре = ОбщегоНазначенияКлиент.ПолучитьТекстДляОтсканированногоТовара(ЭтаФорма.НайденныйТовар, ЭтаФорма.ОстатокПоТоваруВДокументе);
	//ОбщегоНазначенияКлиент.ОтобразитьИнформациюОТоваре(ИнформацияОТоваре, Ошибка, ЭтаФорма);
	
	ИнформацияОТоваре = ОбщегоНазначенияКлиент.ПолучитьДляОтсканированногоТовара_Структура(ЭтаФорма.НайденныйТовар, ЭтаФорма.ОстатокПоТоваруВДокументе);	
	ОбщегоНазначенияКлиент.ОтобразитьИнформациюОТоваре_Структура(ИнформацияОТоваре, Ошибка, ЭтаФорма);
	
	//ЭтаФорма.ЭтотОбъект.ВведенноеКоличествоВРучную  = 1;			
	ЭтаФорма.РучнойВводКоличества[0].ВведенноеКоличествоВРучную = 1;
	
КонецФункции                                                                 

&НаКлиенте
Функция  ОбработкаШтрихкодаВРучномРежиме_ДляИнвентаризируемойЯчейки(ЭтаФорма, ТипДокумента)
	
	Ошибка            = "";
	Параметры       = ЭтаФорма.Параметры;
	ЯчейкаГУИД     = Параметры.ЯчейкаГУИД;
	Штрихкод         = ЭтаФорма.Штрихкод; 
	ДокументГУИД  = ЭтаФорма.Объект.ДокументГУИД;                                                  	
	ТоварГУИД 	   = ЭтаФорма.НайденныйТовар.Владелец;
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	ЭтаФорма.КоличествоНабраноТСД =  1;
																							 																								 																											 
	ИнформацияОТоваре =  ОбщегоНазначенияКлиент.ПолучитьДляОтсканированногоТовара_Структура_Инвентаризация(ЭтаФорма.НайденныйТовар, ЭтаФорма.КоличествоНабраноТСД);																								 	
	ОбщегоНазначенияКлиент.ОтобразитьИнформациюОТоваре_Структура(ИнформацияОТоваре, ЭтаФорма.ОписаниеОшибки, ЭтаФорма);
	
	ЭтаФорма.РучнойВводКоличества[0].ВведенноеКоличествоВРучную = 1;
		
КонецФункции
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
&НаКлиенте
Процедура ОбработатьВведеноеКоличествоТовара(ЭтаФорма, ТипДокумента) Экспорт
	
	//КоличествоВручную = ЭтаФорма.ЭтотОбъект.ВведенноеКоличествоВРучную * ЭтаФорма.НайденныйТовар.ШтрихкодЕдИзмКоэффициент; ЭтаФорма.ВведенноеКоличествоВРучную
	Если ЭтаФорма.ИмяФормы = "Обработка.ПриемкаКоллективная.Форма.ФормаРазмещениеТовара" Тогда
		
		ВведенноеКоличествоВРучную = ЭтаФорма.РучнойВводКоличества[0].ВведенноеКоличествоВРучную;	
		
	ИначеЕсли ЭтаФорма.ИмяФормы = "Обработка.ПеремещениеТовараИзЯчейки.Форма.ФормаПеремещениеНоменклатуры" Тогда

		ВведенноеКоличествоВРучную = ЭтаФорма.РучнойВводКоличества[0].ВведенноеКоличествоВРучную;			
		
	ИначеЕсли ЭтаФорма.ИмяФормы = "Обработка.ИнвентаризацияПоЯчейкам.Форма.ФормаРаботыСЗаданиемНаИнвентаризацию" Тогда

		ВведенноеКоличествоВРучную = ЭтаФорма.РучнойВводКоличества[0].ВведенноеКоличествоВРучную;			   
				                                                                                                                                                  
	Иначе 
		ВведенноеКоличествоВРучную = ЭтаФорма.ВведенноеКоличествоВРучную;	
	КонецЕсли; 
	
	
	Если ТипДокумента  = "ИнвентаризацияЯчейки" Тогда
		// Коэффициент считается равным 1
		КоличествоВручную = ВведенноеКоличествоВРучную * 1;
	Иначе
		КоличествоВручную = ВведенноеКоличествоВРучную * ЭтаФорма.НайденныйТовар.ШтрихкодЕдИзмКоэффициент;	
	КонецЕсли; 
				
	Если КоличествоВручную = 0 Тогда
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();			
		ПоказатьПредупреждение(, "Количество должно быть > 0", 4);
		ЭтаФорма.ЭтотОбъект.ВведенноеКоличествоВРучную = 1;
		Возврат;
		
	КонецЕсли; 
				
	Если ТипДокумента = "ПоступлениеТоваровУслуг" Тогда
		  ОбработатьВведеноеКоличествоТовара_ПоступлениеТоваровУслуг(ЭтаФорма, ТипДокумента, КоличествоВручную);
	ИначеЕсли ТипДокумента = "ПеремещениеТовараИзЯчейки" Тогда 
		  ОбработатьВведеноеКоличествоТовара_ПеремещениеТовараИзЯчейки(ЭтаФорма, ТипДокумента, КоличествоВручную);
    ИначеЕсли ТипДокумента = "ИнвентаризацияЯчейки" Тогда 		  			 
		  ОбработатьВведеноеКоличествоТовара_ИнвентаризцияЯчейки(ЭтаФорма, ТипДокумента, КоличествоВручную);
	КонецЕсли; 
		
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
&НаКлиенте
Процедура ОбработатьВведеноеКоличествоТовара_ПеремещениеТовараИзЯчейки(ЭтаФорма, ТипДокумента, КоличествоВручную)
	
	Ошибка = "";
	Объект        = ЭтаФорма.Объект;
	Штрихкод      = ЭтаФорма.Штрихкод; 
	ТоварГУИД     = ЭтаФорма.ТоварГУИД;
	                                        	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Получить остаток по найденному товару в ячейке ОТКУДА		
	ТоварГУИД = ЭтаФорма.НайденныйТовар.Владелец;
	РезультатСтруктура = ОбщегоНазначения.ПолучитьОстатокПоТоваруВЯчейке(Объект.ЯчейкаОткудаГУИД, Штрихкод, ТоварГУИД);
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();			
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		
		ЭтаФорма.Элементы.ГруппаВведенооеКоличествоВРучную.Видимость = Ложь;
		ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();				
		Возврат;
		
	КонецЕсли; 
	
	Если РезультатСтруктура.Данные.Количество() = 0 Или РезультатСтруктура.Данные[0].ОстатокВЯчейке = 0 Тогда
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
		ПоказатьПредупреждение(,"Ошибка: Номенклатура со штрихкодом " + ЭтаФорма.Штрихкод + " " + ЭтаФорма.НайденныйТовар.Наименование
			+ " в ячейке " + Объект.ЯчейкаОткуда + " не найдена.", 4);	
			
		ЭтаФорма.Элементы.ГруппаВведенооеКоличествоВРучную.Видимость = Ложь;		
		ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();				
		Возврат;
		
	КонецЕсли; 	                                                    
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////		
	ЭтаФорма.ОстатокПоТоваруВЯчейке = РезультатСтруктура.Данные[0];
	КоличествоНабрано = ЭтаФорма.ОстатокПоТоваруВЯчейке.КоличествоНабрано + КоличествоВручную;
	
	Если (ЭтаФорма.ОстатокПоТоваруВЯчейке.ОстатокВЯчейке - КоличествоНабрано) < 0 Тогда
		                                                                                               
		//ШаблонТекстаОшибки = "Уже набрано %1 из %2 (%3)" + Символы.ПС;
		//ШаблонТекстаОшибки = ШаблонТекстаОшибки + "всего в ячейке ""Куда"": %4" + Символы.ПС;
		//ШаблонТекстаОшибки = ШаблонТекстаОшибки + "ПЫТАЕТЕСЬ ВЗЯТЬ %6 (%3)" + Символы.ПС;                        
		//ШаблонТекстаОшибки = ШаблонТекстаОшибки + "Всего на складе: %5" + Символы.ПС;                        
		//Ошибка  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаОшибки, 
		//		КоличествоНабрано,				
		//		ЭтаФорма.ОстатокПоТоваруВЯчейке.ОстатокВЯчейке, 
		//		ЭтаФорма.НайденныйТовар.ЕдИзмНаименование,
		//		ЭтаФорма.ОстатокВЯчейкеКуда,
		//		ЭтаФорма.ОстатокВыбранногоТовараНаСкладе,
		//		КоличествоВручную
		//		);						
				
		
		ШаблонТекстаОшибки = "Всего в ячейке (%1) %2 " + Символы.ПС;
		ШаблонТекстаОшибки = ШаблонТекстаОшибки + "Доступное количество %3" + Символы.ПС;
		ШаблонТекстаОшибки = ШаблонТекстаОшибки + "Уже набрано %4" + Символы.ПС;                        
		
		Ошибка  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаОшибки, 
				ЭтаФорма.Объект.ЯчейкаОткуда,
				ЭтаФорма.ОстатокПоТоваруВЯчейке.ОстатокВЯчейке,
				?(ЭтаФорма.ОстатокПоТоваруВЯчейке.ОстатокВЯчейке - КоличествоНабрано < 0 , 0 , ЭтаФорма.ОстатокПоТоваруВЯчейке.ОстатокВЯчейке - КоличествоНабрано),
				ЭтаФорма.ОстатокПоТоваруВЯчейке.КоличествоНабрано
				);						
				
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	

		ИнформацияОТоваре = ОбщегоНазначенияКлиент.ПолучитьОписаниеТовара(ЭтаФорма.НайденныйТовар);
		ОбщегоНазначенияКлиент.ОтобразитьИнформациюОТоваре(ИнформацияОТоваре, Ошибка, ЭтаФорма);                                         
		ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();				
				
		Возврат;		
		
	КонецЕсли; 
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	// Получить остаток по найденному товару в ячейке КУДА			
	РезультатСтруктура = ОбщегоНазначения.ПолучитьОстатокПоТоваруВЯчейке(Объект.ЯчейкаКудаГУИД, Штрихкод, ТоварГУИД);

	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();			
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		Возврат;
		
	КонецЕсли; 
	
	Если РезультатСтруктура.Данные.Количество() = 0 Или РезультатСтруктура.Данные[0].ОстатокВЯчейке = 0 Тогда
		ЭтаФорма.ОстатокВЯчейкеКуда = 0;
	Иначе
		ЭтаФорма.ОстатокВЯчейкеКуда = РезультатСтруктура.Данные[0].ОстатокВЯчейке;
	КонецЕсли; 
		
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	// Получить ВЕСЬ остаток по найденному товару 
	РезультатСтруктура = ОбщегоНазначения.ПолучитьОстатокТовара(ТоварГУИД);	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();			
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		Возврат;		
		
	КонецЕсли; 	
	
	ЭтаФорма.ОстатокВыбранногоТовараНаСкладе = РезультатСтруктура.Данные;
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	//Записать отсканированный товар в буфер арм кладовщика	
	РежимВвода = ОбщегоНазначения.УстановленРежимВводаРучной();
	ПользовательГУИД   = ОбщегоНазначения.ПолучитьПользователяГУИД();
	РезультатСтруктура = ОбщегоНазначения.ДобавитьТоварВБуферАРМКладовщикаПеремещение(ПользовательГУИД, 
																					  Объект.ЯчейкаОткудаГУИД, 
																					  ТоварГУИД, 
																					  ТекущаяДата(), 
																					  Штрихкод, 
																					  КоличествоВручную, 
																					  Объект.ЯчейкаКудаГУИД, 
																					  РежимВвода);																					  
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		Возврат;
		
	ИначеЕсли РезультатСтруктура.Данные = Ложь Тогда 
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();			
		ПоказатьПредупреждение(,"Ошибка добавления отсканированного товара", 4);	
		Возврат;
		
	КонецЕсли; 
	
	// Используется дла отображения на форме ТСД в шапке "Набрано 100 ед."
	ЭтаФорма.КоличествоНабраноТСД =  ЭтаФорма.КоличествоНабраноТСД + КоличествоВручную;
	
	ЭтаФорма.ОстатокПоТоваруВЯчейке.КоличествоНабрано = ЭтаФорма.ОстатокПоТоваруВЯчейке.КоличествоНабрано + КоличествоВручную;
	
	ИнформацияОТоваре = ОбщегоНазначенияКлиент.ПолучитьОписаниеОтсканированногоТовара_Структура_Перемещение(ЭтаФорма.НайденныйТовар, 
																								 ЭтаФорма.ОстатокПоТоваруВЯчейке,
																								 ЭтаФорма.ОстатокВЯчейкеКуда,
																								 ЭтаФорма.ОстатокВыбранногоТовараНаСкладе);
																									
	ОбщегоНазначенияКлиент.ОтобразитьИнформациюОТоваре_Структура(ИнформацияОТоваре, Ошибка, ЭтаФорма);

	Возврат;
	
КонецПроцедуры
 
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
&НаКлиенте
Процедура ОбработатьВведеноеКоличествоТовара_ПоступлениеТоваровУслуг(ЭтаФорма, ТипДокумента, КоличествоВручную)
	
	Ошибка = "";
	Объект        = ЭтаФорма.Объект;
	Штрихкод      = ЭтаФорма.Штрихкод;                                                
	ТоварГУИД     =  ЭтаФорма.ТоварГУИД;
	ДокументГУИД  = Объект.ДокументГУИД;                                                  
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Получить остаток по найденному товару	
	ТоварГУИД = ЭтаФорма.НайденныйТовар.Владелец;
	РезультатСтруктура = ОбщегоНазначения.ПолучитьОстатокПоТоваруИзДокумента(ДокументГУИД, Штрихкод, ТоварГУИД);			
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();			
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		
		Возврат;
		
	КонецЕсли; 
		
	Если РезультатСтруктура.Данные.Количество() = 0 Тогда		
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();			
		ПоказатьПредупреждение(,"Ошибка: Номенклатура со штрихкодом " + ЭтаФорма.Штрихкод + " " + ЭтаФорма.НайденныйТовар.Наименование
			+ " в документе не найдена.", 4);	
		ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		
		Возврат;		
		
	КонецЕсли; 
	
	// КоличествоВДокументе, КоличествоВБуфере, СсылкаТовара
	ЭтаФорма.ОстатокПоТоваруВДокументе = РезультатСтруктура.Данные[0];
	
	// КоличествоВДокументе, КоличествоВБуфере, СсылкаТовара, КоличествоВРазмещении
	КоличествоНабрано = ЭтаФорма.ОстатокПоТоваруВДокументе.КоличествоВБуфере + ЭтаФорма.ОстатокПоТоваруВДокументе.КоличествоВРазмещении + КоличествоВручную;
   	Если (ЭтаФорма.ОстатокПоТоваруВДокументе.КоличествоВДокументе - КоличествоНабрано ) < 0 Тогда
		
		ШаблонТекстаОшибки = "Уже набрано %1 из %2 (%3)" + Символы.ПС;
		ШаблонТекстаОшибки = ШаблонТекстаОшибки + "всего в поставке: %2" + Символы.ПС;
		ШаблонТекстаОшибки = ШаблонТекстаОшибки + "ПЫТАЕТЕСЬ ВЗЯТЬ %4 (%3)";                        
		                                                                  
		Ошибка  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаОшибки, 
				КоличествоНабрано,
				ЭтаФорма.ОстатокПоТоваруВДокументе.КоличествоВДокументе, 
				ЭтаФорма.НайденныйТовар.ЕдИзмНаименование,
				КоличествоВручную
				);						
				
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();				
		ИнформацияОТоваре = ОбщегоНазначенияКлиент.ПолучитьОписаниеТовара(ЭтаФорма.НайденныйТовар);
		ОбщегоНазначенияКлиент.ОтобразитьИнформациюОТоваре(ИнформацияОТоваре, Ошибка, ЭтаФорма);                                         
		ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		
		Возврат;		
		
	КонецЕсли; 
	
		                                                                                
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Записать отсканированный товар в буфер арм кладовщика	
	
	РежимВвода = ОбщегоНазначения.УстановленРежимВводаРучной();	
	РезультатСтруктура = ОбщегоНазначения.ДобавитьТоварВБуферАРМКладовщика(ДокументГУИД, ТоварГУИД, ОбщегоНазначения.ПолучитьПользователяГУИД(), 
			ТекущаяДата(), Штрихкод, КоличествоВручную, Объект.ЯчейкаПриемкиГУИД, РежимВвода);			
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда

		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();			
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		
		Возврат;
		
	ИначеЕсли РезультатСтруктура.Данные = Ложь Тогда 
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();			
		ПоказатьПредупреждение(,"Ошибка добавления отсканированного товара", 4);	
		ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		
		Возврат;
		
	КонецЕсли; 
	
	
	ЭтаФорма.ОстатокПоТоваруВДокументе.КоличествоВБуфере = ЭтаФорма.ОстатокПоТоваруВДокументе.КоличествоВБуфере + КоличествоВручную;
	
	ИнформацияОТоваре = ОбщегоНазначенияКлиент.ПолучитьДляОтсканированногоТовара_Структура(ЭтаФорма.НайденныйТовар, ЭтаФорма.ОстатокПоТоваруВДокументе);
	ОбщегоНазначенияКлиент.ОтобразитьИнформациюОТоваре_Структура(ИнформацияОТоваре, Ошибка, ЭтаФорма);
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////			

	Возврат;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
Процедура ОбработатьВведеноеКоличествоТовара_ИнвентаризцияЯчейки(ЭтаФорма, ТипДокумента, КоличествоВручную)
	
	Ошибка            = "";
	Параметры       = ЭтаФорма.Параметры;
	ЯчейкаГУИД     = Параметры.ЯчейкаГУИД;
	Штрихкод         = ЭтаФорма.Штрихкод; 
	ДокументГУИД  = ЭтаФорма.Объект.ДокументГУИД;                                                  	
	ТоварГУИД 	   = ЭтаФорма.НайденныйТовар.Владелец;
	
	ЭтаФорма.КоличествоНабраноТСД = 0;
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	РезультатСтруктура = ОбщегоНазначения.ПолучитьНабранноеКоличествоТовараИзИнвентаризируемойЯчейки(ДокументГУИД, ЯчейкаГУИД, Штрихкод, ТоварГУИД);
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);			
		Возврат;
	КонецЕсли; 
	
	
	НабранноеКоличествоТовара = 0;
	Если РезультатСтруктура.Данные.Количество() > 0 Тогда
		НабранноеКоличествоТовара = РезультатСтруктура.Данные[0].Quantity;	
	КонецЕсли; 
		
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Записать отсканированный товар в буфер арм кладовщика с проверкой 
	РежимВвода = ОбщегоНазначения.УстановленРежимВводаРучной();
	
	УдалятьЗаписиИзБуферов = ОбщегоНазначения.УдалятьЗаписиИзБуферов();
	
	РезультатСтруктура = ОбщегоНазначения.ДобавитьТоварВБуферИнвентаризацииПоЯчейкам(ДокументГУИД, 
																																	    ТоварГУИД, 
																																	    ОбщегоНазначения.ПолучитьПользователяГУИД(), 
																																		ТекущаяДата(), 
																																		Штрихкод, 
																																		КоличествоВручную, 
																																		Параметры.ЯчейкаГУИД,
																																		РежимВвода);			
																																		
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда

		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		Возврат;
		
	ИначеЕсли РезультатСтруктура.Данные = Ложь Тогда 
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();			
		ПоказатьПредупреждение(,"Ошибка добавления отсканированного товара", 4);	
		Возврат;
		
	КонецЕсли; 
	
	// Используется дла отображения на форме ТСД в шапке "Набрано 100 ед."
	ЭтаФорма.КоличествоНабраноТСД =  ЭтаФорма.КоличествоНабраноТСД + КоличествоВручную + НабранноеКоличествоТовара;
																							 																								 																											 
	ИнформацияОТоваре =  ОбщегоНазначенияКлиент.ПолучитьДляОтсканированногоТовара_Структура_Инвентаризация(ЭтаФорма.НайденныйТовар, ЭтаФорма.КоличествоНабраноТСД);
																								 	
	ОбщегоНазначенияКлиент.ОтобразитьИнформациюОТоваре_Структура(ИнформацияОТоваре, ЭтаФорма.ОписаниеОшибки, ЭтаФорма);
	ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();
	
КонецПроцедуры



