
&НаКлиенте
Перем Компонента;
&НаКлиенте
Перем Ошибка;

 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.СписокЗаданийНаДоставку.Обновить();
	
	ОбщегоНазначенияКлиент.ЗаполнитьТабЗначОК(ЭтаФорма);	
	ОбновитьСлуженоеСообщениеПодвал();	
	
КонецПроцедуры
 
&НаКлиенте
Процедура ОбновитьСлуженоеСообщениеПодвал() Экспорт
	
	ЭтаФорма.Подвал.Очистить();	
	СтрокаТЗ = Подвал.Добавить();

	СтрокаТЗ.ФИОСотрудинка = ОбщегоНазначенияКлиент.ПолучитьОписаниеСотрудника();
	Элементы.Подвал.Обновить();
	
	ЭтаФорма.ПодвалСообщение.Очистить();	
	СтрокаТЗ = ПодвалСообщение.Добавить();	
	СтрокаТЗ.СообщениеДляПользователя = "Выберите грузополучателя.";
	Элементы.ПодвалСообщение.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСвайпПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "ГруппаСтраница_2" Тогда 
		
	Иначе
		
		
	КонецЕсли; 
	
КонецПроцедуры                                                       

&НаКлиенте
Процедура ОткрытьФормуСписокГрузовыхМест() 
			
	П = Новый Структура;                                                  
	П.Вставить("РазгрузкаАвтоГУИД", ЭтаФорма.РазгрузкаАвтоГУИД); 
	П.Вставить("ЗаданиеНаДоставкуГУИД", ЭтаФорма.ЗаданиеНаДоставкуГУИД); 
	
	Оповещение = Новый ОписаниеОповещения("ОбновитьДанныеПриЗакытииФормыФормаГрузовогоМеста", ЭтотОбъект );			
	ОткрытьФорму("Обработка.ПриемкаГрузовыхМестИзРазгрузкиАвто.Форма.ФормаГрузовогоМеста", П, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	ОбновитьСлуженоеСообщениеПодвал();	
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьДанныеПриЗакытииФормыФормаГрузовогоМеста(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.СписокЗаданийНаДоставку.Обновить();
	
КонецПроцедуры
 

&НаКлиенте
Процедура ВыбратьЗаданиеНаДоставку(Команда)
	
	ЭтаФорма.ЗаданиеНаДоставкуГУИД = Элементы.СписокЗаданийНаДоставку.ТекущиеДанные.ЗаданиеНаДоставкуГУИД;
	ЭтаФорма.РазгрузкаАвтоГУИД = Элементы.СписокЗаданийНаДоставку.ТекущиеДанные.РазгрузкаАвтоГУИД;
	
	РезультатСтруктура = ОбщегоНазначения.УстановитьБлокировкуНаМаршрутИзРазгрузкаАвто(ЭтаФорма.ЗаданиеНаДоставкуГУИД, ЭтаФорма.РазгрузкаАвтоГУИД);	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "УстановитьБлокировкуНаМаршрутИзРазгрузкаАвто");					
		Возврат;
	КонецЕсли; 
	
	ОткрытьФормуСписокГрузовыхМест();
		
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокЗаданийНаДоставку.Параметры.УстановитьЗначениеПараметра("МаршрутГУИД", Параметры.МаршрутГУИД);
	СписокЗаданийНаДоставку.Параметры.УстановитьЗначениеПараметра("ЗаданиеНаДоставкуГУИД", Параметры.ЗаданиеНаДоставкуГУИД);
	
КонецПроцедуры


&НаКлиенте
Процедура ВыгрузитьДанные(Команда)
	
	ЗаписьЗаданиеНаДоставку = ОбщегоНазначения.ПолучитьИтогиПоЗаданиюНаДоставкуПоРазгрузкамАвтоДляПостановкиМаршрут(Параметры.ЗаданиеНаДоставкуГУИД);
	Если ЗаписьЗаданиеНаДоставку[0].КоличествоПоставленоНаМаршрут = 0  Тогда
		
		ПоказатьПредупреждение(,"Ошибка: Отсутствуют данные для выгрузки !!!", 3);	
		Возврат;
		
	КонецЕсли; 
	Если ЗаписьЗаданиеНаДоставку[0].КоличествоНеПоставленоНаМаршрут > 0 Тогда
		                                                                              		
		Оповещение = Новый ОписаниеОповещения("ОбработатьОтветНаВопрос", ЭтотОбъект);	
		ТекстВопроса = "Остались неотсканированные грузовые места. Уверены, что хотите завершить приемку грузовых мест ?";
		ПоказатьВопрос(Оповещение, ТекстВопроса,РежимДиалогаВопрос.ДаНет,0,КодВозвратаДиалога.Да, "Грузовые места",);
		
	Иначе			
		ЗавершитьВыгрузкуГрузовыхМестДляПостановкиНаМаршрутИзРегистраСведений(Параметры.ЗаданиеНаДоставкуГУИД);		
	КонецЕсли; 

КонецПроцедуры


&НаКлиенте
Процедура ОбработатьОтветНаВопрос(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда		
		ЗавершитьВыгрузкуГрузовыхМестДляПостановкиНаМаршрутИзРегистраСведений(Параметры.ЗаданиеНаДоставкуГУИД);							
	КонецЕсли; 	
	
КонецПроцедуры                                                                           

&НаКлиенте
Процедура ЗавершитьВыгрузкуГрузовыхМестДляПостановкиНаМаршрутИзРегистраСведений(ЗаданиеНаДоставкуГУИД)
	
	РезультатСтруктура = ОбщегоНазначения.ЗавершитьРазгрузкуГрузовыхМестИзРазгрузкаАвтоДляПостановкиНаМаршрут(ЗаданиеНаДоставкуГУИД);	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "ЗавершитьРазгрузкуГрузовыхМестИзРазгрузкаАвтоДляПостановкиНаМаршрут");					
		Возврат;
	КонецЕсли; 
	
	ПоказатьПредупреждение(,"Данные выгружены в 1С", 3);				 				
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	РезультатСтруктура = ОбщегоНазначения.ЗагрузитьСписокМаршрутовИзРазгрузкаАвто();	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "ЗагрузитьСписокМаршрутовИзРазгрузкаАвто");					
		Возврат;
	КонецЕсли; 

КонецПроцедуры
 

