
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПараметрыРаботы = ОбщегоНазначения.ПолучитьПараметрыРаботыСДокументомПТУ();	
	ЗаполнитьЗначенияСвойств(Объект, ПараметрыРаботы);	
	Элементы.ТоварыДокумента.Обновить();
	
	ЭтаФорма.Шапка.Очистить();
	//СтрокаТЗ = Шапка.Добавить();
	//СтрокаТЗ.ОписаниеСтатусаДокумента = "Найдено несколько единиц ";
	ПолучитьЗаголовокСтатуса();//"Найдено несколько товаров";
	
	ОбщегоНазначенияКлиент.ЗаполнитьТабЗначОК(ЭтаФорма);		
	ОбновитьСлуженоеСообщениеПодвал();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСлуженоеСообщениеПодвал() Экспорт
	
	ЭтаФорма.Подвал.Очистить();	
	СтрокаТЗ = Подвал.Добавить();
	СтрокаТЗ.ФИОСотрудника = ОбщегоНазначенияКлиент.ПолучитьОписаниеСотрудника();
	СтрокаТЗ.ОписаниеРежимаВводаКоличества = ОбщегоНазначенияКлиент.ПолучитьОтображениеОРежимеВводеКоличества();	
	
	ЭтаФорма.ПодвалСообщение.Очистить();	
	СтрокаТЗ = ПодвалСообщение.Добавить();	
	СтрокаТЗ.СообщениеДляПользователя = "Выберите товар:";
	Элементы.ПодвалСообщение.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьДляРазмещения(Команда)
	
	ТоварГУИД  = Элементы.ТоварыДокумента.ТекущиеДанные.Владелец;	
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("ТипСтрокиЗапроса", Элементы.ТоварыДокумента.ТекущиеДанные.ТипСтрокиЗапроса);
	СписокПараметров.Вставить("ТоварГУИД", ТоварГУИД);
	СписокПараметров.Вставить("Коэффициент", Элементы.ТоварыДокумента.ТекущиеДанные.Коэффициент);
	Закрыть( СписокПараметров );
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначения.ЗаписатьРегистрСведений("СписокТоваровДляВыбора", Параметры.НайденныеТовары);	
КонецПроцедуры

&НаСервере
Процедура ПолучитьЗаголовокСтатуса() 
	ЗапросКоличестваТоваров = Новый Запрос;
	ЗапросКоличестваТоваров.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокТоваровДляВыбора.Владелец КАК Владелец
	|ИЗ
	|	РегистрСведений.СписокТоваровДляВыбора КАК СписокТоваровДляВыбора
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокТоваровДляВыбора.Владелец"; 	
	ТЗ = ЗапросКоличестваТоваров.Выполнить().Выгрузить();
	Если ТЗ.Количество() = 1 Тогда
		СтрокаТЗ = Шапка.Добавить();
		СтрокаТЗ.ОписаниеСтатусаДокумента = "Найдено несколько единиц ";
		СтрокаТЗ = Шапка.Добавить();
		СтрокаТЗ.ОписаниеСтатусаДокумента = "с разной кратностью";
	ИначеЕсли ТЗ.Количество() > 1 Тогда 
		СтрокаТЗ = Шапка.Добавить();
		СтрокаТЗ.ОписаниеСтатусаДокумента = "Сообщите о совпадении ";
		СтрокаТЗ = Шапка.Добавить();
		СтрокаТЗ.ОписаниеСтатусаДокумента = "штрихкодов у данных товаров ";
		СтрокаТЗ = Шапка.Добавить();
		СтрокаТЗ.ОписаниеСтатусаДокумента = "своему руководителю ";
	КонецЕсли;	
КонецПроцедуры
