
&НаСервере
Функция ПроверитьПринадлежностьЯчейкиВыбранномуЗаданиюНаИнввентаризацию(СсылкаЯчейки, ЗаданиеНаИнвентаризациюГУИД) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокЗаданийНаИнвентаризацию.Ссылка КАК Ссылка,
	|	СписокЗаданийНаИнвентаризацию.КодЯчейки КАК КодЯчейки,
	|	СписокЗаданийНаИнвентаризацию.КодЯчейкиОтформат КАК КодЯчейкиОтформат
	|ИЗ
	|	РегистрСведений.СписокЗаданийНаИнвентаризацию КАК СписокЗаданийНаИнвентаризацию
	|ГДЕ
	|	СписокЗаданийНаИнвентаризацию.Ссылка = &Ссылка
	|	И СписокЗаданийНаИнвентаризацию.СсылкаЯчейки = &СсылкаЯчейки";
	Запрос.УстановитьПараметр("Ссылка", ЗаданиеНаИнвентаризациюГУИД);
	Запрос.УстановитьПараметр("СсылкаЯчейки", СсылкаЯчейки);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.КодЯчейки;
	КонецЕсли; 
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПроверитьЗавершениеЯчейкиИзЗаданияНаИнвентаризацию(СсылкаЯчейки, ЗаданиеНаИнвентаризациюГУИД) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокЗаданийНаИнвентаризацию.Ссылка КАК Ссылка,
	|	СписокЗаданийНаИнвентаризацию.КодЯчейки КАК КодЯчейки,
	|	СписокЗаданийНаИнвентаризацию.КодЯчейкиОтформат КАК КодЯчейкиОтформат
	|ИЗ
	|	РегистрСведений.СписокЗаданийНаИнвентаризацию КАК СписокЗаданийНаИнвентаризацию
	|ГДЕ
	|	СписокЗаданийНаИнвентаризацию.Ссылка = &Ссылка
	|	И СписокЗаданийНаИнвентаризацию.СсылкаЯчейки = &СсылкаЯчейки
	|	И СписокЗаданийНаИнвентаризацию.СтатусРаботы = 2";
	Запрос.УстановитьПараметр("Ссылка", ЗаданиеНаИнвентаризациюГУИД);
	Запрос.УстановитьПараметр("СсылкаЯчейки", СсылкаЯчейки);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		Возврат Истина;
	КонецЕсли; 
	
	Возврат Ложь;

КонецФункции

&НаСервере
Функция ПолучитьЗаданиеНаДоставку(Штрихкод) Экспорт
	
	ЗаданиеНаДоставкуГУИД = "";
	                                                                           
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокЗаданийНаДоставку.Объект КАК Объект,
	|	СписокЗаданийНаДоставку.Номер КАК Номер,
	|	СписокЗаданийНаДоставку.Штрихкод КАК Штрихкод,
	|	СписокЗаданийНаДоставку.ДатаЗагрузки КАК ДатаЗагрузки,
	|	СписокЗаданийНаДоставку.ВодительНаименование КАК ВодительНаименование,
	|	СписокЗаданийНаДоставку.ДатаДокумента КАК ДатаДокумента,
	|	СписокЗаданийНаДоставку.Маршрут КАК Маршрут,
	|	СписокЗаданийНаДоставку.КоличествоПогружено КАК КоличествоПогружено,
	|	СписокЗаданийНаДоставку.КоличествоНеЗагружено КАК КоличествоНеЗагружено,
	|	СписокЗаданийНаДоставку.КоличествоВсего КАК КоличествоВсего
	|ИЗ
	|	РегистрСведений.СписокЗаданийНаДоставку КАК СписокЗаданийНаДоставку
	|ГДЕ
	|	СписокЗаданийНаДоставку.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		ЗаданиеНаДоставкуГУИД = РезультатЗапроса.Объект;
	КонецЕсли; 
	
	Возврат ЗаданиеНаДоставкуГУИД;
	
КонецФункции

&НаСервере
Функция ПолучитьГрузовоеМесто(Штрихкод) Экспорт
	
	ГрузовоеМестоГУИД = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокГрузовыхМест.ЗаданиеНаДоставкуГУИД КАК ЗаданиеНаДоставкуГУИД,
	|	СписокГрузовыхМест.ГрузовоеМестоГУИД КАК ГрузовоеМестоГУИД,
	|	СписокГрузовыхМест.ШтрихкодГрузовогоМеста КАК ШтрихкодГрузовогоМеста
	|ИЗ
	|	РегистрСведений.СписокГрузовыхМест КАК СписокГрузовыхМест
	|ГДЕ
	|	СписокГрузовыхМест.ШтрихкодГрузовогоМеста = &ШтрихкодГрузовогоМеста";
	Запрос.УстановитьПараметр("ШтрихкодГрузовогоМеста", Штрихкод);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		ГрузовоеМестоГУИД = РезультатЗапроса.ГрузовоеМестоГУИД;
	КонецЕсли; 
	
	Возврат ГрузовоеМестоГУИД;
	
КонецФункции

&НаСервере
Функция ПолучитьГрузовоеМестоВПогруженных(Штрихкод,ШтрихКодЗадания) Экспорт
	
	ГрузовоеМестоГУИД = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВсеГрузовыеМеста.ЗаданиеНаДоставкуГУИД КАК ЗаданиеНаДоставкуГУИД,
	|	ВсеГрузовыеМеста.ГрузовоеМестоГУИД КАК ГрузовоеМестоГУИД,
	|	ВсеГрузовыеМеста.ШтрихкодГрузовогоМеста КАК ШтрихкодГрузовогоМеста
	|ИЗ
	|	РегистрСведений.ВсеГрузовыеМеста КАК ВсеГрузовыеМеста
	|ГДЕ
	|	ВсеГрузовыеМеста.ШтрихкодГрузовогоМеста = &ШтрихкодГрузовогоМеста
	|	И ВсеГрузовыеМеста.ЗаданиеНаДоставкуГУИД = &ЗаданиеНаДоставкуГУИД
	|	И ВсеГрузовыеМеста.Погружено";
	Запрос.УстановитьПараметр("ШтрихкодГрузовогоМеста", Штрихкод);
	Запрос.УстановитьПараметр("ЗаданиеНаДоставкуГУИД", ШтрихКодЗадания);

	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		ГрузовоеМестоГУИД = РезультатЗапроса.ГрузовоеМестоГУИД;
	КонецЕсли; 
	
	Возврат ГрузовоеМестоГУИД;
	
КонецФункции  

Функция ПолучитьГрузовоеМестоИзРазгрузкаАвто(Штрихкод) Экспорт
	
	ГрузовоеМестоГУИД = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокГрузовыхМестИзРазгрузкиАвто.ЗаданиеНаДоставкуГУИД КАК ЗаданиеНаДоставкуГУИД,
	|	СписокГрузовыхМестИзРазгрузкиАвто.ГрузовоеМестоГУИД КАК ГрузовоеМестоГУИД,
	|	СписокГрузовыхМестИзРазгрузкиАвто.ШтрихкодГрузовогоМеста КАК ШтрихкодГрузовогоМеста
	|ИЗ
	|	РегистрСведений.СписокГрузовыхМестИзРазгрузкиАвто КАК СписокГрузовыхМестИзРазгрузкиАвто
	|ГДЕ
	|	СписокГрузовыхМестИзРазгрузкиАвто.ШтрихкодГрузовогоМеста = &ШтрихкодГрузовогоМеста";
	Запрос.УстановитьПараметр("ШтрихкодГрузовогоМеста", Штрихкод);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		ГрузовоеМестоГУИД = РезультатЗапроса.ГрузовоеМестоГУИД;
	КонецЕсли; 
	
	Возврат ГрузовоеМестоГУИД;
	
КонецФункции

Функция ПолучитьГрузовоеМестоИзРазгрузкаАвтоДляПостановкиНаМаршрут(Штрихкод) Экспорт
	
	ГрузовоеМестоГУИД = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст =                                                
	"ВЫБРАТЬ
	|	Т1.ЗаданиеНаДоставкуГУИД КАК ЗаданиеНаДоставкуГУИД,
	|	Т1.ГрузовоеМестоГУИД КАК ГрузовоеМестоГУИД,
	|	Т1.ШтрихкодГрузовогоМеста КАК ШтрихкодГрузовогоМеста
	|ИЗ
	|	РегистрСведений.СписокГрузовыхМестИзРазгрузкиАвтоДляПостановкиНаМаршрут КАК Т1
	|ГДЕ
	|	Т1.ШтрихкодГрузовогоМеста = &ШтрихкодГрузовогоМеста";
	Запрос.УстановитьПараметр("ШтрихкодГрузовогоМеста", Штрихкод);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		ГрузовоеМестоГУИД = РезультатЗапроса.ГрузовоеМестоГУИД;
	КонецЕсли; 
	
	Возврат ГрузовоеМестоГУИД;
	
КонецФункции

Функция ПолучитьГрузовоеМестоСлужебныеЗаписки(ШтрихКод) Экспорт

	СсылкаСлужебнаяЗаписка = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокГрузовыхМестСлужебныеЗаписки.ШтрихкодГрузовогоМеста КАК ШтрихкодГрузовогоМеста,
	|	СписокГрузовыхМестСлужебныеЗаписки.СсылкаСлужебнаяЗаписка КАК СсылкаСлужебнаяЗаписка
	|ИЗ
	|	РегистрСведений.СписокГрузовыхМестСлужебныеЗаписки КАК СписокГрузовыхМестСлужебныеЗаписки
	|ГДЕ
	|	СписокГрузовыхМестСлужебныеЗаписки.ШтрихкодГрузовогоМеста = &ШтрихкодГрузовогоМеста";
	Запрос.УстановитьПараметр("ШтрихкодГрузовогоМеста", ШтрихКод);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		СсылкаСлужебнаяЗаписка = РезультатЗапроса.СсылкаСлужебнаяЗаписка;
	КонецЕсли; 
	
	Возврат СсылкаСлужебнаяЗаписка;

КонецФункции

Функция ПолучитьГрузовоеМестоСлужебныеЗапискиВПогруженных(Штрихкод,СлужебнаяЗапискаГУИД) Экспорт

	ГрузовоеМестоГУИД = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокГрузовыхМестСлужебныеЗаписки.ШтрихкодГрузовогоМеста КАК ШтрихкодГрузовогоМеста
	|ИЗ
	|	РегистрСведений.СписокГрузовыхМестСлужебныеЗаписки КАК СписокГрузовыхМестСлужебныеЗаписки
	|ГДЕ
	|	СписокГрузовыхМестСлужебныеЗаписки.ШтрихкодГрузовогоМеста = &ШтрихкодГрузовогоМеста
	|	И СписокГрузовыхМестСлужебныеЗаписки.Погружено
	|	И СписокГрузовыхМестСлужебныеЗаписки.СсылкаСлужебнаяЗаписка = &СсылкаСлужебнаяЗаписка";
	
	Запрос.УстановитьПараметр("ШтрихкодГрузовогоМеста", Штрихкод);
	Запрос.УстановитьПараметр("СсылкаСлужебнаяЗаписка", СлужебнаяЗапискаГУИД);

	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		ГрузовоеМестоГУИД = РезультатЗапроса.ШтрихкодГрузовогоМеста;
	КонецЕсли; 
	
	Возврат ГрузовоеМестоГУИД;

КонецФункции

Функция ПроверитьОстатокНепогруженныхМестСлужебнаяЗаписка(СлужебнаяЗапискаГУИД) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокГрузовыхМестСлужебныеЗаписки.ШтрихкодГрузовогоМеста КАК ШтрихкодГрузовогоМеста
	|ИЗ
	|	РегистрСведений.СписокГрузовыхМестСлужебныеЗаписки КАК СписокГрузовыхМестСлужебныеЗаписки
	|ГДЕ
	|	НЕ СписокГрузовыхМестСлужебныеЗаписки.Погружено
	|	И СписокГрузовыхМестСлужебныеЗаписки.СсылкаСлужебнаяЗаписка = &СсылкаСлужебнаяЗаписка";
	
	Запрос.УстановитьПараметр("СсылкаСлужебнаяЗаписка", СлужебнаяЗапискаГУИД);

	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();

КонецФункции

&НаСервере
Функция ОбработатьОтсканированнуюСлужебнуюЗаписку(СлужебнаяЗапискаГУИД) Экспорт

	РезультатОтвета = ПолучитьСтруктуруОтвета();
	UserIdGUID = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл	
		
		Попытка

			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
		
			Ответ = WSПрокси.ProcessingIncomingMemo(СлужебнаяЗапискаГУИД , UserIdGUID);		
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);
			
			Прервать;                                                            
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ОбработатьОтсканированнуюСлужебнуюЗаписку");
			
		КонецПопытки;                              
		
	КонецЦикла;
	
	Возврат РезультатОтвета;

КонецФункции

&НаСервере
Функция ПолучитьОписаниеНайденогоТовара(ТоварГУИД) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	"""""""" + СписокНайденныхТоваровПоШтрихкоду.КодПроизводителя + """""" "" + СписокНайденныхТоваровПоШтрихкоду.Производитель + "" "" + СписокНайденныхТоваровПоШтрихкоду.Наименование + ""( "" + ВЫБОР
	|		КОГДА СписокНайденныхТоваровПоШтрихкоду.ШтрихкодЕдИзмНаименование = """"
	|			ТОГДА СписокНайденныхТоваровПоШтрихкоду.ЕдИзмНаименование
	|		ИНАЧЕ СписокНайденныхТоваровПоШтрихкоду.ШтрихкодЕдИзмНаименование
	|	КОНЕЦ + "" )"" КАК ОписаниеТовара
	|ИЗ
	|	РегистрСведений.СписокНайденныхТоваровПоШтрихкоду КАК СписокНайденныхТоваровПоШтрихкоду
	|ГДЕ
	|	СписокНайденныхТоваровПоШтрихкоду.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец", ТоварГУИД);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	РезультатЗапроса.Следующий();
	
	Возврат РезультатЗапроса.ОписаниеТовара;
	
КонецФункции

&НаСервере
Функция ПолучитьНомерЗаданияНаДоставку(ЗаданиеНаДоставкуГУИД) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СписокГрузовыхМест.НомерЗаданияНаДоставку КАК ЗаданиеНаДоставкуНомер
	|ИЗ
	|	РегистрСведений.СписокГрузовыхМест КАК СписокГрузовыхМест
	|ГДЕ
	|	СписокГрузовыхМест.ЗаданиеНаДоставкуГУИД = &ЗаданиеНаДоставкуГУИД";
	Запрос.УстановитьПараметр("ЗаданиеНаДоставкуГУИД", ЗаданиеНаДоставкуГУИД);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	РезультатЗапроса.Следующий();
	
	Возврат РезультатЗапроса.ЗаданиеНаДоставкуНомер;	 
	
КонецФункции

&НаСервере
Функция ПолучитьКоличествоЗаписейВРегистреСведений(ИмяРегистра) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Количество(*) КАК КоличествоЗаписей
	|ИЗ
	|	РегистрСведений.&ИмяТаблицы КАК &ИмяТаблицы";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяТаблицы", ИмяРегистра);	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	РезультатЗапроса.Следующий();
	
	Возврат РезультатЗапроса.КоличествоЗаписей;  
	
КонецФункции

&НаСервере
Функция ЗаполнитьСписокТоваровДляВыбора() Экспорт
	
	РегСведНабор = РегистрыСведений["СписокТоваровДляВыбора"].СоздатьНаборЗаписей();
	РегСведНабор.Прочитать();
	РегСведНабор.Очистить();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокНайденныхТоваровПоШтрихкоду.Наименование КАК Наименование,
	|	СписокНайденныхТоваровПоШтрихкоду.КодПроизводителя КАК КодПроизводителя,
	|	СписокНайденныхТоваровПоШтрихкоду.Производитель КАК Производитель,
	|	СУММА(СписокНайденныхТоваровПоШтрихкоду.КоличествоОстаток) КАК КоличествоОстаток,
	|	СписокНайденныхТоваровПоШтрихкоду.Владелец КАК Владелец,
	|	СписокНайденныхТоваровПоШтрихкоду.ТипСтрокиЗапроса КАК ТипСтрокиЗапроса,
	|	СписокНайденныхТоваровПоШтрихкоду.ГруппаАВСФилиала КАК ГруппаАВСФилиала
	|ИЗ
	|	РегистрСведений.СписокНайденныхТоваровПоШтрихкоду КАК СписокНайденныхТоваровПоШтрихкоду
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокНайденныхТоваровПоШтрихкоду.Владелец,
	|	СписокНайденныхТоваровПоШтрихкоду.Наименование,
	|	СписокНайденныхТоваровПоШтрихкоду.КодПроизводителя,
	|	СписокНайденныхТоваровПоШтрихкоду.Производитель,
	|	СписокНайденныхТоваровПоШтрихкоду.ТипСтрокиЗапроса,
	|	СписокНайденныхТоваровПоШтрихкоду.ГруппаАВСФилиала";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл
		
		НоваяЗапись = РегСведНабор.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, РезультатЗапроса);
		НоваяЗапись.КоличествоОстатокСтр = "Кол.: " + Строка(НоваяЗапись.КоличествоОстаток);
	КонецЦикла; 

	РегСведНабор.Записать(Истина);
	
КонецФункции

&НаСервере
Функция ВыгрузитьРегистрСведений(ИмяРегистра) Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	*,
	|   &ИдентификаторКлиента КАК Индентификатор
	|ИЗ
	|	РегистрСведений.&ИмяТаблицы КАК &ИмяТаблицы";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяТаблицы", ИмяРегистра);	
	Запрос.УстановитьПараметр("ИдентификаторКлиента", XMLСтрока(СистемнаяИнформация.ИдентификаторКлиента));
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	
	Возврат ТЗ;  
		
КонецФункции   

&НаСервере
Функция ПолучитьПервуюЗаписьИзРегистраСведений(ИмяРегистра) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1                                                                                                              	
	|	*
	|ИЗ
	|	РегистрСведений.&ИмяТаблицы КАК &ИмяТаблицы";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяТаблицы", ИмяРегистра);	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	Результат = ТаблицуВМассив(ТЗ);
	Возврат Результат;  
	
КонецФункции

&НаСервере
Функция ПолучитьЗаписьИзРегистраСведений(ИмяРегистра, ИмяПоля, ЗначенияДляПоиска ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1                                                                                                              	
	|	*
	|ИЗ
	|	РегистрСведений.&ИмяТаблицы КАК &ИмяТаблицы
	|ГДЕ &ИмяТаблицы.&ИмяПоля = &ЗначенияДляПоиска";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяТаблицы", ИмяРегистра);	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяПоля", ИмяПоля);	
	Запрос.УстановитьПараметр("ЗначенияДляПоиска", ЗначенияДляПоиска);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	Результат = ТаблицуВМассив(ТЗ);
	Возврат Результат;  
	
КонецФункции

&НаСервере
Функция ПолучитьФизЛицоКладовщика(ЗначенияДляПоиска ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1                                                                                                              	
	|	*
	|ИЗ
	|	РегистрСведений.ФизическоеЛицо КАК ФизическоеЛицо
	|ГДЕ ФизическоеЛицо.Код ПОДОБНО &ЗначенияДляПоиска";
	Запрос.УстановитьПараметр("ЗначенияДляПоиска","%" + ЗначенияДляПоиска);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	Результат = ТаблицуВМассив(ТЗ);
	Возврат Результат;  
	
КонецФункции

&НаСервере
Функция ЕстьНеРазгруженныеГрузовыеМеста(РазгрузкаАвтоГУИД) Экспорт
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(СписокГрузовыхМестИзРазгрузкиАвто.РазгрузкаАвтоГУИД) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА СписокГрузовыхМестИзРазгрузкиАвто.Разгружено = Ложь
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеРазгружено
	|ИЗ
	|	РегистрСведений.СписокГрузовыхМестИзРазгрузкиАвто КАК СписокГрузовыхМестИзРазгрузкиАвто
	|ГДЕ
	|	СписокГрузовыхМестИзРазгрузкиАвто.РазгрузкаАвтоГУИД = &РазгрузкаАвтоГУИД";
	Запрос.УстановитьПараметр("РазгрузкаАвтоГУИД", РазгрузкаАвтоГУИД);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	РезультатЗапроса.Следующий();
	
	Если РезультатЗапроса.Количество > 0 И РезультатЗапроса.НеРазгружено > 0 Тогда
		Результат = Истина;
	КонецЕсли; 
	
	Возврат Результат;	 
	
КонецФункции
 
&НаСервере
Функция ЕстьНеРазгруженныеГрузовыеМестаДляПостановкиНаМаршрут(РазгрузкаАвтоГУИД) Экспорт
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(Т1.РазгрузкаАвтоГУИД) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА Т1.ПоставленоНаМаршрут = Ложь
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеПоставленоНаМаршрут
	|ИЗ
	|	РегистрСведений.СписокГрузовыхМестИзРазгрузкиАвтоДляПостановкиНаМаршрут КАК Т1
	|ГДЕ
	|	Т1.РазгрузкаАвтоГУИД = &РазгрузкаАвтоГУИД";
	
	Запрос.УстановитьПараметр("РазгрузкаАвтоГУИД", РазгрузкаАвтоГУИД);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	РезультатЗапроса.Следующий();
	
	Если РезультатЗапроса.Количество > 0 И РезультатЗапроса.НеПоставленоНаМаршрут > 0 Тогда
		Результат = Истина;
	КонецЕсли; 

	Возврат Результат;	 
	
КонецФункции

&НаСервере
Функция ПолучитьИтогиПоЗаданиюНаДоставкуПоРазгрузкамАвто(ЗаданиеНаДоставкуГУИД) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокЗаданийНаДоставку.Объект КАК ЗаданиеНаДоставку,
	|	СУММА(СписокЗаданийНаДоставку.КоличествоВсего) КАК КоличествоВсего,
	|	СУММА(СписокЗаданийНаДоставку.КоличествоРазгружено) КАК КоличествоРазгружено,
	|	СУММА(СписокЗаданийНаДоставку.КоличествоНеРазгружено) КАК КоличествоНеРазгружено
	|ИЗ
	|	РегистрСведений.СписокЗаданийНаДоставку КАК СписокЗаданийНаДоставку
	|ГДЕ
	|	СписокЗаданийНаДоставку.Объект = &ЗаданиеНаДоставкуГУИД
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокЗаданийНаДоставку.Объект";
	Запрос.УстановитьПараметр("ЗаданиеНаДоставкуГУИД", ЗаданиеНаДоставкуГУИД );
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	Результат = ТаблицуВМассив(ТЗ);
	Возврат Результат;  
	 
КонецФункции
 
&НаСервере
Функция ПолучитьИтогиПоЗаданиюНаДоставкуПоРазгрузкамАвтоДляПостановкиМаршрут(ЗаданиеНаДоставкуГУИД) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокМаршрутовДляПриемкиГрузовыхМест.ЗаданиеНаДоставкуГУИД КАК ЗаданиеНаДоставкуГУИД,	
	|	СУММА(СписокМаршрутовДляПриемкиГрузовыхМест.КоличествоВсего) КАК КоличествоВсего,
	|	СУММА(СписокМаршрутовДляПриемкиГрузовыхМест.КоличествоПоставленоНаМаршрут) КАК КоличествоПоставленоНаМаршрут,
	|	СУММА(СписокМаршрутовДляПриемкиГрузовыхМест.КоличествоНеПоставленоНаМаршрут) КАК КоличествоНеПоставленоНаМаршрут
	|ИЗ
	|	РегистрСведений.СписокМаршрутовДляПриемкиГрузовыхМест КАК СписокМаршрутовДляПриемкиГрузовыхМест
	|ГДЕ
	|	СписокМаршрутовДляПриемкиГрузовыхМест.ЗаданиеНаДоставкуГУИД = &ЗаданиеНаДоставкуГУИД
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокМаршрутовДляПриемкиГрузовыхМест.ЗаданиеНаДоставкуГУИД";
	
	Запрос.УстановитьПараметр("ЗаданиеНаДоставкуГУИД", ЗаданиеНаДоставкуГУИД );
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	Результат = ТаблицуВМассив(ТЗ);
	Возврат Результат;  
	 
КонецФункции

&НаСервере
Функция ПолучитьИтогиПоОстаткамПоВыбранномуТовару(ВладелецГУИД, Штрихкод) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокНайденныхТоваровПоШтрихкоду.Владелец КАК Владелец,
	|	СписокНайденныхТоваровПоШтрихкоду.Наименование КАК Наименование,
	|	СписокНайденныхТоваровПоШтрихкоду.КодПроизводителя КАК КодПроизводителя,
	|	СУММА(СписокНайденныхТоваровПоШтрихкоду.КоличествоОстаток) КАК КоличествоОстаток,
	|	СписокНайденныхТоваровПоШтрихкоду.Производитель КАК Производитель,
	|	СписокНайденныхТоваровПоШтрихкоду.ГруппаАВСФилиала КАК ГруппаАВСФилиала
	|ПОМЕСТИТЬ ВТТоварыНаСкладе
	|ИЗ
	|	РегистрСведений.СписокНайденныхТоваровПоШтрихкоду КАК СписокНайденныхТоваровПоШтрихкоду
	|ГДЕ
	|	СписокНайденныхТоваровПоШтрихкоду.ИмяТаблицы = &ИмяТаблицы_1
	|	И СписокНайденныхТоваровПоШтрихкоду.Владелец = &Владелец
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокНайденныхТоваровПоШтрихкоду.Владелец,
	|	СписокНайденныхТоваровПоШтрихкоду.Наименование,
	|	СписокНайденныхТоваровПоШтрихкоду.КодПроизводителя,
	|	СписокНайденныхТоваровПоШтрихкоду.Производитель,
	|	СписокНайденныхТоваровПоШтрихкоду.ГруппаАВСФилиала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокНайденныхТоваровПоШтрихкоду.Владелец КАК Владелец,
	|	СписокНайденныхТоваровПоШтрихкоду.Наименование КАК Наименование,
	|	СписокНайденныхТоваровПоШтрихкоду.КодПроизводителя КАК КодПроизводителя,
	|	СУММА(СписокНайденныхТоваровПоШтрихкоду.КоличествоОстаток) КАК КоличествоОстаток,
	|	СписокНайденныхТоваровПоШтрихкоду.Производитель КАК Производитель
	|ПОМЕСТИТЬ ВТТоварыВРезерве
	|ИЗ
	|	РегистрСведений.СписокНайденныхТоваровПоШтрихкоду КАК СписокНайденныхТоваровПоШтрихкоду
	|ГДЕ
	|	СписокНайденныхТоваровПоШтрихкоду.ИмяТаблицы = &ИмяТаблицы_2
	|	И СписокНайденныхТоваровПоШтрихкоду.Владелец = &Владелец
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокНайденныхТоваровПоШтрихкоду.Владелец,
	|	СписокНайденныхТоваровПоШтрихкоду.Наименование,
	|	СписокНайденныхТоваровПоШтрихкоду.КодПроизводителя,
	|	СписокНайденныхТоваровПоШтрихкоду.Производитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТТоварыНаСкладе.Владелец, ВТТоварыВРезерве.Владелец) КАК Владелец,
	|	ЕСТЬNULL(ВТТоварыНаСкладе.Наименование, ВТТоварыВРезерве.Наименование) КАК Наименование,
	|	ЕСТЬNULL(ВТТоварыНаСкладе.КодПроизводителя, ВТТоварыВРезерве.КодПроизводителя) КАК КодПроизводителя,
	|	ЕСТЬNULL(ВТТоварыВРезерве.КоличествоОстаток, 0) КАК КоличествоВРезерве,
	|	ЕСТЬNULL(ВТТоварыНаСкладе.КоличествоОстаток, 0) КАК КоличествоНаСкладе,
	|	ЕСТЬNULL(ВТТоварыНаСкладе.Производитель, ВТТоварыВРезерве.Производитель) КАК Производитель
	|ПОМЕСТИТЬ ВТПромежутРезультат
	|ИЗ
	|	ВТТоварыНаСкладе КАК ВТТоварыНаСкладе
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТТоварыВРезерве КАК ВТТоварыВРезерве
	|		ПО ВТТоварыНаСкладе.Владелец = ВТТоварыВРезерве.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокТоваровДляВыбора.Владелец КАК Владелец,
	|	СписокТоваровДляВыбора.Наименование КАК Наименование,
	|	СписокТоваровДляВыбора.КодПроизводителя КАК КодПроизводителя,
	|	СписокТоваровДляВыбора.Производитель КАК Производитель,
	|	""&ШТРИХКОД&"" КАК Штрихкод,
	|	ЕСТЬNULL(ВТПромежутРезультат.КоличествоВРезерве, 0) КАК КоличествоВРезерве,
	|	ЕСТЬNULL(ВТПромежутРезультат.КоличествоНаСкладе, 0) КАК КоличествоНаСкладе,
	|	СписокТоваровДляВыбора.ГруппаАВСФилиала КАК ГруппаАВСФилиала
	|ИЗ
	|	РегистрСведений.СписокТоваровДляВыбора КАК СписокТоваровДляВыбора
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПромежутРезультат КАК ВТПромежутРезультат
	|		ПО СписокТоваровДляВыбора.Владелец = ВТПромежутРезультат.Владелец
	|ГДЕ
	|	СписокТоваровДляВыбора.Владелец = &Владелец";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ШТРИХКОД&", Штрихкод);
	
	Запрос.УстановитьПараметр("ИмяТаблицы_1", "ТоварыНаСкладе" );
	Запрос.УстановитьПараметр("ИмяТаблицы_2", "ТоварыВРезерве" );
	Запрос.УстановитьПараметр("Владелец", ВладелецГУИД );
	
	РезультатЗапроса = Запрос.Выполнить();	
	
	ТЗ = РезультатЗапроса.Выгрузить();
	Результат = ТаблицуВМассив(ТЗ);
	Возврат Результат;  

КонецФункции

&НаСервере
Функция ПолучитьЯчейкиИзЗаданияНаИнвентаризацию(ЗаданиеНаИнвентаризациюГУИД) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокЗаданийНаИнвентаризацию.СсылкаЯчейки КАК СсылкаЯчейки
	|ИЗ
	|	РегистрСведений.СписокЗаданийНаИнвентаризацию КАК СписокЗаданийНаИнвентаризацию
	|ГДЕ
	|	СписокЗаданийНаИнвентаризацию.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ЗаданиеНаИнвентаризациюГУИД);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Результат = ТаблицуВМассив(ТЗ);
	Возврат Результат;  
	  
КонецФункции
 
&НаСервере
Функция ПолучитьРезультатПроверкиЯчеекДляИнвентаризации() Экспорт
	
	Результат = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПроверкаЯчеекДляИнвентаризации.СсылкаЯчейки КАК СсылкаЯчейки,
	|	ПроверкаЯчеекДляИнвентаризации.ПризнакИнвентаризации КАК ПризнакИнвентаризации
	|ИЗ
	|	РегистрСведений.ПроверкаЯчеекДляИнвентаризации КАК ПроверкаЯчеекДляИнвентаризации
	|ГДЕ
	|	НЕ ПроверкаЯчеекДляИнвентаризации.ПризнакИнвентаризации";
		
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Количество() > 0 Тогда
		Результат = Ложь;
	КонецЕсли; 
	 	
	Возврат Результат;
	                                                                    
КонецФункции
 

//ФУНКЦИОНАЛ РАбОТЫ С СЕРВЕРОМ ДАННЫХ

&НаСервере
Функция АвторизоватьПользователя(Штрихкод, Пароль, Адрес) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	
	Если Не ЗначениеЗаполнено(Штрихкод) И Не ЗначениеЗаполнено(Пароль) Тогда
		РезультатОтвета.Ошибка = "Сканируйте штрихкод сотрудника или введите пароль.";
		Возврат РезультатОтвета;
	КонецЕсли;
	

	Если Не ЗначениеЗаполнено(Адрес) Тогда
		РезультатОтвета.Ошибка = "Заполните адрес web-сервиса";
		Возврат РезультатОтвета;
	Иначе		
		Константы.Адрес.Установить(СокрЛП(Адрес));		
	КонецЕсли;
	
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл
		
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );

			Ответ = WSПрокси.AuthenticationUser(Штрихкод, Пароль);	
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);
			
			Если НЕ ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				
				Константы.Пользователь.Установить(РезультатОтвета.Данные.Пользователь);
				Константы.ПолноеИмя.Установить(РезультатОтвета.Данные.ПолноеИмя);
				Константы.ПользовательГУИД.Установить(РезультатОтвета.Данные.ПользовательГУИД);                               						
				Константы.Пароль.Установить(Пароль);
				
				РазрешеноПроведениеПТУ = Ложь;
				
				Если РезультатОтвета.Данные.Свойство("РазрешеноПроведениеПТУ") Тогда
					РазрешеноПроведениеПТУ = РезультатОтвета.Данные.РазрешеноПроведениеПТУ;
				КонецЕсли; 
				
				Константы.РазрешеноПроведениеПТУ.Установить(РазрешеноПроведениеПТУ);
				
				ОтображатьСлужебныеЗапискиТСД = Ложь;
				Если РезультатОтвета.Данные.Свойство("ОтображатьСлужебныеЗапискиТСД") Тогда
					ОтображатьСлужебныеЗапискиТСД = РезультатОтвета.Данные.ОтображатьСлужебныеЗапискиТСД;
				КонецЕсли;
				
				Константы.ОтображатьСлужебныеЗапискиТСД.Установить(ОтображатьСлужебныеЗапискиТСД);
				
				ОтображатьТЕ = Ложь;
				Если РезультатОтвета.Данные.Свойство("ОтображатьТЕ") Тогда
					ОтображатьТЕ = РезультатОтвета.Данные.ОтображатьТЕ;
				КонецЕсли;
				
				Константы.ОтображатьТЕ.Установить(ОтображатьТЕ);	
				
				ОтображатьМаркировкуТоваров = Ложь;
				Если РезультатОтвета.Данные.Свойство("ОтображатьМаркировкуТоваров") Тогда
					ОтображатьМаркировкуТоваров = РезультатОтвета.Данные.ОтображатьМаркировкуТоваров;
				КонецЕсли; 				
				
				Константы.ОтображатьМаркировкуТоваров.Установить(ОтображатьМаркировкуТоваров);	
				
				ЯчейкаДляМаркировки = "";
				Если РезультатОтвета.Данные.Свойство("ЯчейкаДляМаркировки") Тогда
					ЯчейкаДляМаркировки = РезультатОтвета.Данные.ЯчейкаДляМаркировки;
				КонецЕсли; 
				
				Константы.ЯчейкаДляМаркировки.Установить(ЯчейкаДляМаркировки);
				
				ЯчейкаДляПеремаркировки = "";
				Если РезультатОтвета.Данные.Свойство("ЯчейкаДляПеремаркировки") Тогда
					ЯчейкаДляПеремаркировки = РезультатОтвета.Данные.ЯчейкаДляПеремаркировки;
				КонецЕсли; 
				
				Константы.ЯчейкаДляПеремаркировки.Установить(ЯчейкаДляПеремаркировки);
				
				ЯчейкаДляВозврата = "";
				Если РезультатОтвета.Данные.Свойство("ЯчейкаДляВозврата") Тогда
					ЯчейкаДляВозврата = РезультатОтвета.Данные.ЯчейкаДляВозврата;
				КонецЕсли; 
				
				Константы.ЯчейкаДляВозврата.Установить(ЯчейкаДляВозврата);
				
				КодМДМГоловнойОрганизации = "";
				Если РезультатОтвета.Данные.Свойство("КодМДМГоловнойОрганизации") Тогда
					КодМДМГоловнойОрганизации = РезультатОтвета.Данные.КодМДМГоловнойОрганизации;
				КонецЕсли; 
				
				Константы.КодМДМГоловнойОрганизации.Установить(КодМДМГоловнойОрганизации);
				
				АдресСервераЧестныйЗнак = "";
				Если РезультатОтвета.Данные.Свойство("АдресСервераЧестныйЗнак") Тогда
					АдресСервераЧестныйЗнак = РезультатОтвета.Данные.АдресСервераЧестныйЗнак;
				КонецЕсли; 
				
				Константы.АдресСервераЧестныйЗнак.Установить(АдресСервераЧестныйЗнак);         

				ПроверятьСостояниеКодаВЧЗ = Ложь;    
				Если РезультатОтвета.Данные.Свойство("ПроверятьСостояниеКодаВЧЗ") Тогда
					ПроверятьСостояниеКодаВЧЗ = РезультатОтвета.Данные.ПроверятьСостояниеКодаВЧЗ;
				КонецЕсли;
				
				Константы.ПроверятьСостояниеКодаВЧЗ.Установить(ПроверятьСостояниеКодаВЧЗ);	
				
				ПроверятьСоответствиеКодаТоваруПоGTIN = Ложь;    
				Если РезультатОтвета.Данные.Свойство("ПроверятьСоответствиеКодаТоваруПоGTIN") Тогда
					ПроверятьСоответствиеКодаТоваруПоGTIN = РезультатОтвета.Данные.ПроверятьСоответствиеКодаТоваруПоGTIN;
				КонецЕсли;
				
				Константы.ПроверятьСоответствиеКодаТоваруПоGTIN.Установить(ПроверятьСоответствиеКодаТоваруПоGTIN);	 
				
				СверятьКодыСОжидаемымиПриПриемке = Ложь;    
				Если РезультатОтвета.Данные.Свойство("СверятьКодыСОжидаемымиПриПриемке") Тогда
					СверятьКодыСОжидаемымиПриПриемке = РезультатОтвета.Данные.СверятьКодыСОжидаемымиПриПриемке;
				КонецЕсли;
				
				Константы.СверятьКодыСОжидаемымиПриПриемке.Установить(СверятьКодыСОжидаемымиПриПриемке);	 
				
				РазрешитьПриниматьКМБезПроверкиСостояния = Ложь;    
				Если РезультатОтвета.Данные.Свойство("РазрешитьПриниматьКМБезПроверкиСостояния") Тогда
					РазрешитьПриниматьКМБезПроверкиСостояния = РезультатОтвета.Данные.РазрешитьПриниматьКМБезПроверкиСостояния;
				КонецЕсли;
				
				Константы.РазрешитьПриниматьКМБезПроверкиСостояния.Установить(РазрешитьПриниматьКМБезПроверкиСостояния);
				
				РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ = Ложь;    
				Если РезультатОтвета.Данные.Свойство("РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ") Тогда
					РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ = РезультатОтвета.Данные.РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ;
				КонецЕсли;
				
				Константы.РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ.Установить(РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ);
				
				//+Сёмин Р.И. 29.04.2026 #UT10-5814
				ИспользоватьНовыйМеханизмПроверкиКодовМаркировки = Ложь;
				Если РезультатОтвета.Данные.Свойство("ИспользоватьНовыйМеханизмПроверкиКодовМаркировки") Тогда
					ИспользоватьНовыйМеханизмПроверкиКодовМаркировки = РезультатОтвета.Данные.ИспользоватьНовыйМеханизмПроверкиКодовМаркировки;
				КонецЕсли;
				
				Константы.ИспользоватьНовыйМеханизмПроверкиКодовМаркировки.Установить(ИспользоватьНовыйМеханизмПроверкиКодовМаркировки);
				//-Сёмин Р.И. 29.04.2026 #UT10-5814
				
				//+Сёмин Р.И. 24.06.2026 #UT10-5915
				ПроверятьНарушенияСроковГодностиКИЗ = Ложь;
				Если РезультатОтвета.Данные.Свойство("ПроверятьНарушенияСроковГодностиКИЗ") Тогда
					ПроверятьНарушенияСроковГодностиКИЗ = РезультатОтвета.Данные.ПроверятьНарушенияСроковГодностиКИЗ;
				КонецЕсли;
				
				Константы.ПроверятьНарушенияСроковГодностиКИЗ.Установить(ПроверятьНарушенияСроковГодностиКИЗ);
				//-Сёмин Р.И. 24.06.2026 #UT10-5915

				Прервать;
				
			КонецЕсли;
			
		Исключение
					
			РезультатОтвета.Вставить("Ошибка", "Ошибка подключения к базе данных.");				
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "АвторизоватьПользователя");
			
		КонецПопытки;
		
	КонецЦикла; 	
	
	
	Возврат РезультатОтвета;
	
КонецФункции

Функция ПолучитьПользователя(Штрихкод, Пароль, Адрес) Экспорт
	
	//+Шульман А. 28.11.2025 #UT10-5548
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	
	Если Не ЗначениеЗаполнено(Штрихкод) И Не ЗначениеЗаполнено(Пароль) Тогда
		РезультатОтвета.Ошибка = "Сканируйте штрихкод сотрудника или введите пароль.";
		Возврат РезультатОтвета;
	КонецЕсли;
	

	Если Не ЗначениеЗаполнено(Адрес) Тогда
		РезультатОтвета.Ошибка = "Заполните адрес web-сервиса";
		Возврат РезультатОтвета;
	Иначе		
		Константы.Адрес.Установить(СокрЛП(Адрес));		
	КонецЕсли;

	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл
		
		Попытка
			
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );

			Ответ = WSПрокси.FindUser(Штрихкод, Пароль);	
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);
			
			Если НЕ ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				Прервать;
				
			КонецЕсли;
			
		Исключение
					
			РезультатОтвета.Вставить("Ошибка", "Ошибка подключения к базе данных.");				
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьПользователя");
			
		КонецПопытки;
		
	КонецЦикла; 	
	
	Возврат РезультатОтвета;
	//-Шульман А. 28.11.2025 #UT10-5548

КонецФункции // ()

&НаСервере
Функция ПолучитьОписаниеШапкиДляПеремещения(ЯчейкаОткудаГУИД, ЯчейкаКудаГУИД) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	UserIdGUID = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл	
		
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";				
			
			Ответ = WSПрокси.GetDescriptionForMoving(UserIdGUID, ЯчейкаОткудаГУИД, ЯчейкаКудаГУИД);		
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);
						
			Прервать;                                                            
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьСписокТоваровИзЯчейки");
			
		КонецПопытки;                              
		
	КонецЦикла;
	
	Возврат РезультатОтвета;
	
КонецФункции                                                 

&НаСервере
Функция ПолучитьСписокТоваровИзЯчейки( ЯчейкаГУИД, УдалятьТекущиеДанныеРС = Ложь) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	UserIdGUID = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл	
		
		Попытка
			
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";				
			
			Ответ = WSПрокси.GetListGoodsFromCell(UserIdGUID, ЯчейкаГУИД);		
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);
			Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				ЗаписатьРегистрСведений("СписокТоваровЯчейки", РезультатОтвета.Данные, УдалятьТекущиеДанныеРС);
			КонецЕсли; 
						
			Прервать;                                                            
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьСписокТоваровИзЯчейки");
			
		КонецПопытки;                              
		
	КонецЦикла;
	
	Возврат РезультатОтвета;
	
КонецФункции                                                 

&НаСервере
Функция СоздатьДокументПеремещенияМеждуЯчейкам( ЯчейкаОткудаGUID,  ЯчейкаКудаGUID ) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	UserIdGUID = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл	
		
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";				
			
			Ответ = WSПрокси.CreateDocumentMoveGood(UserIdGUID, ЯчейкаОткудаGUID, ЯчейкаКудаGUID);		
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);
			
			Прервать;                                                            
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "СоздатьДокуметРазмещенияПоЯчейкам");
			
		КонецПопытки;                              
		
	КонецЦикла;
	
	Возврат РезультатОтвета;
	
КонецФункции                                                 

&НаСервере
Функция ОбработатьОтсканированноеГрузовоеМесто( ЗаданиеНаДоставкуГУИД, ГрузовоеМестоГУИД ) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	UserIdGUID = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл	
		
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";				
			
			Ответ = WSПрокси.ProcessingCargoPlace(ЗаданиеНаДоставкуГУИД, ГрузовоеМестоГУИД, UserIdGUID);		
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);
			
			Прервать;                                                            
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ОбработатьОтсканированноеГрузовоеМесто");
			
		КонецПопытки;                              
		
	КонецЦикла;
	
	Возврат РезультатОтвета;
	
КонецФункции                                                 

&НаСервере
Функция ОбработатьОтсканированноеГрузовоеМестоИзРазгрузкаАвто(ЗаданиеНаДоставкуГУИД, РазгрузкаАвтоГУИД, ГрузовоеМестоГУИД ) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	UserIdGUID = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл	
		
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";				
			
			Ответ = WSПрокси.ProcessingCargoPlaceFromUnloadAuto(ЗаданиеНаДоставкуГУИД, РазгрузкаАвтоГУИД, ГрузовоеМестоГУИД, UserIdGUID, ТекущаяДата());		
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);
			
			Прервать;                                                            
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ОбработатьОтсканированноеГрузовоеМестоИзРазгрузкиАвто");
			
		КонецПопытки;                              
		
	КонецЦикла;
	
	Возврат РезультатОтвета;
		
КонецФункции

&НаСервере
Функция ОбработатьОтсканированноеГрузовоеМестоИзРазгрузкаАвтоДляПостановкиНаМаршрут(ЗаданиеНаДоставкуГУИД, РазгрузкаАвтоГУИД, ГрузовоеМестоГУИД ) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	UserIdGUID = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл	
		
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";				
			
			Ответ = WSПрокси.ProcessingCargoPlaceFromUnloadAutoForSetRoute(ЗаданиеНаДоставкуГУИД, РазгрузкаАвтоГУИД, ГрузовоеМестоГУИД, UserIdGUID, ТекущаяДата());		
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);
			
			Прервать;                                                            
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ОбработатьОтсканированноеГрузовоеМестоИзРазгрузкаАвтоДляПостановкиНаМаршрут");
			
		КонецПопытки;                              
		
	КонецЦикла;
	
	Возврат РезультатОтвета;
	
КонецФункции

&НаСервере
Функция ОбработатьОтсканированноеГрузовоеМестоСлужебнойЗаписки(СлужебнаяЗапискаГУИД , ГрузовоеМестоШтрихКод) Экспорт 

	ЗаписьРегистра                        = РегистрыСведений.СписокГрузовыхМестСлужебныеЗаписки.Получить(Новый Структура("ШтрихкодГрузовогоМеста,СсылкаСлужебнаяЗаписка",ГрузовоеМестоШтрихКод,СлужебнаяЗапискаГУИД)); 
	
	МенеджерЗаписи                        = РегистрыСведений.СписокГрузовыхМестСлужебныеЗаписки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ДатаЗагрузки           = ЗаписьРегистра.ДатаЗагрузки;
	МенеджерЗаписи.СсылкаСлужебнаяЗаписка = СлужебнаяЗапискаГУИД;
	МенеджерЗаписи.ШтрихкодГрузовогоМеста = ГрузовоеМестоШтрихКод;
	МенеджерЗаписи.Погружено              = Истина;
	МенеджерЗаписи.Записать(Истина);
	
КонецФункции 

&НаСервере
Функция ОбработатьПроведениеДокументаПТУ(СсылкаПТУ , ДатаПриходаТранзит , КоличествоМестТранзит) Экспорт

	РезультатОтвета = ПолучитьСтруктуруОтвета();
	UserIdGUID = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл	
		
		Попытка
			
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			
			Ответ = WSПрокси.ProcessingUnverifiedPTUTransit(СсылкаПТУ , UserIdGUID , ДатаПриходаТранзит , КоличествоМестТранзит);

			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);
			
			Прервать;                                                            
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ОбработатьПроведениеДокументаПТУ");
			
		КонецПопытки;                              
		
	КонецЦикла;
	
	Возврат РезультатОтвета;

КонецФункции  

&НаСервере
Функция ПолучитьСписокЯчеекДляПеремещения() Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	UserIdGUID = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл	
		
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";				
			
			Ответ = WSПрокси.GetListMovesForCreateDocument(UserIdGUID);		
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьСписокЯчеекДляПеремещения");
			
		КонецПопытки;                              
		
	КонецЦикла;
	
	Возврат РезультатОтвета;
	
КонецФункции

&НаСервере
Функция СоздатьДокуметРазмещенияПоЯчейкам(ДокументГУИД, ГМ = Ложь) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	ТипОперации = "ПриемкаТовара";
	UserIdGUID = ОбщегоНазначения.ПолучитьПользователяГУИД();
	DeleteRecordsFromBuffer = ОбщегоНазначения.УдалятьЗаписиИзБуферов();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл	
		
		Попытка
			
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			
			Если ГМ Тогда
				Ответ = WSПрокси.CreateDocumentGM(ДокументГУИД, UserIdGUID, ТипОперации, DeleteRecordsFromBuffer);		
			Иначе
				Ответ = WSПрокси.CreateDocument(ДокументГУИД, UserIdGUID, ТипОперации, DeleteRecordsFromBuffer);		
			КонецЕсли;
			
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "СоздатьДокуметРазмещенияПоЯчейкам");
			
		КонецПопытки;                              
		
	КонецЦикла;
	
	Возврат РезультатОтвета;
	
КонецФункции

&НаСервере
Функция ЗаписатьМаркировкиВДокументПТУ(ДокументГУИД) Экспорт

	РезультатОтвета = ПолучитьСтруктуруОтвета();
	UserIdGUID = ОбщегоНазначения.ПолучитьПользователяГУИД();
	DeleteRecordsFromBuffer = ОбщегоНазначения.УдалятьЗаписиИзБуферов();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл	
		
		Попытка
			
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			
			Ответ = WSПрокси.WriteMarksFromPTU(ДокументГУИД , UserIdGUID , DeleteRecordsFromBuffer);		
			
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета , Ответ);
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ЗаписатьМаркировкиВДокументПТУ");
			
		КонецПопытки;                              
		
	КонецЦикла;
	
	Возврат РезультатОтвета;

КонецФункции

Функция ЗаписатьВБуферАРМКладовщикаДляСозданияМаркировки(ДокументГУИД, тзОстатокМаркировка) Экспорт
	
	//+Шульман А. 02.10.2025 #UT10-5438     
	ГУИДПользователя = ОбщегоНазначения.ПолучитьПользователяГУИД();  
	ТекДата = ТекущаяДата();  
	ЯчейкаДляМаркировки = Константы.ЯчейкаДляМаркировки.Получить();  
	РежимВвода = ОбщегоНазначения.УстановленРежимВводаРучной();
	
	Для каждого тзСтрока Из тзОстатокМаркировка Цикл
		
		мТоварГУИД = тзСтрока.СсылкаТовара;      
		мКоличество = тзСтрока.Количество;   
		мШтрихкод = "";
		РезультатСтруктура = ОбщегоНазначения.ДобавитьТоварВБуферАРМКладовщика(ДокументГУИД, мТоварГУИД, ГУИДПользователя, 
				ТекДата, мШтрихкод, мКоличество, ЯчейкаДляМаркировки, РежимВвода);			
		
		Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
			Возврат РезультатСтруктура;
			
		ИначеЕсли РезультатСтруктура.Данные = Ложь Тогда 
			
			РезультатСтруктура.Вставить("Ошибка", "Ошибка записи в буфер кладовщика для создания кода маркировки");
			Возврат РезультатСтруктура;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Возврат Новый Структура("Ошибка", "");
	//-Шульман А. 02.10.2025 #UT10-5438 	

КонецФункции // ()

&НаСервере
Функция ПолучитьОстатокТовара(ТоварГУИД) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета(); 
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл			
		
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";              
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.GetRemainderGood(ТоварГУИД, ПользовательГУИД);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);				
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьОстатокТовара");
			
		КонецПопытки; 
		
	КонецЦикла;
	
	Возврат РезультатОтвета;
	
КонецФункции

&НаСервере
Функция ПолучитьОстаткиТовара(Штрихкод, ТоварГУИД) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета(); 
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл			
		
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";              
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.GetRemaindersGoodFromCells(Штрихкод, ТоварГУИД, ПользовательГУИД);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);				
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьОстатокТовара");
			
		КонецПопытки; 
		
	КонецЦикла;
	
	Возврат РезультатОтвета;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокТоваровИзБуфераРазмещения( ДокументГУИД, ЗаписатьДанныеВРегистрСведений = Истина ) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();	
	UserIdGUID = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл	
			
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			
			Ответ = WSПрокси.GetListsRecorfdsFromBufferPlacing(UserIdGUID, ДокументГУИД);		
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);			
			Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				
				Если ЗаписатьДанныеВРегистрСведений = Истина Тогда
					ЗаписатьРегистрСведений("СписокТоваровВБуфереРазмещение", РезультатОтвета.Данные);					
				КонецЕсли; 
				
			КонецЕсли; 
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьОстатокПоВсемТоварамИзДокумента");
			
		КонецПопытки;                              
		
	КонецЦикла;
		
	Возврат РезультатОтвета;
	
КонецФункции  

&НаСервере
Функция ПолучитьСписокГМИзБуфераРазмещения( ДокументГУИД, ЗаписатьДанныеВРегистрСведений = Истина ) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();	
	UserIdGUID = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл	
			
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.GetListsRecorfdsFromBufferPlacingGM(UserIdGUID, ДокументГУИД);		
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);			
			Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				
				Если ЗаписатьДанныеВРегистрСведений = Истина Тогда
					ЗаписатьРегистрСведений("СписокТоваровВБуфереРазмещениеГМ", РезультатОтвета.Данные);					
				КонецЕсли; 
				
			КонецЕсли; 
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьОстатокПоВсемТоварамИзДокумента");
			
		КонецПопытки;                              
		
	КонецЦикла;
		
	Возврат РезультатОтвета;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокТоваровИзБуфераПеремещения( ЯчейкаОткудаГУИД, ЯчейкаКудаГУИД, ЗаписатьДанныеВРегистрСведений = Истина ) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();	
	UserIdGUID = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл	
			
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.GetListsRecorfdsFromBufferMoving(UserIdGUID, ЯчейкаОткудаГУИД, ЯчейкаКудаГУИД);		
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);			
			Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				
				Если ЗаписатьДанныеВРегистрСведений = Истина Тогда
					ЗаписатьРегистрСведений("СписокТоваровВБуфереПеремещения", РезультатОтвета.Данные);					
				КонецЕсли; 
				
			КонецЕсли; 
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьОстатокПоВсемТоварамИзДокумента");
			
		КонецПопытки;                              
		
	КонецЦикла;
		
	Возврат РезультатОтвета;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокТоваровИзБуфераМаркировок( ДокументГУИД, ЗаписатьДанныеВРегистрСведений = Истина ) Экспорт

	РезультатОтвета = ПолучитьСтруктуруОтвета();	
	UserIdGUID = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл	
			
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			
			Ответ = WSПрокси.GetListsRecorfdsFromBufferMarking(UserIdGUID, ДокументГУИД);		
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);			
			Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				
				Если ЗаписатьДанныеВРегистрСведений = Истина Тогда
					ЗаписатьРегистрСведений("СписокТоваровВБуфереМаркировок", РезультатОтвета.Данные);					
				КонецЕсли; 
				
			КонецЕсли; 
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьСписокТоваровИзБуфераМаркировок");
			
		КонецПопытки;                              
		
	КонецЦикла;
		
	Возврат РезультатОтвета;

КонецФункции

&НаСервере
Функция ПолучитьОстатокПоВсемТоварамИзДокумента( ДокументГУИД ) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();	
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
		
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл	
			
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.GetRemainderForAllGoodsFromDocument(ДокументГУИД, ПользовательГУИД);		
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);			
			Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				ЗаписатьРегистрСведений("СписокТоваровДокументаПТУ", РезультатОтвета.Данные);
			КонецЕсли; 
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьОстатокПоВсемТоварамИзДокумента");
			
		КонецПопытки;                              
		
	КонецЦикла;
		
	Возврат РезультатОтвета;
	
КонецФункции 

&НаСервере
Функция ПолучитьОстатокПоВсемГМИзДокумента( ДокументГУИД ) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();	
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
		
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл	
			
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.GetRemainderForAllGMFromDocument(ДокументГУИД, ПользовательГУИД);		
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);			
			Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				ЗаписатьРегистрСведений("СписокГМДокументаПТУ", РезультатОтвета.Данные);
			КонецЕсли; 
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьОстатокПоВсемТоварамИзДокумента");
			
		КонецПопытки;                              
		
	КонецЦикла;
		
	Возврат РезультатОтвета;
	
КонецФункции

&НаСервере
Функция ПолучитьОстатокПоТоваруВЯчейке(ЯчейкаГУИД, Штрихкод, ТоварГУИД) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();	
	UserIdGUID = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл	
				
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		

			Ответ = WSПрокси.GetRemainderGoodFromCell(UserIdGUID, ЯчейкаГУИД, Штрихкод, ТоварГУИД);			
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьОстатокПоТоваруИзДокумента");
			
		КонецПопытки; 
		
	КонецЦикла;
	
	Возврат РезультатОтвета;                                
	
КонецФункции                                                                                

&НаСервере
Функция ПолучитьНабранноеКоличествоТовараИзИнвентаризируемойЯчейки(ДокументГУИД, ЯчейкаГУИД, Штрихкод, ТоварГУИД) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();	
	UserIdGUID = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл	
				
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";	

			Ответ = WSПрокси.GetCollectAmountGoodFromCellInventory(UserIdGUID, ДокументГУИД, ЯчейкаГУИД, Штрихкод, ТоварГУИД);			
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьНабранноеКоличествоТовараИзИнвентаризируемойЯчейки");
			
		КонецПопытки; 
		
	КонецЦикла;
	
	Возврат РезультатОтвета;                                
	
КонецФункции


&НаСервере
Функция ПолучитьОстатокПоТоваруИзДокумента(ДокументГУИД, Штрихкод, ТоварГУИД) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл	
				
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.GetRemainderForGoodFromDocument(ПользовательГУИД, ДокументГУИД, Штрихкод, ТоварГУИД);		
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьОстатокПоТоваруИзДокумента");
			
		КонецПопытки; 
		
	КонецЦикла;
	
	Возврат РезультатОтвета;                                
	
КонецФункции                                                                                
 
&НаСервере
Функция ПрисвоитьШтрихкодТовару(Штрихкод, ГУИДТовара) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
		
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.AddBarcodeForGood(Штрихкод, ГУИДТовара, ПользовательГУИД);		
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
			
			Прервать;
			
		Исключение		
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПрисвоитьШтрихкодТовару");
			
		КонецПопытки; 
		
	КонецЦикла;		
		
	Возврат РезультатОтвета;	
	
КонецФункции

Процедура ДобавитьРесурсСписокТоваровДокументаПТУ(ДокументГУИД, ТоварГУИД, ИмяРесурса, Количество) Экспорт
	
	//+Шульман А. 13.11.2025 #UT10-5504
	Запись = РегистрыСведений.СписокТоваровДокументаПТУ.СоздатьМенеджерЗаписи();
	Запись.СсылкаПТУ = ДокументГУИД;
	Запись.СсылкаТовара = ТоварГУИД;
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		
		Запись[ИмяРесурса] = Запись[ИмяРесурса] + Количество;
		Запись.Записать();
	
	КонецЕсли;
	//-Шульман А. 13.11.2025 #UT10-5504

КонецПроцедуры

&НаСервере
Процедура УстановитьВерсиюСервисаСервера() Экспорт
	
	Версия = 0;
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
			
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			Версия = WSПрокси.GetVesionWebService();			
			Прервать;
		Исключение
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;		
		
	КонецЦикла;
	
	Попытка		
		Если Версия > 0 Тогда	
			Константы.Версия.Установить(Версия);
		КонецЕсли;		
	Исключение
	КонецПопытки;
	
КонецПроцедуры    

&НаСервере
Функция ПолучитьЯчейку(Ячейка) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
			
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.GetCell(Ячейка, ПользовательГУИД);		
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьЯчейку");			
			
		КонецПопытки; 
		
	КонецЦикла;
	
	Возврат РезультатОтвета;
	
КонецФункции


&НаСервере 
Функция ПолучитьОстаткиПоМаркировкам(ДокументГУИД , ИнформацияОТоваре) Экспорт

	СтруктураВозврата = Новый Структура;
	РезультатСтруктура = ОбщегоНазначения.ПолучитьОстатокПоВсемТоварамИзДокумента(ДокументГУИД);
	
	ЗапросОстатковПоМаркировкам = Новый Запрос;
	ЗапросОстатковПоМаркировкам.Текст =
	"ВЫБРАТЬ
	|	СписокТоваровДокументаПТУ.КоличествоВБуфереМаркировок КАК КоличествоВБуфереМаркировок,
	|	СписокТоваровДокументаПТУ.КоличествоОжидаемыхМаркировок КАК КоличествоОжидаемыхМаркировок,
	|	СписокТоваровДокументаПТУ.КоличествоОтсканированныхМаркировок КАК КоличествоОтсканированныхМаркировок,
	|	СписокТоваровДокументаПТУ.КоличествоТоваровСМаркировкой КАК КоличествоТоваровСМаркировкой
	|ИЗ
	|	РегистрСведений.СписокТоваровДокументаПТУ КАК СписокТоваровДокументаПТУ
	|ГДЕ
	|	СписокТоваровДокументаПТУ.СсылкаПТУ = &ДокументГУИД
	|	И СписокТоваровДокументаПТУ.СсылкаТовара = &СсылкаТовара";
	
	ЗапросОстатковПоМаркировкам.УстановитьПараметр("ДокументГУИД",ДокументГУИД);
	ЗапросОстатковПоМаркировкам.УстановитьПараметр("СсылкаТовара",ИнформацияОТоваре.Владелец);
	
	РезультатЗапроса = ЗапросОстатковПоМаркировкам.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		ВыборкаЗапроса.Следующий();
		
		СтруктураВозврата.Вставить("КоличествоВБуфереМаркировок"         , ВыборкаЗапроса.КоличествоВБуфереМаркировок);
		СтруктураВозврата.Вставить("КоличествоОжидаемыхМаркировок"       , ВыборкаЗапроса.КоличествоОжидаемыхМаркировок);
		СтруктураВозврата.Вставить("КоличествоОтсканированныхМаркировок" , ВыборкаЗапроса.КоличествоОтсканированныхМаркировок);
		СтруктураВозврата.Вставить("КоличествоТоваровСМаркировкой"       , ВыборкаЗапроса.КоличествоТоваровСМаркировкой);
		
	КонецЕсли;

	Возврат СтруктураВозврата;

КонецФункции

&НаСервере
Функция ЗагрузитьСписокТовараДокументаПТУ(СсылкаТовара) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета(); 
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
			
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.GetListGoodsFromPTU(СсылкаТовара, ПользовательГУИД);		
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);				
			Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				ЗаписатьРегистрСведений("СписокТоваровДокументаПТУ", РезультатОтвета.Данные);
			КонецЕсли; 
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ЗагрузитьСписокТовараДокументаПТУ");			
						
		КонецПопытки; 
		
	КонецЦикла;
	
	Возврат РезультатОтвета;
	
КонецФункции

&НаСервере
Функция ЗагрузитьСписокЗаданийНаДоставку() Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
	
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";	
			
			Ответ = WSПрокси.GetListDeliveryOrders(ПользовательГУИД);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
			
			Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				ЗаписатьРегистрСведений("СписокЗаданийНаДоставку", РезультатОтвета.Данные);
			КонецЕсли; 
			
			Прервать;
			
		Исключение
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ЗагрузитьСписокДокументовЗаданийНаДоставку");			
		КонецПопытки; 
		
	КонецЦикла;
		                                                       
	Возврат РезультатОтвета;
	
КонецФункции

&НаСервере
Функция ЗагрузитьСписокЗаданийНаДоставкуДляРазгрузкиАвто() Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
	
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.GetListDeliveryOrdersFromUnloadAuto(ПользовательГУИД);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
			
			Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				ЗаписатьРегистрСведений("СписокЗаданийНаДоставку", РезультатОтвета.Данные);
			КонецЕсли; 
			
			Прервать;
			
		Исключение
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ЗагрузитьСписокДокументовЗаданийНаДоставку_РазгрАвто");			
		КонецПопытки; 
		
	КонецЦикла;
		                                                       
	Возврат РезультатОтвета;
		
КонецФункции

&НаСервере
Функция ЗагрузитьСписокМаршрутовИзРазгрузкаАвто() Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
	
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.GetListRouteFromUnloadAutoForSetRoute(ПользовательГУИД);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
						
			Прервать;
			
		Исключение
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "СписокМаршрутовДляПриемкиГрузовыхМест");			
		КонецПопытки; 
		
	КонецЦикла;
	
	Попытка		
		Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
			ЗаписатьРегистрСведений("СписокМаршрутовДляПриемкиГрузовыхМест", РезультатОтвета.Данные);
		КонецЕсли; 		
	Исключение
		РезультатОтвета.Вставить("Ошибка", "Ошибка обработки полученных данных.");
		ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "СписокМаршрутовДляПриемкиГрузовыхМест");			
	КонецПопытки; 

	Возврат РезультатОтвета;
	
КонецФункции
 
&НаСервере
Функция ЗагрузитьСписокСборокПоЯчейке(ЯчейкаГУИД) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
	
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		            
			
			Ответ = WSПрокси.GetListOrderPickingForLockCell(ЯчейкаГУИД, ПользовательГУИД);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
						
			Прервать;
			
		Исключение
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ЗагрузитьСписокСборокПоЯчейке");						
		КонецПопытки; 
		
	КонецЦикла;
	
	Попытка		
		Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
			ЗаписатьРегистрСведений("СписокСборокДляЗаблокированнойЯчейки", РезультатОтвета.Данные);
		КонецЕсли; 		
	Исключение
		РезультатОтвета.Вставить("Ошибка", "Ошибка обработки полученных данных.");
		ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ЗагрузитьСписокСборокПоЯчейке");			
	КонецПопытки; 

	Возврат РезультатОтвета;
	
КонецФункции

&НаСервере
Функция УстановитьБлокировкуНаМаршрутИзРазгрузкаАвто(ЗаданиеНаДоставкуГУИД, РазгрузкаАвтоГУИД) Экспорт 
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
	
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.SetLockOnRouteForUnloadAuto(ЗаданиеНаДоставкуГУИД, РазгрузкаАвтоГУИД, ПользовательГУИД);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
						
			Прервать;
			
		Исключение
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "УстановитьБлокировкуНаМаршрутИзРазгрузкаАвто");			
		КонецПопытки; 
		
	КонецЦикла;
	
	Возврат РезультатОтвета;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокГрузовыхМест(ЗаданиеНаДоставкуГУИД, ПолучитьВсеЗаписи = Ложь) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
	
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.GetListCargoPlaces(ЗаданиеНаДоставкуГУИД, ПолучитьВсеЗаписи, ПользовательГУИД);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
			
			Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				Если Не ПолучитьВсеЗаписи Тогда
					ЗаписатьРегистрСведений("СписокГрузовыхМест", РезультатОтвета.Данные);
				Иначе 
					ЗаписатьРегистрСведений("ВсеГрузовыеМеста", РезультатОтвета.Данные);
				КонецЕсли; 
				
			КонецЕсли;                     
			
			Прервать;
			
		Исключение
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ЗагрузитьСписокГрузовыхМест");			
		КонецПопытки; 
		
	КонецЦикла;
		                                                       
	Возврат РезультатОтвета;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокМаркировокПоПТУ(ДокументГУИД) Экспорт

	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
		
		Попытка
			
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			
			Ответ = WSПрокси.GetMarksListFromPTU(ДокументГУИД , ПользовательГУИД);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
			
			ОбщегоНазначения.ОчиститьРегистрСведений("СписокОжидаемыхМаркировокДокументаПТУ");
			ОбщегоНазначения.ОчиститьРегистрСведений("СписокОтсканированныхМаркировокДокументаПТУ");
			ОбщегоНазначения.ОчиститьРегистрСведений("СписокТоваровВБуфереМаркировок");
			
			Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				
				Если РезультатОтвета.Данные.Свойство("СписокОжидаемыхМаркировокДокументаПТУ") Тогда
					
					Если НЕ РезультатОтвета.Данные.СписокОжидаемыхМаркировокДокументаПТУ = Неопределено Тогда
						ЗаписатьРегистрСведений("СписокОжидаемыхМаркировокДокументаПТУ", РезультатОтвета.Данные.СписокОжидаемыхМаркировокДокументаПТУ); 
					КонецЕсли;
					
				КонецЕсли;                     
				
				Если РезультатОтвета.Данные.Свойство("СписокОтсканированныхМаркировокДокументаПТУ") Тогда
					
					Если НЕ РезультатОтвета.Данные.СписокОтсканированныхМаркировокДокументаПТУ = Неопределено Тогда
						ЗаписатьРегистрСведений("СписокОтсканированныхМаркировокДокументаПТУ", РезультатОтвета.Данные.СписокОтсканированныхМаркировокДокументаПТУ); 
					КонецЕсли;
					
				КонецЕсли; 
				
				Если РезультатОтвета.Данные.Свойство("СписокТоваровВБуфереМаркировок") Тогда
					
					Если НЕ РезультатОтвета.Данные.СписокТоваровВБуфереМаркировок = Неопределено Тогда
						ЗаписатьРегистрСведений("СписокТоваровВБуфереМаркировок", РезультатОтвета.Данные.СписокТоваровВБуфереМаркировок); 
					КонецЕсли;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ЗагрузитьСписокГрузовыхМест");	
			
		КонецПопытки; 
		
	КонецЦикла;
	
	Возврат РезультатОтвета;

КонецФункции

&НаСервере
Функция ПолучитьИнформациюОПользователе(Password) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
	
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.GetInfoOnUserId(ПользовательГУИД, Password);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
			
			Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				ЗаписатьРегистрСведений("ФизическоеЛицо", РезультатОтвета.Данные);
			КонецЕсли; 
			
			Прервать;
			
		Исключение
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ЗагрузитьСписокДокументовЗаданийНаДоставку_РазгрАвто");			
		КонецПопытки; 
		
	КонецЦикла;
		                                                       
	Возврат РезультатОтвета;
	
КонецФункции
 
&НаСервере
Функция ЭтоШтрихкодКладовщика(Штрихкод) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1                                                                    
	|	ФизическоеЛицо.ФизическоеЛицоГУИД КАК ФизическоеЛицоГУИД,
	|	ФизическоеЛицо.Код КАК Код,
	|	ФизическоеЛицо.Наименование КАК Наименование,
	|	ФизическоеЛицо.АРМКладовщика КАК АРМКладовщика,
	|	ФизическоеЛицо.Должность КАК Должность
	|ИЗ
	|	РегистрСведений.ФизическоеЛицо КАК ФизическоеЛицо
	|ГДЕ
	|	ФизическоеЛицо.Код ПОДОБНО &Код";
	
	ЗначенияДляПоиска = Формат(Число(Штрихкод), "ЧЦ=5; ЧВН=; ЧГ=0");
	
	Запрос.УстановитьПараметр("Код", "%" + ЗначенияДляПоиска);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	РезультатЗапроса.Следующий();
	
	Результат = СтрНайти(ВРег(РезультатЗапроса.Должность), ВРег("Кладовщик")) > 0 Или СтрНайти(ВРег(РезультатЗапроса.Должность), ВРег("Начальник")) > 0;

	Возврат Результат;
	
КонецФункции
 
&НаСервере
Функция ЗавершитьРазгрузкуГрузовыхМестИзРазгрузкаАвто(ЗаданиеНаДоставкуГУИД, КладовщикГУИД) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
	
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.FinishUnloadingCargoPlaces(ЗаданиеНаДоставкуГУИД, ПользовательГУИД, КладовщикГУИД);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);								
			Прервать;
			
		Исключение
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ЗавершитьРазгрузкуГрузовыхМестИзРазгрузкаАвто");			
		КонецПопытки; 
		
	КонецЦикла;
		                                                       
	Возврат РезультатОтвета;
	
КонецФункции
 
&НаСервере
Функция ЗавершитьРазгрузкуГрузовыхМестИзРазгрузкаАвтоДляПостановкиНаМаршрут(ЗаданиеНаДоставкуГУИД) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
	
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.FinishSetOnRouteCargoPlaces(ЗаданиеНаДоставкуГУИД, ПользовательГУИД);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);								
			Прервать;
			
		Исключение
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ЗавершитьРазгрузкуГрузовыхМестИзРазгрузкаАвтоДляПостановкиНаМаршрут");			
		КонецПопытки; 
		
	КонецЦикла;
		                                                       
	Возврат РезультатОтвета;	
	
КонецФункции
 
&НаСервере
Функция ПолучитьСписокГрузовыхМестИзРазгрузкаАвто(РазгрузкаАвтоГУИД) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
	
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.GetListCargoPlacesFromUnloadAuto(РазгрузкаАвтоГУИД, ПользовательГУИД);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
			                                                                        
			Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				ЗаписатьРегистрСведений("СписокГрузовыхМестИзРазгрузкиАвто", РезультатОтвета.Данные);
			КонецЕсли;                     
			
			Прервать;
			
		Исключение
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ЗагрузитьСписокГрузовыхМестИзРазгрузкаАвто");			
		КонецПопытки; 
		
	КонецЦикла;
		                                                       
	Возврат РезультатОтвета;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокГрузовыхМестИзРазгрузкаАвтоДляПостановкиНаМаршрут(РазгрузкаАвтоГУИД) Экспорт 
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
	
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.GetListCargoPlacesFromUnloadAutoForSetRoute(РазгрузкаАвтоГУИД, ПользовательГУИД);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
			                                                                        
			Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				ЗаписатьРегистрСведений("СписокГрузовыхМестИзРазгрузкиАвтоДляПостановкиНаМаршрут", РезультатОтвета.Данные);
			КонецЕсли;                     
			
			Прервать;
			
		Исключение
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьСписокГрузовыхМестИзРазгрузкаАвтоДляПостановкиНаМаршрут");			
		КонецПопытки; 
		
	КонецЦикла;
		                                                       
	Возврат РезультатОтвета;
	
	
КонецФункции
 
 
#Область ЗаданияНаИнвентаризацию

&НаСервере
Функция ЗагрузитьЗаданияНаИнвентаризцию() Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
	
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.GetInventoryForJobs(ПользовательГУИД);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
			                          
			Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				ЗаписатьРегистрСведений("СписокЗаданийНаИнвентаризацию", РезультатОтвета.Данные);
			КонецЕсли; 
			
			Прервать;
			
		Исключение
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ЗагрузитьЗаданияНаИнвентаризцию");			
		КонецПопытки; 
		
	КонецЦикла;
		                                                       
	Возврат РезультатОтвета;
	
КонецФункции
 
&НаСервере
Функция ПроверитьЯчейкиДляБлокировкиПриИнвентаризации(ДокументГУИД, Ячейки) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	СписокОбъектов = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/core", "Array"));
	Для каждого Ячейка Из Ячейки Цикл
		Тип = СериализаторXDTO.XMLТипЗнч(Ячейка.СсылкаЯчейки);
        Значение = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(Тип.URIПространстваИмен, Тип.ИмяТипа),XMLСтрока(Ячейка.СсылкаЯчейки));
        СписокОбъектов.value.Добавить(Значение);
	КонецЦикла; 

	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
	
		Попытка                                          
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.CheckCellsForLockDuringInventory(ДокументГУИД, СписокОбъектов, ПользовательГУИД);
			
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
			ЗаписатьРегистрСведений("ПроверкаЯчеекДляИнвентаризации", РезультатОтвета.Данные);
						
			Прервать;
			
		Исключение
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПроверитьЯчейкиДляБлокировкиПриИнвентаризации");			
		КонецПопытки; 
		
	КонецЦикла;                          
		                                                       
	Возврат РезультатОтвета;
	
КонецФункции


&НаСервере
Функция ДобавитьТоварВБуферИнвентаризацииПоЯчейкам(ОбъектГУИД, ТоварГУИД, ПользовательГУИД, ДатаСоздания, Штрихкод, Количество, ЯчейкаГУИД, ВведеноВРучную = Ложь) Экспорт

	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл			
	
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";              
			//WSПрокси.Пароль = "web";		
									 
			Ответ = WSПрокси.AddBufferInventoryARMStoreKeeper(ОбъектГУИД, ТоварГУИД, ПользовательГУИД, ДатаСоздания, Штрихкод, Количество, ЯчейкаГУИД, ВведеноВРучную);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);				
			
			Прервать;
			
		Исключение	
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");               		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ДобавитьТоварВБуферИнвентаризацииПоЯчейкам");
			
		КонецПопытки; 
		
	КонецЦикла;	
	
	Возврат РезультатОтвета;	
	
КонецФункции

&НаСервере
Функция ПроверитьЯчейкиДляВозможностиИхРазблокировки(Ячейки, ДокументГУИД) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	СписокОбъектов = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/core", "Array"));
	Для каждого Ячейка Из Ячейки Цикл
		Тип = СериализаторXDTO.XMLТипЗнч(Ячейка.СсылкаЯчейки);
        Значение = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(Тип.URIПространстваИмен, Тип.ИмяТипа),XMLСтрока(Ячейка.СсылкаЯчейки));
        СписокОбъектов.value.Добавить(Значение);
	КонецЦикла; 

	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
	
		Попытка                                          
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.CheckCanUnlockCellsFromJobInventory(ПользовательГУИД, ДокументГУИД, СписокОбъектов );			
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
					
			Прервать;
			
		Исключение
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПровверитьЯчейкиДляВозможностиИхРазблокировки");			
		КонецПопытки; 
		
	КонецЦикла;                          
		                                                       
	Возврат РезультатОтвета;
	
КонецФункции
 

&НаСервере
Функция УстановитьБлокировкуНаЯчейки(ДокументГУИД, Ячейки, SetLock) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	СписокОбъектов = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/core", "Array"));
	Для каждого Ячейка Из Ячейки Цикл
		Тип = СериализаторXDTO.XMLТипЗнч(Ячейка.СсылкаЯчейки);
        Значение = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(Тип.URIПространстваИмен, Тип.ИмяТипа),XMLСтрока(Ячейка.СсылкаЯчейки));
        СписокОбъектов.value.Добавить(Значение);
	КонецЦикла; 

	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
	
		Попытка                                          
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси. SetLockCellsForInventory(ДокументГУИД, СписокОбъектов, SetLock, ПользовательГУИД);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
					
			Прервать;
			
		Исключение
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "УстановитьБлокировкуНаЯчейки");			
		КонецПопытки; 
		
	КонецЦикла;                          
		                                                       
	Возврат РезультатОтвета;
	

КонецФункции


&НаСервере
Функция ВыгрузитьДанныеИзРСвЗаданиеНаИнвентаризацию(ДокументГУИД, Ячейки) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	DeleteRecordsFromBuffer = ОбщегоНазначения.УдалятьЗаписиИзБуферов();
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	СписокОбъектов = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/core", "Array"));
	Для каждого Ячейка Из Ячейки Цикл
		Тип = СериализаторXDTO.XMLТипЗнч(Ячейка.СсылкаЯчейки);
        Значение = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(Тип.URIПространстваИмен, Тип.ИмяТипа),XMLСтрока(Ячейка.СсылкаЯчейки));
        СписокОбъектов.value.Добавить(Значение);
	КонецЦикла; 

	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
	
		Попытка                                          

			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.ImportDataToJobInventory(ПользовательГУИД, ДокументГУИД, СписокОбъектов, DeleteRecordsFromBuffer );
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
					
			Прервать;
			
		Исключение
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ВыгрузитьДанныеИзРСвЗаданиеНаИнвентаризацию");			
		КонецПопытки; 
		
	КонецЦикла;                          
		                                                       
	Возврат РезультатОтвета;
	

КонецФункции


&НаСервере
Функция ПолучитьСписокЗаписейИзБуфераИнвентаризации(ОбъектГУИД, ЯчейкаГУИД ) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
	
		Попытка                                          
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси. GetListGoodsFromBufferInventory(ПользовательГУИД, ОбъектГУИД, ЯчейкаГУИД);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
			
			Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				ЗаписатьРегистрСведений("СписокТоваровВБуфереИнвентаризации", РезультатОтвета.Данные);
			КонецЕсли; 
								                             
			Прервать;
			
		Исключение
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьСписокЗаписейИзБуфераИнвентаризации");			
		КонецПопытки; 
		
	КонецЦикла;                          
		                                                       
	Возврат РезультатОтвета;
	
КонецФункции
 

// StatusId это перечисление "СтатусЯчейкиИзЗаданияНаИнвентаризацию" в УТ10 
// 0 - Не начат
// 1 - В работе
// 2 - Завершено

&НаСервере
Функция УстановитьСтатусИнвентаризируемойЯчейки(ОбъектГУИД, ЯчейкаГУИД, StatusId = 1 ) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
	
		Попытка                                          
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси. SetStatusForInventoryCell(ПользовательГУИД, ОбъектГУИД, ЯчейкаГУИД, StatusId);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
										                             
			Прервать;
			
		Исключение
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "УстановитьСтатусИнвентаризируемойЯчейки");			
		КонецПопытки; 
		
	КонецЦикла;                          
		                                                       
	Возврат РезультатОтвета;
	
КонецФункции


&НаСервере
Функция МожноВыгрузитьПроинвентаризируемыеТоварыПоВсемЯчейкам(ОбъектГУИД, Ячейки) Экспорт
	
	Результат = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СписокЗаданийНаИнвентаризацию.Ссылка КАК Ссылка,
	|	СписокЗаданийНаИнвентаризацию.СсылкаЯчейки КАК СсылкаЯчейки,
	|	СписокЗаданийНаИнвентаризацию.СтатусРаботы КАК СтатусРаботы
	|ИЗ
	|	РегистрСведений.СписокЗаданийНаИнвентаризацию КАК СписокЗаданийНаИнвентаризацию
	|ГДЕ
	|	СписокЗаданийНаИнвентаризацию.Ссылка = &Ссылка
	|	И СписокЗаданийНаИнвентаризацию.СсылкаЯчейки В(&Ячейки)
	|	И СписокЗаданийНаИнвентаризацию.СтатусРаботы <> 2";
	
	Запрос.УстановитьПараметр("Ссылка", ОбъектГУИД);
	
	ПараметрЯчейки = Новый Массив;
	Для каждого Элемент Из Ячейки Цикл
        ПараметрЯчейки.Добавить(Элемент.СсылкаЯчейки);
	КонецЦикла; 
	
	Запрос.УстановитьПараметр("Ячейки", ПараметрЯчейки);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Количество() > 0 Тогда
		Результат = Ложь;
	КонецЕсли; 	 
	
	Возврат Результат;
	
КонецФункции
  

#КонецОбласти                                                                                                                                                                                             

&НаСервере
Функция ЗагрузитьСписокДокументовПТУ(ДокументСсылка = "", ДокументГУИД = "") Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
	
		Попытка
			
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
		
			Ответ = WSПрокси.GetListOfDocumentsPTU( "", ДокументГУИД, ПользовательГУИД);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
			
			Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				
				ЗаписатьРегистрСведений("СписокДокументовПТУ", РезультатОтвета.Данные);
				ОбработатьЗагруженныеДанныеСпискаПТУ();
				
			КонецЕсли; 
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ЗагрузитьСписокДокументовПТУ");			
			
		КонецПопытки; 
		
	КонецЦикла;
		                                                       
	Возврат РезультатОтвета;
	
КонецФункции

&НаСервере
Функция ЗагрузитьСписокДокументовПТУ_ЧЗ(ДокументСсылка = "", ДокументГУИД = "") Экспорт
//+Белов А. 05.06.2026 #UT10-5895

	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
	
		Попытка
			
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
		
			Ответ = WSПрокси.GetListOfDocumentsPTUHS();
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
			
			Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				
				Данные = РезультатОтвета.Данные; 
				ЗаписатьРегистрСведений("СписокДокументовПТУ", РезультатОтвета.Данные);
								
			КонецЕсли; 
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ЗагрузитьСписокДокументовПТУ_ЧЗ");			
			
		КонецПопытки; 
		
	КонецЦикла;
		                                                       
	Возврат РезультатОтвета;

//-Белов А. 05.06.2026 #UT10-5895	
КонецФункции

&НаСервере
Функция ЗагрузитьСписокНепроведенныхДокументовПТУ(ДокументСсылка = "", ДокументГУИД = "") Экспорт

	РезультатОтвета = ПолучитьСтруктуруОтвета();	
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
	
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
	
			Ответ = WSПрокси.GetListOfUnverifiedDocumentsPTUTransit( "", ДокументГУИД, ПользовательГУИД); 

			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
			
			Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				ЗаписатьРегистрСведений("СписокНепроведенныхДокументовПТУ", РезультатОтвета.Данные);
			КонецЕсли; 
			
			Прервать;
			
		Исключение 
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ЗагрузитьСписокНепроведенныхДокументовПТУ");			
			
		КонецПопытки;                                                                                                                                                       
	
	КонецЦикла;
		                                                       
	Возврат РезультатОтвета;

КонецФункции

&НаСервере
Функция ЗагрузитьСписокСлужебныхЗаписок(ДокументСсылка = "", ДокументГУИД = "") Экспорт

	РезультатОтвета = ПолучитьСтруктуруОтвета();	
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
	
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
	
			Ответ = WSПрокси.GetListOfIncomingMemo( "", ДокументГУИД, ПользовательГУИД);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
			
			Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				ЗаписатьРегистрСведений("СписокСлужебныхЗаписок", РезультатОтвета.Данные);
			КонецЕсли; 
			
			Прервать;
			
		Исключение 
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ЗагрузитьСписокНепроведенныхДокументовПТУ");			
			
		КонецПопытки;                                                                                                                                                       
	
	КонецЦикла;
		                                                       
	Возврат РезультатОтвета;

КонецФункции

&НаСервере
Функция ЗагрузитьСписокОбъединений(Завершенные = Ложь, Записывать = Истина, ДокументГУИД = "") Экспорт

	РезультатОтвета = ПолучитьСтруктуруОтвета();	
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
	
		Попытка
			
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
	
			Ответ = WSПрокси.GetListOfUnion(ПользовательГУИД, ДокументГУИД, Завершенные);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
			
			Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) И Записывать Тогда
				ЗаписатьРегистрСведений("СписокОбъединений" + ?(Завершенные, "Завершенные", ""), РезультатОтвета.Данные);
			КонецЕсли; 
			
			Прервать;
			
		Исключение 
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ЗагрузитьСписокОбъединений");			
			
		КонецПопытки;                                                                                                                                                       
	
	КонецЦикла;
		                                                       
	Возврат РезультатОтвета;
 
КонецФункции

&НаСервере
Функция ОткрытьЗакрытьТЕ(ОбъединениеГУИД) Экспорт
	
	СтруктураОтвета = Новый Структура("Результат, Сообщение", Ложь, "");
	
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
		
		Попытка
			
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			
			Ответ = WSПрокси.OpenCloseTE(ОбъединениеГУИД, ПользовательГУИД); 
			
			СтруктураОтвета = ХранилищеJSONВСтруктуру(Ответ);
			
			Прервать;
			
		Исключение                                       		
			СтруктураОтвета.Сообщение = ОписаниеОшибки();		
		КонецПопытки;                                                                                                                                                       
	
	КонецЦикла;
		                                                       
	Возврат СтруктураОтвета;

КонецФункции

&НаСервере
Функция ПолучитьСписокГрузовыхМестСлужебныхЗаписок(СлужебнаяЗапискаГУИД, ПолучитьВсеЗаписи = Ложь) Экспорт

	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
	
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			
			Ответ = WSПрокси.GetListCargoIncomingMemo(СлужебнаяЗапискаГУИД , ПользовательГУИД);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
			
			Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				ЗаписатьРегистрСведений("СписокГрузовыхМестСлужебныеЗаписки", РезультатОтвета.Данные);
			КонецЕсли;                     
			
			Прервать;
			
		Исключение
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ЗагрузитьСписокГрузовыхМест");			
		КонецПопытки; 
		
	КонецЦикла;
		                                                       
	Возврат РезультатОтвета;

КонецФункции

&НаСервере
Процедура ОбработатьЗагруженныеДанныеСпискаПТУ()
	
	Выборка = РегистрыСведений.СписокДокументовПТУ.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Запись = Выборка.ПолучитьМенеджерЗаписи();
		Запись.Прочитать();

		Если Выборка.ПриемкаГМ Тогда
			
			Запись.ВсегоСтрокСТР = Строка(Запись.КоличествоОсталостьРазместитьСтрокГМ);
			Запись.ОсталосьРазместитьСТР = Строка(Запись.КоличествоОсталостьРазместитьСтрокГМ);
			Запись.СтрокНеРазмещеноСТР = Строка(Запись.КоличествоСтрокВБуфереСотрудника); 
			
			
		Иначе
			
			Запись.ВсегоСтрокСТР = Строка(Запись.КоличествоНеРазмещеннныхСтрокНоменклатуры);
			Запись.ОсталосьРазместитьСТР = Строка(Запись.КоличествоОсталостьРазместитьСтрокНоменклатуры);
			Запись.СтрокНеРазмещеноСТР = Строка(Запись.КоличествоСтрокВБуфереСотрудника); 
			
		КонецЕсли;
		
		Запись.Записать(); 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьРегистрСведений(ИмяРегистра, СписокДанных, УдалятьТекущиеДанныеРС = Истина) Экспорт
	                      
	РегСведНабор = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	
	Если УдалятьТекущиеДанныеРС = Истина Тогда
		РегСведНабор.Записать();
	КонецЕсли; 
	
	НомерЗаписи = 1;
	
	Для каждого Данные Из СписокДанных Цикл
		
		НоваяЗапись = РегСведНабор.Добавить();	
		
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Данные);		
		
		Если ИмяРегистра = "СписокДокументовПТУ" Тогда
			
			НоваяЗапись.ДатаДокумента = ПреобразоватьДату(Данные.ДатаДокумента);
			НоваяЗапись.НомерДокументаОформление = НоваяЗапись.НомерДокумента + " от " + СТРОКА(Формат(НоваяЗапись.ДатаДокумента, "ДФ=dd.MM.yyyy")) + "г.";    
			НоваяЗапись.ПриемкаГМ = Данные.ПриемкаГМ;
			       
		КонецЕсли;			
		
		Если ИмяРегистра = "СписокНепроведенныхДокументовПТУ" Тогда
			
			НоваяЗапись.ДатаДокумента = ПреобразоватьДату(Данные.ДатаДокумента);
			НоваяЗапись.НомерДокументаОформление = ?(НоваяЗапись.Транзит,"(Транзит)","")+НоваяЗапись.НомерДокумента + " от " + СТРОКА(Формат(НоваяЗапись.ДатаДокумента, "ДФ=dd.MM.yyyy")) + "г.";    
			НоваяЗапись.КоличествоСтрокОформление = " "+Строка(НоваяЗапись.КоличествоСтрок)+" стр.";  
			НоваяЗапись.ДатаВходящегоДокумента = ПреобразоватьДату(Данные.ДатаВходящегоДокумента);
			
		КонецЕсли;
		
		Если ИмяРегистра = "СписокСлужебныхЗаписок" Тогда
			
			НоваяЗапись.ДатаДокумента = ПреобразоватьДату(Данные.ДатаДокумента);
			НоваяЗапись.НомерДокументаОформление = НоваяЗапись.НомерДокумента + " от " + СТРОКА(Формат(НоваяЗапись.ДатаДокумента, "ДФ=dd.MM.yyyy")) + "г.";    
			НоваяЗапись.КоличествоГрузоместОформление = " "+Строка(НоваяЗапись.КоличествоГрузомест)+" гм ";  
			
		КонецЕсли;

		Если ИмяРегистра = "СписокТоваровВБуфереРазмещение" Или ИмяРегистра = "СписокТоваровВБуфереПеремещения" Тогда
			
			НоваяЗапись.НомерЗаписи = НомерЗаписи;
			НомерЗаписи = НомерЗаписи + 1;
			НоваяЗапись.КодПроизводителяТовара = СтрЗаменить(НоваяЗапись.КодПроизводителяТовара, " ", "");
			НоваяЗапись.КодПроизводителяТовара = СтрЗаменить(НоваяЗапись.КодПроизводителяТовара, ".", "");
			НоваяЗапись.КодПроизводителяТовара = СтрЗаменить(НоваяЗапись.КодПроизводителяТовара, "_", "");	
			
		КонецЕсли;
		
		Если ИмяРегистра = "СписокОбъединений" ИЛИ ИмяРегистра = "СписокОбъединенийЗавершенные" Тогда
			
			НоваяЗапись.ДатаДокумента = ПреобразоватьДату(Данные.ДатаДокумента);
			НоваяЗапись.НомерДокументаОформление = НоваяЗапись.НомерДокумента + " от " + СТРОКА(Формат(НоваяЗапись.ДатаДокумента, "ДФ=dd.MM.yyyy")) + "г.";    
			
		КонецЕсли;
		
		Если ИмяРегистра = "СписокТоваровДокументаПТУ" Тогда
			Размещено = НоваяЗапись.КоличествоТовараНабрано + НоваяЗапись.КоличествоВРазмещении;
			НоваяЗапись.КоличествоОформление = Строка(Размещено) + " из " + Строка(НоваяЗапись.КоличествоТовара);
		КонецЕсли; 
		
		Если ИмяРегистра = "СписокТоваровДляВыбора" Тогда
			НоваяЗапись.КоличествоОстаток = "Кол.: " + Строка(НоваяЗапись.КоличествоОстаток);
		КонецЕсли; 
		
		Если ИмяРегистра = "СписокНайденныхТоваровПоШтрихкоду" Тогда
			НоваяЗапись.НомерЗаписи = НомерЗаписи;
			НомерЗаписи = НомерЗаписи + 1;
		КонецЕсли;     
		
		Если ИмяРегистра = "СписокТоваровВБуфереРазмещениеГМ" Тогда
			НоваяЗапись.НомерЗаписи = НомерЗаписи;
			НомерЗаписи = НомерЗаписи + 1;	
		КонецЕсли;
		
		Если ИмяРегистра = "СписокТоваровВБуфереМаркировок" Тогда
			НоваяЗапись.НомерЗаписи = НомерЗаписи;
			НомерЗаписи = НомерЗаписи + 1;	
		КонецЕсли;
		
		Если ИмяРегистра = "СписокТоваровЯчейки" Тогда
			НоваяЗапись.КоличествоОстатокСтр = ?(НоваяЗапись.КоличествоОстаток >= 1000,Строка(НоваяЗапись.КоличествоОстаток),"Кол.: " + Строка(НоваяЗапись.КоличествоОстаток));
			НоваяЗапись.КоличествоОписаниеОткуда = Строка(НоваяЗапись.КоличествоТовараНабрано) + " из " + Строка(НоваяЗапись.КоличествоОстаток);
			НоваяЗапись.КоличествоОписаниеКуда = "Кол.: " + Строка(НоваяЗапись.КоличествоОстаток);			
			НоваяЗапись.Ячейка = СтрЗаменить(НоваяЗапись.Ячейка, "-", "");
		КонецЕсли; 
		
		Если ИмяРегистра = "СписокТоваровВБуфереПеремещения"  Тогда
			НоваяЗапись.КоличествоТовараСтр = "Кол.: " + Строка(НоваяЗапись.КоличествоТовара);	
			НоваяЗапись.ЯчейкаОткуда = СтрЗаменить(НоваяЗапись.ЯчейкаОткуда, "-", "");
			НоваяЗапись.ЯчейкаКуда = СтрЗаменить(НоваяЗапись.ЯчейкаКуда, "-", "");
		КонецЕсли; 
		
		Если ИмяРегистра = "СписокЗаданийНаДоставку" Тогда
			НоваяЗапись.ДатаДокумента = ПреобразоватьДату(Данные.ДатаДокумента);
			НоваяЗапись.ОписаниеДокумента = НоваяЗапись.Номер + " от " + Формат(НоваяЗапись.ДатаДокумента,"ДЛФ=Д");
		КонецЕсли; 
		
		Если ИмяРегистра = "СписокМаршрутовДляПриемкиГрузовыхМест" Тогда      
			НоваяЗапись.ЗаданиеНаДоставкуДата = ПреобразоватьДату(Данные.ЗаданиеНаДоставкуДата);
			НоваяЗапись.ОписаниеДокумента = НоваяЗапись.ЗаданиеНаДоставкуНомер + " от " + Формат(НоваяЗапись.ЗаданиеНаДоставкуДата,"ДЛФ=Д");
		КонецЕсли; 
		
		Если ИмяРегистра = "СписокЗаданийНаИнвентаризацию" Тогда
			НоваяЗапись.ДатаДокумента = ПреобразоватьДату(Данные.ДатаДокумента);
			НоваяЗапись.НомерДокументаОформление = НоваяЗапись.НомерДокумента + " от " 
						+ СТРОКА(Формат(НоваяЗапись.ДатаДокумента, "ДФ=dd.MM.yyyy")) + "г."
						+ " (" + СТРОКА(НоваяЗапись.Уровень) + ")";
			НоваяЗапись.КодЯчейкиОтформат =  СтрЗаменить(НоваяЗапись.КодЯчейки , "-",""); 
		КонецЕсли; 
		
		Если ИмяРегистра = "СписокТоваровВБуфереИнвентаризации" Тогда			
			НоваяЗапись.НомерЗаписи = НомерЗаписи;
			НомерЗаписи = НомерЗаписи + 1;
			
			НоваяЗапись.КодПроизводителяТовара = СтрЗаменить(НоваяЗапись.КодПроизводителяТовара, " ", "");
			НоваяЗапись.КодПроизводителяТовара = СтрЗаменить(НоваяЗапись.КодПроизводителяТовара, ".", "");
			НоваяЗапись.КодПроизводителяТовара = СтрЗаменить(НоваяЗапись.КодПроизводителяТовара, "_", "");			
			                                                                                                          
			НоваяЗапись.КоличествоОстатокСтр = "Кол.: " + Строка(НоваяЗапись.КоличествоТовара);
		КонецЕсли; 
		
		Если ИмяРегистра = "СписокГрузовыхМестИзРазгрузкиАвтоДляПостановкиНаМаршрут" Тогда			 
			НоваяЗапись.ГрузовоеМестоНомер = "ГМ" + Формат(Число(НоваяЗапись.ГрузовоеМестоНомер), "ЧГ=0");	
		КонецЕсли;                                   
		
		Если ИмяРегистра = "СписокГрузовыхМестИзРазгрузкиАвто" Тогда			 
			НоваяЗапись.ГрузовоеМестоНомер = "ГМ" + Формат(Число(НоваяЗапись.ГрузовоеМестоНомер), "ЧГ=0");	
		КонецЕсли;                                                             

		Если ИмяРегистра = "СписокСборокДляЗаблокированнойЯчейки" Тогда
			НоваяЗапись.СборкаДата = ПреобразоватьДату(Данные.СборкаДата);			
			НоваяЗапись.НомерДокументаОформление = НоваяЗапись.СборкаНомер + " от " + Формат(НоваяЗапись.СборкаДата, "ДФ=dd.MM.yyyy") + " г.";			
		КонецЕсли;
		
		//+Сёмин Р. 19.12.2025 #UT10-5593
		Если ИмяРегистра = "СписокТранспортныхЕдиниц" Тогда
			НоваяЗапись.ДатаДокумента = ПреобразоватьДату(Данные.ДатаДокумента);
			НоваяЗапись.НомерДокументаОформление = НоваяЗапись.НомерДокумента + " от " + СТРОКА(Формат(НоваяЗапись.ДатаДокумента, "ДФ=dd.MM.yyyy")) + "г.";
			НоваяЗапись.ДатаВходящегоДокумента = ПреобразоватьДату(Данные.ДатаВходящегоДокумента);
		КонецЕсли;
		//-Сёмин Р. 19.12.2025 #UT10-5593
		
		НоваяЗапись.ДатаЗагрузки = ТекущаяДата();		
		
	КонецЦикла; 
	
	Попытка
		РегСведНабор.Записать(Ложь);		
	Исключение
		
	КонецПопытки

КонецФункции

&НаСервере
Функция ПреобразоватьДату(СтроковаяДата) 
	
	СтроковаяДата = СтрЗаменить(СтроковаяДата , "-",""); 
	СтроковаяДата = СтрЗаменить(СтроковаяДата , ":","");
	СтроковаяДата = СтрЗаменить(СтроковаяДата , "T","");
	Возврат Дата(СтроковаяДата);
	
КонецФункции

&НаСервере
Процедура ОчиститьРегистрСведений(ИмяРегистра) Экспорт
	
	РегСведНабор = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	РегСведНабор.Записать();

КонецПроцедуры

&НаСервере
Функция ЗагрузитьСписокТранспортныхЕдиниц(ДокументГУИД = "") Экспорт
	
	//+Сёмин Р. 19.12.2025 #UT10-5593
	РезультатОтвета = ПолучитьСтруктуруОтвета();	
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
	
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
	
			Ответ = WSПрокси.GetListOfTE(ДокументГУИД, ПользовательГУИД); 

			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
			
			Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				ЗаписатьРегистрСведений("СписокТранспортныхЕдиниц", РезультатОтвета.Данные);
			КонецЕсли; 
			
			Прервать;
			
		Исключение 
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ЗагрузитьСписокТранспортныхЕдиниц");			
			
		КонецПопытки;                                                                                                                                                       
	
	КонецЦикла;
		                                                       
	Возврат РезультатОтвета;
	//+Сёмин Р. 19.12.2025 #UT10-5593
	
КонецФункции

&НаСервере
Функция ПолучитьСтатусЭДОПТУ(ДокументГУИД) Экспорт
	
	//+Сёмин Р.И. 08.06.2026 #UT10-5901
	РезультатОтвета = ПолучитьСтруктуруОтвета();	
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
	
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
	
			Ответ = WSПрокси.GetPTUEDOStatus(ДокументГУИД, ПользовательГУИД); 

			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
			
			Прервать;
			
		Исключение 
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьСтатусЭДОПТУ");			
			
		КонецПопытки;                                                                                                                                                       
	
	КонецЦикла;
		                                                       
	Возврат РезультатОтвета;
	//-Сёмин Р.И. 08.06.2026 #UT10-5901
	
КонецФункции

&НаСервере
Функция ПТУСодержитКодыМаркировкиСНарушеннымСроком(ДокументГУИД) Экспорт
	
	//+Сёмин Р.И. 24.06.2026 #UT10-5915
	РезультатОтвета = ПолучитьСтруктуруОтвета();	
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
	
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
	
			Ответ = WSПрокси.CheckPTUContainsExpiredKIZ(ДокументГУИД, ПользовательГУИД); 

			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
			
			Прервать;
			
		Исключение 
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПТУСодержитКодыМаркировкиСНарушеннымСроком");			
			
		КонецПопытки;                                                                                                                                                       
	
	КонецЦикла;
		                                                       
	Возврат РезультатОтвета;
	//-Сёмин Р.И. 24.06.2026 #UT10-5915
	
КонецФункции



/////////////////////////////////////////////////////////////////////////////////////////////////////////
#Область ПараметрыРаботы

&НаСервере
Процедура ЗаписатьПараметрыРаботы( ИмяРегистра, ПараметрыРаботы ) Экспорт
	                                   
	МенеджерЗаписи = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Прочитать();
	Для каждого Элемент Из ПараметрыРаботы Цикл
		
		МенеджерЗаписи[Элемент.Ключ] = Элемент.Значение;
		
	КонецЦикла; 	
	
	МенеджерЗаписи.Записать();		
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыРаботыСДокументомПТУ() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПараметрыРаботыСДокументомПТУ.НомерСкладскогоДокумента КАК НомерСкладскогоДокумента,
	|	ПараметрыРаботыСДокументомПТУ.ЯчейкаПриемки КАК ЯчейкаПриемки,
	|	ПараметрыРаботыСДокументомПТУ.ЯчейкаПриемкиГУИД КАК ЯчейкаПриемкиГУИД,
	|	ПараметрыРаботыСДокументомПТУ.ДокументГУИД КАК ДокументГУИД,          
	//+Шульман А. 13.11.2025 #UT10-5504
	|	ПараметрыРаботыСДокументомПТУ.ПоставкаОтВнешнегоПоставщика КАК ПоставкаОтВнешнегоПоставщика    
	//-Шульман А. 13.11.2025 #UT10-5504
	|ИЗ
	|	РегистрСведений.ПараметрыРаботыСДокументомПТУ КАК ПараметрыРаботыСДокументомПТУ";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	РезультатЗапроса.Следующий();
			 
	ПараметрыРаботы = Новый Структура;
	
	ПараметрыРаботы.Вставить( "НомерСкладскогоДокумента", РезультатЗапроса.НомерСкладскогоДокумента);
	ПараметрыРаботы.Вставить( "ЯчейкаПриемки", РезультатЗапроса.ЯчейкаПриемки);
	ПараметрыРаботы.Вставить( "ЯчейкаПриемкиГУИД", РезультатЗапроса.ЯчейкаПриемкиГУИД);
	ПараметрыРаботы.Вставить( "ДокументГУИД", РезультатЗапроса.ДокументГУИД);    
	//+Шульман А. 13.11.2025 #UT10-5504
	ПараметрыРаботы.Вставить( "ПоставкаОтВнешнегоПоставщика", РезультатЗапроса.ПоставкаОтВнешнегоПоставщика); 
	//-Шульман А. 13.11.2025 #UT10-5504
	
	Возврат ПараметрыРаботы;
	
КонецФункции

&НаСервере
Процедура ОчиститьПараметрыРаботы() Экспорт
	                                        
	РегСведНабор = РегистрыСведений.ПараметрыРаботыСДокументомПТУ.СоздатьНаборЗаписей();
	РегСведНабор.Записать();
	
	РегСведНабор = РегистрыСведений.ПараметрыРаботыПриПеремещении.СоздатьНаборЗаписей();
	РегСведНабор.Записать();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыРаботыПриПеремещении() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПараметрыРаботыПриПеремещении.ЯчейкаКуда КАК ЯчейкаКуда,
	|	ПараметрыРаботыПриПеремещении.ЯчейкаКудаГУИД КАК ЯчейкаКудаГУИД,
	|	ПараметрыРаботыПриПеремещении.ЯчейкаОткуда КАК ЯчейкаОткуда,
	|	ПараметрыРаботыПриПеремещении.ЯчейкаОткудаГУИД КАК ЯчейкаОткудаГУИД
	|ИЗ
	|	РегистрСведений.ПараметрыРаботыПриПеремещении КАК ПараметрыРаботыПриПеремещении";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	РезультатЗапроса.Следующий();
			 
	ПараметрыРаботы = Новый Структура;
	
	ПараметрыРаботы.Вставить( "ЯчейкаКуда", РезультатЗапроса.ЯчейкаКуда);
	ПараметрыРаботы.Вставить( "ЯчейкаКудаГУИД", РезультатЗапроса.ЯчейкаКудаГУИД);
	ПараметрыРаботы.Вставить( "ЯчейкаОткуда", РезультатЗапроса.ЯчейкаОткуда);
	ПараметрыРаботы.Вставить( "ЯчейкаОткудаГУИД", РезультатЗапроса.ЯчейкаОткудаГУИД);
	
	Возврат ПараметрыРаботы;
	
КонецФункции

#КонецОбласти 

/////////////////////////////////////////////////////////////////////////////////////////////////////////


#Область Константы

&НаСервере
Функция ПолучитьАдрес() Экспорт
	
	Возврат Константы.Адрес.Получить();

КонецФункции

&НаСервере
Процедура УстановитьНачальныеПараметры() Экспорт
	
	Если Не ЗначениеЗаполнено(Константы.КоличествоПопытокПодключения.Получить()) Тогда
		Константы.КоличествоПопытокПодключения.Установить(2);
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Константы.Адрес.Получить()) Тогда
		Константы.Адрес.Установить("192.168.1.117");
	КонецЕсли; 
	
	УстановитьВерсиюСервисаСервера() ; 
	Константы.Timeout.Установить( 15 );	
	УстановитьПараметрыСеансов();
	//УстановитьПутиДляЗвуковыхФайлов();
	
	УстановитьВозможностьУдаленияЗаписейИзБуфера(Истина);
	
	Константы.РазрешеноПроведениеПТУ.Установить(Ложь);
	Константы.ОтображатьСлужебныеЗапискиТСД.Установить(Ложь);
	Константы.ОтображатьТЕ.Установить(Ложь);
	Константы.ОтображатьМаркировкуТоваров.Установить(Ложь);	
	
	//+Шульман А. 05.12.2025 #UT10-5576  
	Константы.СчетчикДействий.Установить(1);
	//-Шульман А. 05.12.2025 #UT10-5576
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВозможностьУдаленияЗаписейИзБуфера(УдалятьЗаписи) 
	Константы.УдалятьЗаписиИзБуферов.Установить(УдалятьЗаписи);
КонецПроцедуры

&НаСервере
Процедура УстановитьРежимРаботы(РежимРаботыПриложения) Экспорт
	Константы.РежимРаботыПриложения.Установить(РежимРаботыПриложения);
КонецПроцедуры
 
&НаСервере
Функция ПолучитьРежимРаботыПриложения() Экспорт
	Если Константы.РежимРаботыПриложения.Получить() = Перечисления.РежимРаботыПриложения.Developing Тогда
		Возврат "Developing"
	Иначе
		Возврат "Production";
	КонецЕсли; 
КонецФункции

&НаСервере
Процедура УстановитьПараметрыСеансов()
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("mp3");	
	Файл = Новый Файл(ИмяВременногоФайла);
	ПутьКВременнойПапке = Файл.Путь;
	ПутьКВременнойПапке = СтрЗаменить(ПутьКВременнойПапке, "\", "/");
	/////////////////////////////////////////////////////////////////////////////////////////	
	ИмяЗвуковогоФайлаОшибки = "Error-converted.mp3";		
	
	ИмяВременногоФайла =  ПутьКВременнойПапке + ИмяЗвуковогоФайлаОшибки;
	Файл = Новый Файл( ИмяВременногоФайла );
    Если Не Файл.Существует() Тогда
		
		ДвоичныйФайл = ПолучитьОбщийМакет("ЗвуковойФайлОшибки");                		
		ДвоичныйФайл.Записать(ИмяВременногоФайла);		
		
	КонецЕсли;		
	ПараметрыСеанса.ПутьДоЗвуковогоФайлаОшибки = ИмяВременногоФайла;
	
	/////////////////////////////////////////////////////////////////////////////////////////
	ИмяЗвуковогоФайлаЯчейки = "Cell-converted.mp3";	
	ИмяВременногоФайла =  ПутьКВременнойПапке + ИмяЗвуковогоФайлаЯчейки;
	Файл = Новый Файл( ИмяВременногоФайла );
    Если Не Файл.Существует() Тогда
		
		ДвоичныйФайл = ПолучитьОбщийМакет("ЗвуковойФайлЯчейки");                		
		ДвоичныйФайл.Записать(ИмяВременногоФайла);
		
    КонецЕсли;	
	ПараметрыСеанса.ПутьДоЗвуковогоФайлаЯчейки = ИмяВременногоФайла;	
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЗвуковыеФайлыВоВременнойПапке(ПутьКВременнойПапке, ИмяЗвуковогоФайла)
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПутиДляЗвуковыхФайлов()
	
	Если Не ЗначениеЗаполнено( СокрЛП(Константы.ПутьДоЗвукФайлаОшибки.Получить()) )  Тогда
		
		ПутьДоФайла = "/storage/emulated/0/Install/SoundsFile/Error-converted.mp3";
		Константы.ПутьДоЗвукФайлаОшибки.Установить(ПутьДоФайла);
		
	КонецЕсли; 
	
	
	Если Не ЗначениеЗаполнено( СокрЛП(Константы.ПутьДоЗвукЯчейки.Получить()) )  Тогда
		
		ПутьДоФайла = "/storage/emulated/0/Install/SoundsFile/Cell-converted.mp3";
		Константы.ПутьДоЗвукЯчейки.Установить(ПутьДоФайла);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПутьДоЗвукФайлаОшибки() Экспорт
	//Возврат Константы.ПутьДоЗвукФайлаОшибки.Получить();
	Возврат ПараметрыСеанса.ПутьДоЗвуковогоФайлаОшибки;
КонецФункции

&НаСервере
Функция ПолучитьПутьДоЗвукФайлаЯчейки() Экспорт
	//Возврат Константы.ПутьДоЗвукЯчейки.Получить();
	Возврат ПараметрыСеанса.ПутьДоЗвуковогоФайлаЯчейки;
КонецФункции

&НаСервере
Функция ПолучитьКоличествоПопытокПодключения() Экспорт
	
	Возврат Константы.КоличествоПопытокПодключения.Получить();
	
КонецФункции

&НаСервере
Функция ПолучитьНаименованиеСотрудника() Экспорт 
	
	Возврат Константы.ПолноеИмя.Получить();
		
КонецФункции                                                                        

&НаСервере
Функция УдалятьЗаписиИзБуферов() Экспорт 
	
	Возврат Константы.УдалятьЗаписиИзБуферов.Получить();
		
КонецФункции                                                                        

&НаСервере
Процедура ОчиститьКонстантыПоПользователю() Экспорт
	
	Константы.ПолноеИмя.Установить("");	
	Константы.Пароль.Установить("");	
	Константы.ПользовательГУИД.Установить("");
	
КонецПроцедуры

&НаСервере
Функция УстановленРежимВводаАвтоматический() Экспорт
	Если Константы.РежимВводаКоличества.Получить() =  Перечисления.РежимВводаКоличества.Автоматический Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли; 
КонецФункции

&НаСервере
Функция УстановленРежимВводаРучной() Экспорт
	Если Константы.РежимВводаКоличества.Получить() =  Перечисления.РежимВводаКоличества.Ручной Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли; 
КонецФункции

&НаСервере
Процедура УстановитьРежимВводаНаСервере(УстановитьРежимВводаАвтоматический = Неопределено) Экспорт 
	
	Если ЗначениеЗаполнено(УстановитьРежимВводаАвтоматический) Тогда
		
		Если УстановитьРежимВводаАвтоматический = Истина Тогда
			Константы.РежимВводаКоличества.Установить(Перечисления.РежимВводаКоличества.Автоматический);
		Иначе
			Константы.РежимВводаКоличества.Установить(Перечисления.РежимВводаКоличества.Ручной);
		КонецЕсли; 
		
		Возврат;
		
	КонецЕсли; 
	
	Если Константы.РежимВводаКоличества.Получить() = Перечисления.РежимВводаКоличества.Автоматический Тогда
		Константы.РежимВводаКоличества.Установить(Перечисления.РежимВводаКоличества.Ручной);
	Иначе 
		Константы.РежимВводаКоличества.Установить(Перечисления.РежимВводаКоличества.Автоматический);	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРежимВыбораДляДокументаРазмещения(Режим) Экспорт 
	
	Если Режим = "ВыборЯчейки" Тогда
		Константы.СтатусРаботыСРазмещениемТовара.Установить(Перечисления.СтатусРаботыСРазмещениемТовара.ВыборЯчейки);	
	ИначеЕсли Режим = "ВыборНоменклатуры" Тогда 
		Константы.СтатусРаботыСРазмещениемТовара.Установить(Перечисления.СтатусРаботыСРазмещениемТовара.ВыборНоменклатуры);
	ИначеЕсли Режим = "ВводКоличестваНоменклатуры" Тогда 
		Константы.СтатусРаботыСРазмещениемТовара.Установить(Перечисления.СтатусРаботыСРазмещениемТовара.ВводКоличестваНоменклатуры);
	ИначеЕсли Режим = "ШКнеНайденВПоставке" Тогда 
		Константы.СтатусРаботыСРазмещениемТовара.Установить(Перечисления.СтатусРаботыСРазмещениемТовара.ШКнеНайденВПоставке);
	ИначеЕсли Режим = "ВыборМаркировки" Тогда 
		Константы.СтатусРаботыСРазмещениемТовара.Установить(Перечисления.СтатусРаботыСРазмещениемТовара.ВыборМаркировки);
	ИначеЕсли Режим = "ВыборНомеклатурыДляМаркировки" Тогда 
		Константы.СтатусРаботыСРазмещениемТовара.Установить(Перечисления.СтатусРаботыСРазмещениемТовара.ВыборНомеклатурыДляМаркировки); 
	КонецЕсли; 
	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРежимВыбораДляДокументаИнвентаризации(Режим) Экспорт
	
	Если Режим = "ПоискНоменклатуры" Тогда
		Константы.СтатусРаботыСИнвентаризацииЯчейки.Установить(Перечисления.СтатусРаботыСИнвентаризацииЯчейки.ПоискНоменклатуры);	
	ИначеЕсли Режим = "ВводКоличестваНоменклатуры" Тогда 
		Константы.СтатусРаботыСИнвентаризацииЯчейки.Установить(Перечисления.СтатусРаботыСИнвентаризацииЯчейки.ВводКоличестваНоменклатуры);	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере                                                                  
Функция ПолучитьСтатусРаботыСОстаткамиТоваров() Экспорт
	
	Если Константы.СтатусРаботыСОстаткамиТоваров.Получить() = Перечисления.СтатусРаботыСОстаткамиТоваров.ПоискПоШК_ВыберитеТовар Тогда 
		Возврат "ПоискПоШК_ВыберитеТовар";
	ИначеЕсли Константы.СтатусРаботыСОстаткамиТоваров.Получить() = Перечисления.СтатусРаботыСОстаткамиТоваров.ПоискПоШК_ОтсканируйтеТовар Тогда  
		Возврат "ПоискПоШК_ОтсканируйтеТовар";
	ИначеЕсли Константы.СтатусРаботыСОстаткамиТоваров.Получить() = Перечисления.СтатусРаботыСОстаткамиТоваров.ПоискПоШК_ПросмотрОстатковЯчейках Тогда  
		Возврат "ПоискПоШК_ПросмотрОстатковЯчейках";
	ИначеЕсли Константы.СтатусРаботыСОстаткамиТоваров.Получить() = Перечисления.СтатусРаботыСОстаткамиТоваров.ПоискПоЯчейке_ОтсканируйтеЯчейку Тогда  
		Возврат "ПоискПоЯчейке_ОтсканируйтеЯчейку";
	ИначеЕсли Константы.СтатусРаботыСОстаткамиТоваров.Получить() = Перечисления.СтатусРаботыСОстаткамиТоваров.ПоискПоЯчейке_ПросмотрЯчейки Тогда  
		Возврат "ПоискПоЯчейке_ПросмотрЯчейки";
	КонецЕсли; 
	
	Возврат "";
	
КонецФункции

&НаСервере
Процедура УстановитьРежимВыбораДляОстатковПоТоварам(Режим) Экспорт 
	
	Если Режим = "ПоискПоШК_ВыберитеТовар" Тогда
		Константы.СтатусРаботыСОстаткамиТоваров.Установить(Перечисления.СтатусРаботыСОстаткамиТоваров.ПоискПоШК_ВыберитеТовар);	
	ИначеЕсли Режим = "ПоискПоШК_ОтсканируйтеТовар" Тогда 
		Константы.СтатусРаботыСОстаткамиТоваров.Установить(Перечисления.СтатусРаботыСОстаткамиТоваров.ПоискПоШК_ОтсканируйтеТовар);
	ИначеЕсли Режим = "ПоискПоШК_ПросмотрОстатковЯчейках" Тогда 
		Константы.СтатусРаботыСОстаткамиТоваров.Установить(Перечисления.СтатусРаботыСОстаткамиТоваров.ПоискПоШК_ПросмотрОстатковЯчейках);
	ИначеЕсли Режим = "ПоискПоЯчейке_ОтсканируйтеЯчейку" Тогда 
		Константы.СтатусРаботыСОстаткамиТоваров.Установить(Перечисления.СтатусРаботыСОстаткамиТоваров.ПоискПоЯчейке_ОтсканируйтеЯчейку);
	ИначеЕсли Режим = "ПоискПоЯчейке_ПросмотрЯчейки" Тогда 
		Константы.СтатусРаботыСОстаткамиТоваров.Установить(Перечисления.СтатусРаботыСОстаткамиТоваров.ПоискПоЯчейке_ПросмотрЯчейки);		
	КонецЕсли; 
		
КонецПроцедуры
 
 
&НаСервере
Процедура УстановитьРежимВвыбораДляПеремещенияТовара(Режим) Экспорт
	                             
	Если Режим = "ПоискЯчейкиОткуда" Тогда
		Константы.СтатусРаботыСПеремещениемТовара.Установить(Перечисления.СтатусРаботыСПеремещениемТовара.ПоискЯчейкиОткуда);	
	ИначеЕсли Режим = "ПоискЯчейкиКуда" Тогда 
		Константы.СтатусРаботыСПеремещениемТовара.Установить(Перечисления.СтатусРаботыСПеремещениемТовара.ПоискЯчейкиКуда);	
	ИначеЕсли Режим = "ПоискНоменклатуры" Тогда 		
		Константы.СтатусРаботыСПеремещениемТовара.Установить(Перечисления.СтатусРаботыСПеремещениемТовара.ПоискНоменклатуры);			
	ИначеЕсли Режим = "ПросмотрТоваровВЯчейке" Тогда 
		Константы.СтатусРаботыСПеремещениемТовара.Установить(Перечисления.СтатусРаботыСПеремещениемТовара.ПросмотрТоваровВЯчейке);			
	ИначеЕсли Режим = "ШКнеНайденВЯчейке" Тогда 
		Константы.СтатусРаботыСПеремещениемТовара.Установить(Перечисления.СтатусРаботыСПеремещениемТовара.ШКнеНайденВЯчейке);			
	ИначеЕсли Режим = "ВводКоличестваНоменклатуры" Тогда 
		Константы.СтатусРаботыСПеремещениемТовара.Установить(Перечисления.СтатусРаботыСПеремещениемТовара.ВводКоличестваНоменклатуры);			
	ИначеЕсли Режим = "ОпределеныЯчейкиДляПоискаТовара" Тогда 
		Константы.СтатусРаботыСПеремещениемТовара.Установить(Перечисления.СтатусРаботыСПеремещениемТовара.ОпределеныЯчейкиДляПоискаТовара);					
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УстановитьРежимРаботыСЗаданиемНаДоставку(Режим) Экспорт
	
	ЗначениеПеречисления = ПолучитьСсылкуНаЗначениеПеречисления( "СтатусРаботыСЗаданиемНаДоставку", Режим );	
	Константы.СтатусРаботыСЗаданиемНаДоставку.Установить(ЗначениеПеречисления);
	
КонецФункции
 
&НаСервере
Функция УстановитьРежимРаботыСЗаданиемНаДоставкуИзРазгрузкаАвто(Режим) Экспорт
	
	ЗначениеПеречисления = ПолучитьСсылкуНаЗначениеПеречисления( "СтатусРаботыСЗаданиемНаДоставкуИзРазгрузкаАвто", Режим );	
	Константы.СтатусРаботыСЗаданиемНаДоставкуИзРазгрузкиАвто.Установить(ЗначениеПеречисления);
	
КонецФункции

&НаСервере
Функция ПолучитьСтатусРаботыСЗаданиемНаДоставку() Экспорт
	
	ЗначениеПеречисления = Константы.СтатусРаботыСЗаданиемНаДоставку.Получить();
	ИмяПеречисления = ЗначениеПеречисления.Метаданные().Имя;
	ИндексЗначенияПеречисления = Перечисления[ИмяПеречисления].Индекс(ЗначениеПеречисления);
	ИмяЗначенияПеречисления = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;	
	
	Возврат ИмяЗначенияПеречисления;                                                                 
	
КонецФункции

&НаСервере
Функция ПолучитьСтатусРаботыСЗаданиемНаДоставкуИзРазгрузкаАвто() Экспорт
	
	ЗначениеПеречисления = Константы.СтатусРаботыСЗаданиемНаДоставкуИзРазгрузкиАвто.Получить();
	ИмяЗначенияПеречисления = ПолучитьИмяЗначеняПеречисленяи(ЗначениеПеречисления);
	Возврат ИмяЗначенияПеречисления;
	
КонецФункции

&НаСервере
Функция ПолучитьИмяЗначеняПеречисленяи(ЗначениеПеречисления) Экспорт
	
	ИмяПеречисления = ЗначениеПеречисления.Метаданные().Имя;
	ИндексЗначенияПеречисления = Перечисления[ИмяПеречисления].Индекс(ЗначениеПеречисления);
	ИмяЗначенияПеречисления = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;	
	
	Возврат ИмяЗначенияПеречисления;

КонецФункции

&НаСервере
Функция ПолучитьИнструкциюДляДействийПользователя_ЗаданиеНаДОставку(Форма, РежимПросмотра = "") Экспорт 
	
	Если Форма = "Обработка.ПогрузкаВАвто.Форма.ФормаСпискаЗаданийНаДоставку" Тогда
		
		ЗначениеКонстанты = Константы.СтатусРаботыСЗаданиемНаДоставку.Получить();
		Если ЗначениеКонстанты = Перечисления.СтатусРаботыСЗаданиемНаДоставку.ПоискЗаданияНаДоставку Тогда
			Возврат "Отсканируйте задание";
		ИначеЕсли ЗначениеКонстанты = Перечисления.СтатусРаботыСЗаданиемНаДоставку.ПоискГрузовогоМеста Тогда
			Возврат "Отсканируйте грузовое место";
		ИначеЕсли ЗначениеКонстанты = Перечисления.СтатусРаботыСЗаданиемНаДоставку.ГотовКСканированиюГрузовогоМеста Тогда			
			Возврат "Отсканируйте грузовое место";
		КонецЕсли; 
		
		Возврат "";		
		
	КонецЕсли; 
	
	Если Форма = "Обработка.ПогрузкаВАвто.Форма.ФормаГрузовогоМеста" Тогда        
		
		ЗначениеКонстанты = Константы.СтатусРаботыСЗаданиемНаДоставку.Получить();
		Если ЗначениеКонстанты = Перечисления.СтатусРаботыСЗаданиемНаДоставку.ПоискЗаданияНаДоставку Тогда
			Возврат "Отсканируйте задание";
		ИначеЕсли ЗначениеКонстанты = Перечисления.СтатусРаботыСЗаданиемНаДоставку.ПоискГрузовогоМеста И РежимПросмотра = "" Тогда
			Возврат "Отсканируйте грузовое место";
		ИначеЕсли ЗначениеКонстанты = Перечисления.СтатусРаботыСЗаданиемНаДоставку.ГотовКСканированиюГрузовогоМеста И РежимПросмотра = ""  Тогда			
			Возврат "Отсканируйте грузовое место";
			
		ИначеЕсли ( ЗначениеКонстанты = Перечисления.СтатусРаботыСЗаданиемНаДоставку.ПоискГрузовогоМеста Или
				    ЗначениеКонстанты = Перечисления.СтатусРаботыСЗаданиемНаДоставку.ГотовКСканированиюГрузовогоМеста) И 
				(РежимПросмотра = "ПоказатьВсе" Или РежимПросмотра = "ПоказатьМестаВАвто") Тогда
			Возврат "";
			
		ИначеЕсли ( ЗначениеКонстанты = Перечисления.СтатусРаботыСЗаданиемНаДоставку.ПоискГрузовогоМеста Или
				    ЗначениеКонстанты = Перечисления.СтатусРаботыСЗаданиемНаДоставку.ГотовКСканированиюГрузовогоМеста) И 
				   РежимПросмотра = "ПоказатьМестаНаСкладе" Тогда
			Возврат "Смахните влево для выбора";
		КонецЕсли; 
		
		Возврат "";		
		
	КонецЕсли;         	
	
	
	Возврат "";		
	
КонецФункции
 
&НаСервере
Функция ПолучитьИнструкциюДляДействийПользователя_РазгрузкаАвто(Форма, РежимПросмотра = "") Экспорт 
	
	Если Форма = "Обработка.РазгрузкаАвто.Форма.ФормаСпискаЗаданийНаДоставку" Тогда        
		
		ЗначениеКонстанты = Константы.СтатусРаботыСЗаданиемНаДоставкуИзРазгрузкиАвто.Получить();
		Если ЗначениеКонстанты = Перечисления.СтатусРаботыСЗаданиемНаДоставкуИзРазгрузкаАвто.ПоискЗаданияНаДоставку Тогда
			Возврат "Отсканируйте задание";
		КонецЕсли;
		
		Если ЗначениеКонстанты = Перечисления.СтатусРаботыСЗаданиемНаДоставкуИзРазгрузкаАвто.ШККладовщика Тогда
			Возврат "Отсканируйте ШК Кладовщика";
		КонецЕсли;
		
		Возврат "";		
		
	КонецЕсли; 
	
	Если Форма = "Обработка.РазгрузкаАвто.Форма.ФормаГрузовогоМеста" Тогда        
		
		Если РежимПросмотра = "" Тогда
			Возврат "Отсканируйте грузовое место";	
		ИначеЕсли РежимПросмотра = "ПоказатьВсе" Или РежимПросмотра = "ПоказатьМестаНаСкладе" Тогда
			Возврат "";
		ИначеЕсли РежимПросмотра = "ПоказатьМестаВАвто" Тогда
			Возврат "Смахните влево для выбора";
		КонецЕсли; 
		
		Возврат "";		
			
	КонецЕсли;         	
		
	Возврат "";		
	
КонецФункции

&НаСервере
Функция ПолучитьИнструкциюДляДействийПользователя_РазгрузкаАвто_ПостановкаНаМаршрут(Форма, РежимПросмотра = "") Экспорт 
	
	
	Если Форма = "Обработка.ПриемкаГрузовыхМестИзРазгрузкиАвто.Форма.ФормаГрузовогоМеста" Тогда        
		
		Если РежимПросмотра = "" Тогда
			Возврат "Отсканируйте грузовое место";	
		ИначеЕсли РежимПросмотра = "ПоказатьВсе" Или РежимПросмотра = "ПоказатьМестаНаМаршруте" Тогда
			Возврат "";
		ИначеЕсли РежимПросмотра = "ПоказатьМестаВТележке" Тогда
			Возврат "Смахните влево для выбора";
		КонецЕсли; 
		
		Возврат "";		
			
	КонецЕсли;         	
		
	Возврат "";		
	
КонецФункции

&НаСервере
Функция ПолучитьСтатусРаботыСПеремещениемТовара() Экспорт
	
	Если Константы.СтатусРаботыСПеремещениемТовара.Получить() = Перечисления.СтатусРаботыСПеремещениемТовара.ПоискЯчейкиОткуда Тогда
		Возврат "ПоискЯчейкиОткуда";
	ИначеЕсли  Константы.СтатусРаботыСПеремещениемТовара.Получить() = Перечисления.СтатусРаботыСПеремещениемТовара.ПоискЯчейкиКуда Тогда
		Возврат "ПоискЯчейкиКуда";		
	ИначеЕсли  Константы.СтатусРаботыСПеремещениемТовара.Получить() = Перечисления.СтатусРаботыСПеремещениемТовара.ПоискНоменклатуры Тогда
		Возврат "ПоискНоменклатуры";
	ИначеЕсли Константы.СтатусРаботыСПеремещениемТовара.Получить() = Перечисления.СтатусРаботыСПеремещениемТовара.ПросмотрТоваровВЯчейке Тогда
		Возврат "ПросмотрТоваровВЯчейке";
	ИначеЕсли Константы.СтатусРаботыСПеремещениемТовара.Получить() = Перечисления.СтатусРаботыСПеремещениемТовара.ШКнеНайденВЯчейке Тогда
		Возврат "ШКнеНайденВЯчейке";
	ИначеЕсли Константы.СтатусРаботыСПеремещениемТовара.Получить() = Перечисления.СтатусРаботыСПеремещениемТовара.ВводКоличестваНоменклатуры Тогда
		Возврат "ВводКоличестваНоменклатуры";
	ИначеЕсли Константы.СтатусРаботыСПеремещениемТовара.Получить() = Перечисления.СтатусРаботыСПеремещениемТовара.ОпределеныЯчейкиДляПоискаТовара Тогда
		Возврат "ОпределеныЯчейкиДляПоискаТовара";
		
	КонецЕсли; 
	
	Возврат "";
	
КонецФункции

&НаСервере
Функция ПолучитьСтатусРаботыСРазмещениемДокумента() Экспорт
	
	Если Константы.СтатусРаботыСРазмещениемТовара.Получить() = Перечисления.СтатусРаботыСРазмещениемТовара.ВыборЯчейки Тогда
		 Возврат "ВыборЯчейки";
	ИначеЕсли Константы.СтатусРаботыСРазмещениемТовара.Получить() = Перечисления.СтатусРаботыСРазмещениемТовара.ВыборНоменклатуры Тогда
		 Возврат "ВыборНоменклатуры";
	ИначеЕсли Константы.СтатусРаботыСРазмещениемТовара.Получить() = Перечисления.СтатусРаботыСРазмещениемТовара.ВводКоличестваНоменклатуры Тогда
		 Возврат "ВводКоличестваНоменклатуры";		 
	 ИначеЕсли Константы.СтатусРаботыСРазмещениемТовара.Получить() = Перечисления.СтатусРаботыСРазмещениемТовара.ШКнеНайденВПоставке Тогда
		 Возврат "ШКнеНайденВПоставке";	
	 ИначеЕсли Константы.СтатусРаботыСРазмещениемТовара.Получить() = Перечисления.СтатусРаботыСРазмещениемТовара.ВыборМаркировки Тогда
		 Возврат "ВыборМаркировки";		 
	 ИначеЕсли Константы.СтатусРаботыСРазмещениемТовара.Получить() = Перечисления.СтатусРаботыСРазмещениемТовара.ВыборНомеклатурыДляМаркировки Тогда
		 Возврат "ВыборНомеклатурыДляМаркировки";	
	 КонецЕсли; 
	
	Возврат "";
	
КонецФункции

&НаСервере
Функция ПолучитьСтатусРаботыСИнвентаризациейЯчейки() Экспорт
	
	Если Константы.СтатусРаботыСИнвентаризацииЯчейки.Получить() = Перечисления.СтатусРаботыСИнвентаризацииЯчейки.ПоискНоменклатуры Тогда
		 Возврат "ПоискНоменклатуры";
	ИначеЕсли Константы.СтатусРаботыСИнвентаризацииЯчейки.Получить() = Перечисления.СтатусРаботыСИнвентаризацииЯчейки.ВводКоличестваНоменклатуры Тогда
		 Возврат "ВводКоличестваНоменклатуры";		 
	КонецЕсли; 
	
	Возврат "";
	
КонецФункции

&НаСервере
Функция ПолучитьИнструкциюДействийДляПользователя(ЕстьОшибка = "", Форма = "", ГМ = Ложь) Экспорт
	
	Если ЗначениеЗаполнено(ЕстьОшибка) Тогда
		Возврат "Для продолжения нажмите кнопку ""Продолжить"" ";
	КонецЕсли; 
	
	Если Форма = "Обработка.ПриемкаКоллективная.Форма.ФормаТоварыДокумента" Тогда
		Возврат "Смах. влево на товаре для действия";
	КонецЕсли; 
	
	Если Форма = "Обработка.ПриемкаКоллективная.Форма.ФормаСканированияМаркировок" Тогда
		
		Если Константы.СтатусРаботыСРазмещениемТовара.Получить() = Перечисления.СтатусРаботыСРазмещениемТовара.ВыборНомеклатурыДляМаркировки 
			И Константы.РежимВводаКоличества.Получить() = Перечисления.РежимВводаКоличества.Автоматический Тогда  			
			Возврат "Отсканируйте товар";			
		КонецЕсли;
		
		Если Константы.СтатусРаботыСРазмещениемТовара.Получить() = Перечисления.СтатусРаботыСРазмещениемТовара.ВыборМаркировки 
			И Константы.РежимВводаКоличества.Получить() = Перечисления.РежимВводаКоличества.Автоматический Тогда  			
			Возврат "Отсканируйте маркировку (QR-код)";			
		КонецЕсли;
		
	КонецЕсли; 
	
	Если Константы.СтатусРаботыСРазмещениемТовара.Получить() = Перечисления.СтатусРаботыСРазмещениемТовара.ВыборЯчейки Тогда
		
		Возврат "Отсканируйте ячейку приемки";
		
	ИначеЕсли Константы.СтатусРаботыСРазмещениемТовара.Получить() = Перечисления.СтатусРаботыСРазмещениемТовара.ВыборНоменклатуры 
		И Константы.РежимВводаКоличества.Получить() = Перечисления.РежимВводаКоличества.Автоматический Тогда
		
		Если ГМ Тогда
			Возврат "Отсканируйте грузоместо или ячейку ""Куда""" ;
		Иначе
			Возврат "Отсканируйте грузоместо или ячейку ""Куда""" ;
		КонецЕсли;	  
		
		
	ИначеЕсли Константы.СтатусРаботыСРазмещениемТовара.Получить() = Перечисления.СтатусРаботыСРазмещениемТовара.ВыборНоменклатуры 
		И Константы.РежимВводаКоличества.Получить() = Перечисления.РежимВводаКоличества.Ручной Тогда
		
		Если ГМ Тогда
			Возврат "Отсканируйте грузоместо или ячейку ""Куда""" ;
		Иначе
			Возврат "Отсканируйте грузоместо или ячейку ""Куда""";
		КонецЕсли;	  		 
		
	ИначеЕсли Константы.СтатусРаботыСРазмещениемТовара.Получить() = Перечисления.СтатусРаботыСРазмещениемТовара.ВводКоличестваНоменклатуры		 
		И Константы.РежимВводаКоличества.Получить() = Перечисления.РежимВводаКоличества.Ручной Тогда
		
		Возврат "Введите колво отсканир.товара";   
		
	ИначеЕсли Константы.СтатусРаботыСРазмещениемТовара.Получить() = Перечисления.СтатусРаботыСРазмещениемТовара.ШКнеНайденВПоставке Тогда
		
		//+Шульман А. 05.12.2025 #UT10-5576
		Если Форма = "Обработка.ПриемкаКоллективная.Форма.ФормаСканированияМаркировок" Тогда
			Возврат "Отсканируйте товар";  
		//-Шульман А. 05.12.2025 #UT10-5576
		Иначе
			Возврат "Выберите требуемое действие";
		КонецЕсли;
		
	КонецЕсли; 

	Возврат "";
	
КонецФункции
 
&НаСервере
Функция ПолучитьИнструкциюДействийДляПользователя_ОстаткиТоваров( Форма = "") Экспорт
	
	Если Форма = "Обработка.ОстаткиПоЯчейкам.Форма.ФормаОстаткиТоваров" Тогда
		
		Если Константы.СтатусРаботыСОстаткамиТоваров.Получить() = Перечисления.СтатусРаботыСОстаткамиТоваров.ПоискПоШК_ВыберитеТовар Тогда			
		    Возврат "Выберите товар";			 
		ИначеЕсли Константы.СтатусРаботыСОстаткамиТоваров.Получить() = Перечисления.СтатусРаботыСОстаткамиТоваров.ПоискПоШК_ОтсканируйтеТовар Тогда
 			Возврат "Отсканируйте товар";
		ИначеЕсли Константы.СтатусРаботыСОстаткамиТоваров.Получить() = Перечисления.СтатусРаботыСОстаткамиТоваров.ПоискПоШК_ПросмотрОстатковЯчейках Тогда
 			Возврат "";			
		ИначеЕсли Константы.СтатусРаботыСОстаткамиТоваров.Получить() = Перечисления.СтатусРаботыСОстаткамиТоваров.ПоискПоЯчейке_ОтсканируйтеЯчейку Тогда
			Возврат "Отсканируйте ячейку с остатками";			
		ИначеЕсли Константы.СтатусРаботыСОстаткамиТоваров.Получить() = Перечисления.СтатусРаботыСОстаткамиТоваров.ПоискПоЯчейке_ПросмотрЯчейки Тогда
			Возврат "";						
		КонецЕсли;
		
	КонецЕсли; 
		
	Возврат "";
	
КонецФункции

&НаСервере
Функция ПолучитьИнструкциюДействийДляПользователя_ПеремещениеТоваров(ЕстьОшибка = "",  Форма = "") Экспорт
	                    	
	Если ЗначениеЗаполнено(ЕстьОшибка) Тогда
		Возврат "Для продолжения нажмите кнопку ""Продолжить"" ";
	КонецЕсли; 
	
	Если Форма = "Обработка.ПеремещениеТовараИзЯчейки.Форма.ФормаПеремещениеНоменклатуры" Тогда
		
		Если Константы.СтатусРаботыСПеремещениемТовара.Получить() = Перечисления.СтатусРаботыСПеремещениемТовара.ПоискЯчейкиОткуда Тогда			
		    Возврат "Отсканируйте ячейку ""Откуда""";			 
		ИначеЕсли Константы.СтатусРаботыСПеремещениемТовара.Получить() = Перечисления.СтатусРаботыСПеремещениемТовара.ПоискЯчейкиКуда Тогда			
			Возврат "Отсканируйте ячейку ""Куда""";			 
		ИначеЕсли Константы.СтатусРаботыСПеремещениемТовара.Получить() = Перечисления.СтатусРаботыСПеремещениемТовара.ПоискНоменклатуры Тогда						
			Возврат "Отсканируйте товар или ячейку ""Куда""";			  			
		ИначеЕсли Константы.СтатусРаботыСПеремещениемТовара.Получить() = Перечисления.СтатусРаботыСПеремещениемТовара.ПросмотрТоваровВЯчейке Тогда						
			Возврат "Смахнитие влево на товаре для действия";			  						
		ИначеЕсли Константы.СтатусРаботыСПеремещениемТовара.Получить() = Перечисления.СтатусРаботыСПеремещениемТовара.ВводКоличестваНоменклатуры Тогда						
			Возврат "Введите количества товара";			  						
		ИначеЕсли Константы.СтатусРаботыСПеремещениемТовара.Получить() = Перечисления.СтатусРаботыСПеремещениемТовара.ОпределеныЯчейкиДляПоискаТовара Тогда						
			Возврат "Отсканируйте товар или ячейку ""Куда""";			  			
		ИначеЕсли Константы.СтатусРаботыСПеремещениемТовара.Получить() = Перечисления.СтатусРаботыСПеремещениемТовара.ШКнеНайденВЯчейке Тогда						
			Возврат "Выберите требуемое действие";
		КонецЕсли;
		
	КонецЕсли; 
		
	Возврат "";
	
КонецФункции

Функция ПолучитьИнструкциюДействийДляПользователя_ИнвентаризацияЯчеейки(ЕстьОшибка = "",  Форма = "") Экспорт
	
	Если ЗначениеЗаполнено(ЕстьОшибка) Тогда
		Возврат "Для продолжения нажмите кнопку ""Продолжить"" ";
	КонецЕсли; 

	Если Константы.СтатусРаботыСИнвентаризацииЯчейки.Получить() = Перечисления.СтатусРаботыСИнвентаризацииЯчейки.ПоискНоменклатуры Тогда			
		Возврат "Отсканируйте товар или ячейку";			  			
	ИначеЕсли Константы.СтатусРаботыСИнвентаризацииЯчейки.Получить() = Перечисления.СтатусРаботыСИнвентаризацииЯчейки.ВводКоличестваНоменклатуры Тогда			
			Возврат "Введите количества товара";			  						
	КонецЕсли;
	
	Возврат "";

КонецФункции // ПолучитьИнструкциюДействийДляПользователя_ИнвентаризацияЯчеейки()

&НаСервере
Функция ПолучитьПользователяГУИД() Экспорт
	Возврат Константы.ПользовательГУИД.Получить();
КонецФункции

&НаСервере
Функция УстановитьПользователя(Пользователь, ПользовательГУИД) Экспорт
	Константы.ПользовательГУИД.Установить(ПользовательГУИД);
	Константы.Пользователь.Установить(Пользователь);
КонецФункции

Функция ПолучитьРазрешениеНаПроведениеПТУ() Экспорт 
	
	Возврат Константы.РазрешеноПроведениеПТУ.Получить();

КонецФункции

Функция ПолучитьРазрешениеОтображанияСлужебныхЗаписок() Экспорт 
	
	Возврат Константы.ОтображатьСлужебныеЗапискиТСД.Получить();

КонецФункции

Функция ПолучитьРазрешениеОтображанияТЕ() Экспорт 
	
	Возврат Константы.ОтображатьТЕ.Получить();
   	
КонецФункции

Функция ПолучитьРазрешениеОтображанияМаркировкиТоваров() Экспорт

	Возврат Константы.ОтображатьМаркировкуТоваров.Получить();

КонецФункции

Функция ПроверятьПриПриемкеНарушенияСроковГодностиКИЗ() Экспорт
	
	//+Сёмин Р.И. 24.06.2026 #UT10-5915
	Возврат Константы.ПроверятьНарушенияСроковГодностиКИЗ.Получить();
	//-Сёмин Р.И. 24.06.2026 #UT10-5915
	
КонецФункции

#КонецОбласти 
/////////////////////////////////////////////////////////////////////////////////////////////////////////


/////////////////////////////////////////////////////////////////////////////////////////////////////////
#Область СериализацияJSON

&НаСервере
Функция ДанныеВJSONХранилище(Данные) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	JsonСтрока = ЗаписьJSON.Закрыть(); 	
	
	ДанныеВозврат = Новый ХранилищеЗначения(JsonСтрока, Новый СжатиеДанных(9));
	
	Возврат ДанныеВозврат;
	
КонецФункции

&НаСервере
Функция ХранилищеJSONВСтруктуру(Данные) Экспорт
	
	ДанныеТекст = Данные.Получить();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ДанныеТекст);
	ДанныеСтруктура = ПрочитатьJSON(ЧтениеJSON);
	
	Возврат ДанныеСтруктура;
	
КонецФункции

#КонецОбласти 
/////////////////////////////////////////////////////////////////////////////////////////////////////////


&НаСервере
Функция ЕстьЛиТоварВЯчейке(ЯчейкаГУИД, ТоварГУИД) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета(); 
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл			
		
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";              
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.IsGoodInCell(ЯчейкаГУИД, ТоварГУИД, ПользовательГУИД);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);				
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ЕстьЛиТоварВЯчейке");
			
		КонецПопытки; 
		
	КонецЦикла;
	
	Возврат РезультатОтвета;
	
КонецФункции

&НаСервере
Функция ЕстьЛиТоварыВЯчейке(ЯчейкаГУИД) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета(); 
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл			
		
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";              
			//WSПрокси.Пароль = "web";		                                                    
			
			Ответ = WSПрокси.IsGoodsInCell(ЯчейкаГУИД, ПользовательГУИД);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);				
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ЕстьЛиТоварыВЯчейке");
			
		КонецПопытки; 
		
	КонецЦикла;
	
	Возврат РезультатОтвета;
	
КонецФункции
 
&НаСервере
Функция ДобавитьТоварВБуферАРМКладовщика(ОбъектГУИД, ТоварГУИД, ПользовательГУИД, ДатаСоздания, Штрихкод, Количество, ЯчейкаПриемникГУИД, ВведеноВРучную = Ложь) Экспорт

	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл			
	
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";              
			//WSПрокси.Пароль = "web";		
									 
			Ответ = WSПрокси.AddBufferARMStoreKeeper(ОбъектГУИД, ТоварГУИД, ПользовательГУИД, ДатаСоздания, Штрихкод, Количество,ЯчейкаПриемникГУИД, ВведеноВРучную);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);				
			
			Прервать;
			
		Исключение	
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных при записи в буфер кладовщика.");               		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ДобавитьТоварВБуферАРМКладовщика");
			
		КонецПопытки; 
		
	КонецЦикла;	
	
	Возврат РезультатОтвета;	
	
КонецФункции

&НаСервере
Функция ДобавитьТоварВБуферАРМКладовщикаОбъединения(ОбъектГУИД, ПользовательГУИД, ДатаСоздания, Штрихкод, ГМГуид, ВведеноВРучную = Ложь) Экспорт

	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл			
	
		Попытка
			
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );				
									 
			Ответ = WSПрокси.AddBufferARMStoreKeeperUnion(ОбъектГУИД, ПользовательГУИД, ДатаСоздания, Штрихкод, ГМГуид, ВведеноВРучную);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);				
			
			Прервать;
			
		Исключение	
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");               		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ДобавитьТоварВБуферАРМКладовщика");
			
		КонецПопытки; 
		
	КонецЦикла;	
	
	Возврат РезультатОтвета;	
	
КонецФункции

&НаСервере
Функция ДобавитьТоварВБуферАРМКладовщикаГМ(ОбъектГУИД, ПользовательГУИД, ДатаСоздания, Штрихкод, ЯчейкаПриемникГУИД, ВведеноВРучную = Ложь) Экспорт

	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл			
	
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";              
			//WSПрокси.Пароль = "web";		
									 
			Ответ = WSПрокси.AddBufferARMStoreKeeperGM(ОбъектГУИД, ПользовательГУИД, ДатаСоздания, Штрихкод,ЯчейкаПриемникГУИД, ВведеноВРучную);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);				
			
			Прервать;
			
		Исключение	
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");               		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ДобавитьТоварВБуферАРМКладовщика");
			
		КонецПопытки; 
		
	КонецЦикла;	
	
	Возврат РезультатОтвета;	
	
КонецФункции

&НаСервере
Функция ДобавитьТоварВБуферАРМКладовщикаСПроверкой(ОбъектГУИД, ТоварГУИД, ПользовательГУИД, ДатаСоздания, Штрихкод, Количество, 
												  ЯчейкаПриемникГУИД, ВведеноВРучную = Ложь) Экспорт

	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл			
	
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
									 
			Ответ = WSПрокси.WriteBufferWithCheckRemainder(ОбъектГУИД, ТоварГУИД, ПользовательГУИД, ДатаСоздания, 
														   Штрихкод, Количество,ЯчейкаПриемникГУИД, ВведеноВРучную);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);				
			
			Прервать;
			
		Исключение	
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");               		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ДобавитьТоварВБуферАРМКладовщика");
			
		КонецПопытки; 
		
	КонецЦикла;	
	
	Возврат РезультатОтвета;	
	
КонецФункции

&НаСервере
Функция ДобавитьТоварВБуферМаркировок(ОбъектГУИД, ПользовательГУИД, ДатаСоздания, НайденныйТовар, НайденнаяМаркировка) Экспорт 
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл			
		
		Попытка
			
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap");
			
			Ответ = WSПрокси.WriteBufferMark(ОбъектГУИД, ПользовательГУИД, ДатаСоздания, НайденныйТовар.Владелец, ДанныеВJSONХранилище(НайденнаяМаркировка));
				   
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);				
			
			Прервать;
			
		Исключение	
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");               		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ДобавитьТоварВБуферМаркировок");
			
		КонецПопытки; 
		
	КонецЦикла;	
	
	
	Возврат РезультатОтвета;
КонецФункции

&НаСервере
Функция ДобавитьТоварВБуферАРМКладовщикаПеремещение(ПользовательГУИД, ЯчейкаОткудаГУИД, ТоварГУИД, ДатаСоздания, Штрихкод, Количество, ЯчейкаКудаГУИД, ВведеноВРучную) Экспорт

	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл			
	
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";              
			//WSПрокси.Пароль = "web";		
									 
			Ответ = WSПрокси.AddBufferMovingARMStoreKeeper(ПользовательГУИД, ЯчейкаОткудаГУИД, ТоварГУИД, ДатаСоздания, Штрихкод, Количество, ЯчейкаКудаГУИД, ВведеноВРучную);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);				
			
			Прервать;
			                                                                   
		Исключение	
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");               		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ДобавитьТоварВБуферАРМКладовщика");
			
		КонецПопытки; 
		
	КонецЦикла;	
	
	Возврат РезультатОтвета;	
	
КонецФункции


//FindGoodByBarcode 
//|	ВТШтрихкоды.Ссылка КАК Владелец,
//|	ВТШтрихкоды.ТипСтрокиЗапроса,
//|	Номенклатура.Наименование,
//|	&Штрихкод КАК Штрихкод,
//|	Номенклатура.КодПроизводителя,
//|	ЕдиницыИзмерения.Наименование КАК ЕдИзмНаименование,
//|	Номенклатура.Код КАК Код,
//|	Номенклатура.Кратность КАК Кратность	
&НаСервере
Функция НайтиТоварПоШтрихкоду(Штрихкод, ТипДокумента, ДокументГУИД, ТоварГУИД, ПолучитьТабЗнач = Ложь) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета(); 
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл			
		
		Попытка
			
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			
			Ответ = WSПрокси.FindGoodByBarcode50(ПользовательГУИД, Штрихкод, ТипДокумента, ДокументГУИД, ТоварГУИД, ПолучитьТабЗнач);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);				
			
			Прервать;                                                                      
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "НайтиТоварПоШтрихкоду");
			
		КонецПопытки; 
		
	КонецЦикла;
	
	Возврат РезультатОтвета;
	                                                                        
КонецФункции

&НаСервере
Функция НайтиТоварПоGTIN(GTIN, ТипДокумента, ДокументГУИД, ТоварГУИД) Экспорт
	
	//+Шульман А. 20.11.2025 #UT10-5518
	РезультатОтвета = ПолучитьСтруктуруОтвета(); 
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл			
		
		Попытка
			
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			
			Ответ = WSПрокси.FindGoodByGTIN(ПользовательГУИД, GTIN, ТипДокумента, ДокументГУИД, ТоварГУИД);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);	
			
			Прервать;                                                                      
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "НайтиТоварПоGTIN");
			
		КонецПопытки; 
		
	КонецЦикла;
	
	Возврат РезультатОтвета;    
	//-Шульман А. 20.11.2025 #UT10-5518
	                                                                        
КонецФункции


&НаСервере
Функция НайтиТоварПоМаркировке(Штрихкод , ШтрихкодПолный ,  ТипДокумента , ДокументГУИД , ТоварГУИД , ПолучитьТабЗнач = Ложь) Экспорт

	РезультатОтвета = ПолучитьСтруктуруОтвета(); 
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл			
		
		Попытка
			
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			
			Ответ = WSПрокси.FindGoodByMark(ПользовательГУИД , Штрихкод , ШтрихкодПолный,  ТипДокумента , ДокументГУИД , ТоварГУИД , ПолучитьТабЗнач);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);				
			
			Прервать;                                                                      
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "НайтиТоварПоМаркировке");
			
		КонецПопытки; 
		
	КонецЦикла;
	
	Возврат РезультатОтвета;

КонецФункции

&НаСервере
Функция МаркировкаОтсканированнаВПТУ(ШтрихКодКраткий , ШтрихКодПолный , ДокументГУИД) Экспорт

	РезультатСтруктура = ОбщегоНазначения.ПолучитьОстатокПоВсемТоварамИзДокумента(ДокументГУИД);

	ЗапросМаркировкиВПТУ = Новый Запрос;
	ЗапросМаркировкиВПТУ.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокОтсканированныхМаркировокДокументаПТУ.КодМаркировки КАК КодМаркировки
	|ИЗ
	|	РегистрСведений.СписокОтсканированныхМаркировокДокументаПТУ КАК СписокОтсканированныхМаркировокДокументаПТУ
	|ГДЕ
	|	СписокОтсканированныхМаркировокДокументаПТУ.СсылкаПТУ = &ДокументГУИД
	|	И (СписокОтсканированныхМаркировокДокументаПТУ.ШтрихКод = &ШтрихКодКраткий
	|			ИЛИ СписокОтсканированныхМаркировокДокументаПТУ.ШтрихКод = &ШтрихКодПолный)" ;
	
	ЗапросМаркировкиВПТУ.УстановитьПараметр("ДокументГУИД"    , ДокументГУИД);
	ЗапросМаркировкиВПТУ.УстановитьПараметр("ШтрихКодКраткий" , ШтрихКодКраткий);
	ЗапросМаркировкиВПТУ.УстановитьПараметр("ШтрихКодПолный"  , ШтрихКодПолный);
	
	РезультатЗапроса = ЗапросМаркировкиВПТУ.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();

КонецФункции

&НаСервере
Функция МаркировкаЕстьВОжидаемых(ШтрихКодКраткий, ШтрихКодПолный, ДокументГУИД) Экспорт
	
	//+Шульман А. 17.03.2026 #UT10-5748
	Результат = Новый Структура("ЕстьМаркировка, Невалиден, Причина", Ложь, Ложь, ""); 
	//-Шульман А. 17.03.2026 #UT10-5748
	
	Набор = РегистрыСведений.СписокОжидаемыхМаркировокДокументаПТУ.СоздатьНаборЗаписей();
	Набор.Отбор.СсылкаПТУ.Установить(ДокументГУИД);
	Набор.Прочитать();
	
	Если Набор.Количество() = 0 Тогда   
		//+Шульман А. 17.03.2026 #UT10-5748
		//Возврат Истина;  
		Возврат Результат;   
		//-Шульман А. 17.03.2026 #UT10-5748
	КонецЕсли;
	
	ЗапросОбязательныхМаркировокВПТУ = Новый Запрос;
	ЗапросОбязательныхМаркировокВПТУ.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокОжидаемыхМаркировокДокументаПТУ.КодМаркировки КАК КодМаркировки,   
	//+Шульман А. 17.03.2026 #UT10-5748
	|	СписокОжидаемыхМаркировокДокументаПТУ.Невалиден КАК Невалиден,
	|	СписокОжидаемыхМаркировокДокументаПТУ.Причина КАК Причина    
	//-Шульман А. 17.03.2026 #UT10-5748
	|ИЗ
	|	РегистрСведений.СписокОжидаемыхМаркировокДокументаПТУ КАК СписокОжидаемыхМаркировокДокументаПТУ
	|ГДЕ
	|	СписокОжидаемыхМаркировокДокументаПТУ.СсылкаПТУ = &ДокументГУИД
	|	И (СписокОжидаемыхМаркировокДокументаПТУ.ШтрихКод = &ШтрихКодКраткий
	|			ИЛИ СписокОжидаемыхМаркировокДокументаПТУ.ШтрихКод = &ШтрихКодПолный)" ;
	
	ЗапросОбязательныхМаркировокВПТУ.УстановитьПараметр("ДокументГУИД"    , ДокументГУИД);
	ЗапросОбязательныхМаркировокВПТУ.УстановитьПараметр("ШтрихКодКраткий" , ШтрихКодКраткий);
	ЗапросОбязательныхМаркировокВПТУ.УстановитьПараметр("ШтрихКодПолный"  , ШтрихКодПолный);
	
	РезультатЗапроса = ЗапросОбязательныхМаркировокВПТУ.Выполнить(); 
	
	//+Шульман А. 17.03.2026 #UT10-5748
	//Возврат Не РезультатЗапроса.Пустой();   
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Результат.ЕстьМаркировка = Истина;
		Результат.Невалиден = Выборка.Невалиден;
		Результат.Причина = Выборка.Причина;   
		Возврат Результат;
	
	КонецЕсли;
	//-Шульман А. 17.03.2026 #UT10-5748    
	
КонецФункции

&НаСервере
Функция НайтиГМПоШтрихкоду(Штрихкод, ТипДокумента, ДокументГУИД, ПолучитьТабЗнач = Ложь) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета(); 
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл			
		
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";              
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.FindGMByBarcode(ПользовательГУИД, Штрихкод, ТипДокумента, ДокументГУИД, ПолучитьТабЗнач);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);				
			
			Прервать;                                                                      
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "НайтиГМПоШтрихкоду");
			
		КонецПопытки; 
		
	КонецЦикла;
	
	Возврат РезультатОтвета;
	                                                                        
КонецФункции

&НаСервере
Функция ОтправитьЛогиТСДвУТ10() Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета(); 
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	//+Шульман А. 05.12.2025 #UT10-5576
	//ТЗ = ВыгрузитьРегистрСведений("ЛогОшибок");
	ТЗ = ВыгрузитьРегистрСведений("РасширенныйЛог");       
	//-Шульман А. 05.12.2025 #UT10-5576
	
	Если ТЗ.Количество() = 0 Тогда
		
		РезультатОтвета.Вставить("Ошибка", "Отсутствуют логи ТСД. Отправка невозможна.");
		Возврат РезультатОтвета;
		
	КонецЕсли; 
	
	ТЗ.Сортировать("НомерЗаписи");   
	
	//+Шульман А. 05.12.2025 #UT10-5576
	НомерЗаписи = 1;  
	
	Для каждого тзСтрока Из ТЗ Цикл
		
		тзСтрока.НомерЗаписи = НомерЗаписи;    
		НомерЗаписи = НомерЗаписи + 1;
		
	КонецЦикла;
	//-Шульман А. 05.12.2025 #UT10-5576
	
	ТЗ.Колонки.Добавить("ДатаСоздания", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки()));		
	
	Для каждого Строка Из ТЗ Цикл  
		//+Шульман А. 05.12.2025 #UT10-5576
		//Строка.ДатаСоздания = Строка(Строка.Период);     
		Строка.ДатаСоздания = Строка(Строка.ДатаЗаписи);   
		//-Шульман А. 05.12.2025 #UT10-5576
	КонецЦикла; 
	
	//ТЗ = ТЗ.Скопировать( , "ДатаСоздания, Индентификатор, Комментарий, Событие, ФункцияИсточник");
	Результат = ТаблицуВМассив(ТЗ);
	СериализованныеЛоги = ДанныеВJSONХранилище( Результат );
		
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл			
		
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";              
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.SendLogsFromTSD(ПользовательГУИД, СериализованныеЛоги);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);				
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка отправки логов ТСД.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка отправки данных." + ОписаниеОшибки(), "SendLogsFromTSD");
			
		КонецПопытки; 
		
	КонецЦикла;
	
	Возврат РезультатОтвета;
	
КонецФункции 

&НаСервере
Функция НайтиТоварПоШтрихкодуСОстатками(Штрихкод, ТоварГУИД) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета(); 
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл			
		
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";              
			//WSПрокси.Пароль = "web";		
			                 
			Ответ = WSПрокси.FindGoodByBarcodeWithRemains(Штрихкод, ТоварГУИД, ПользовательГУИД);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);				
			Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				ЗаписатьРегистрСведений("СписокНайденныхТоваровПоШтрихкоду", РезультатОтвета.Данные);
			КонецЕсли; 
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "НайтиТоварПоШтрихкоду");
			
		КонецПопытки; 
		
	КонецЦикла;
	
	Возврат РезультатОтвета;
	                                                                       
КонецФункции

&НаСервере
Функция ЗаменитьНедопустимыеСимволыXML(Знач Текст, СимволЗамены = "") Экспорт
	
	ПозицияНачала = 1;
	
	Пока Истина Цикл
		
		Позиция = НайтиНедопустимыеСимволыXML(Текст, ПозицияНачала);
		
		Если Позиция = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Если Позиция > 1 Тогда
			
			НедопустимыйСимвол = Сред(Текст, Позиция - 1, 1);
			
			Если НайтиНедопустимыеСимволыXML(НедопустимыйСимвол) > 0 Тогда
				Текст = СтрЗаменить(Текст, НедопустимыйСимвол, СимволЗамены);
			КонецЕсли;
			
		КонецЕсли;
		
		НедопустимыйСимвол = Сред(Текст, Позиция, 1);
		
		Если НайтиНедопустимыеСимволыXML(НедопустимыйСимвол) > 0 Тогда
			Текст = СтрЗаменить(Текст, НедопустимыйСимвол, СимволЗамены);
		КонецЕсли;
		
		ПозицияНачала = Позиция + 1;
		
	КонецЦикла;

	Возврат Текст;

КонецФункции

&НаСервере                                                                   
Функция ПолучитьЗначениеШтрихкода(Значение, СимволЗамены = "") Экспорт
	
	//+Шульман А. 05.12.2025 #UT10-5576           
	ЗаписыватьРасширенныеЛоги = Константы.ЗаписыватьРасширенныеЛоги.Получить();
	
	//Если ЗаписыватьРасширенныеЛоги Тогда    
	//	ASK_ОбработкаОшибок.ПолучитьСтекВызовов("ПолучитьЗначениеШтрихкода", "Начало", Истина);     
	//КонецЕсли;       
	//-Шульман А. 05.12.2025 #UT10-5576
	
	Структура  = Новый Структура("Ошибка, Штрихкод", "", ""); 	    

	Попытка

		СимволРазделитель = Символ(29);
		Пока НЕ СтрНайти(Значение,СимволРазделитель) = 0 Цикл
			Значение = СтрЗаменить(Значение,СимволРазделитель, СимволЗамены);
		КонецЦикла;
		
		СимволРазделитель = "&#29;";
		Пока НЕ СтрНайти(Значение,СимволРазделитель) = 0 Цикл
			Значение = СтрЗаменить(Значение,СимволРазделитель, СимволЗамены);
		КонецЦикла;

	    Значение = ЗаменитьНедопустимыеСимволыXML(Значение);

		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(Значение);
		
		ПостроительDOM = Новый ПостроительDOM;			
		ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
		
		//Разыменователь = Новый РазыменовательПространствИменDOM(ДокументDOM);
		РазыменовательПИ = ДокументDOM.СоздатьРазыменовательПИ(ДокументDOM);
		ЗапросXPath = "/MessageData/FilterData";
		Путь = ДокументDOM.СоздатьВыражениеXPath(ЗапросXPath, РазыменовательПИ);			
		РезультатPath = Путь.Вычислить(ДокументDOM);    
		ОбработкаРезультата = РезультатPath.ПолучитьСледующий();
			
	Исключение                                                   
		
		Если ЗаписыватьРасширенныеЛоги Тогда    
			ASK_ОбработкаОшибок.ПолучитьСтекВызовов("ПолучитьЗначениеШтрихкода", "Ошибка " + ОписаниеОшибки(), Истина);     
		КонецЕсли;       
		
		Структура.Вставить("Ошибка", ОписаниеОшибки());
		Возврат Структура;
		
	КонецПопытки; 
	
	Если ОбработкаРезультата.ТекстовоеСодержимое = "READ_FAIL" Тогда
		
		Структура.Вставить("Ошибка", "Ошибка сканирования штрихкода - " + ОбработкаРезультата.ТекстовоеСодержимое + " "+СокрЛП(Значение));
		Возврат Структура;
		
	КонецЕсли;             	
	
	Структура.Вставить("Штрихкод", ОбработкаРезультата.ТекстовоеСодержимое);
	
	//+Шульман А. 05.12.2025 #UT10-5576           
	//Если ЗаписыватьРасширенныеЛоги Тогда    
	//	ASK_ОбработкаОшибок.ПолучитьСтекВызовов("ПолучитьЗначениеШтрихкода", ОбработкаРезультата.ТекстовоеСодержимое, Истина);     
	//КонецЕсли;       
	//-Шульман А. 05.12.2025 #UT10-5576           
	
	Возврат Структура;
	
КонецФункции

&НаСервере
Функция ЭтоШтрихКодМаркировки(ПромШтрихКод, ЧастиКода, ЗамерятьВремя = Ложь) Экспорт 
	
	//ASK_ОбработкаОшибок.Ошибка("начало", ПромШтрихКод, "ЭтоШтрихКодМаркировки");
	
	СтруктураШтрихКодаМаркировки = Новый Структура;
	СтруктураШтрихКодаМаркировки.Вставить("Результат" , Ложь);
	СтруктураШтрихКодаМаркировки.Вставить("ШтрихКод"  , ПромШтрихКод);
	
	//+Шульман А. 17.11.2025 #UT10-5516           
	//Если (Лев(ПромШтрихКод , 2) = "01" И Сред(ПромШтрихКод,17,2) = "21") Или (Лев(ПромШтрихКод , 4) = "(01)" И Сред(ПромШтрихКод,19,4) = "(21)") Тогда
	//	
	//	СтруктураШтрихКодаМаркировки.Вставить("Результат"       , Истина); 
	//	
	//	ПростойВидШтрихКода = Лев(ПромШтрихКод , 2) = "01";                
	//	
	//	//Получаем оба вида штрих-кода
	//	Если ПростойВидШтрихКода Тогда
	//		
	//		СтруктураШтрихКодаМаркировки.Вставить("ШтрихКодКраткий" , Лев(ПромШтрихКод , 31));
	//		ПромШтрихКодПолный = "(01)" + Сред(ПромШтрихКод,3,14) + "(21)" + Сред(ПромШтрихКод , 19 , 13);
	//		СтруктураШтрихКодаМаркировки.Вставить("ШтрихКодПолный"  , ПромШтрихКодПолный);
	//		
	//	Иначе 

	//		СтруктураШтрихКодаМаркировки.Вставить("ШтрихКодПолный"  , Лев(ПромШтрихКод , 35));
	//		ПромШтрихКодКраткий =  "01" + Сред(ПромШтрихКод,5,14) + "21" + Сред(ПромШтрихКод , 23 , 13);
	//		СтруктураШтрихКодаМаркировки.Вставить("ШтрихКодКраткий" , ПромШтрихКодКраткий);
	//		
	//	КонецЕсли;

	//	// Выделяем GTIN
	//	СтруктураШтрихКодаМаркировки.Вставить("GTIN"                , Сред(СтруктураШтрихКодаМаркировки.ШтрихКодКраткий , 3 , 14));

	//Иначе
	//	СтруктураШтрихКодаМаркировки.Вставить("Результат" , Ложь); 
	//КонецЕсли;
		
	ДанныеШтрихкода = РазложитьКодМаркировки(ПромШтрихКод, ЧастиКода, ЗамерятьВремя);  
	
	СтруктураШтрихКодаМаркировки.Вставить("ПройденаПроверкаКраткогоКода", ДанныеШтрихкода.ПройденаПроверкаКраткогоКода);
	СтруктураШтрихКодаМаркировки.Вставить("ТекстОшибки", ДанныеШтрихкода.ТекстОшибки);
	
	Если ДанныеШтрихкода.ЭтоКодМаркировки Тогда       
		
		СтруктураШтрихКодаМаркировки.Вставить("Результат",       Истина); 
		СтруктураШтрихКодаМаркировки.Вставить("ШтрихКодКраткий", ДанныеШтрихкода.ШтрихКодКраткий);
		СтруктураШтрихКодаМаркировки.Вставить("ШтрихКодПолный",  ДанныеШтрихкода.ШтрихКодПолный); 
		СтруктураШтрихКодаМаркировки.Вставить("GTIN",            ДанныеШтрихкода.ЧастиКода.GTIN);  
		СтруктураШтрихКодаМаркировки.Вставить("ЧастиКода",       ДанныеШтрихкода.ЧастиКода);    
		
	Иначе
		
		СтруктураШтрихКодаМаркировки.Вставить("Результат" , Ложь); 
		СтруктураШтрихКодаМаркировки.Вставить("ЧастиКода",       ДанныеШтрихкода.ЧастиКода);    
		СтруктураШтрихКодаМаркировки.Вставить("ШтрихКодКраткий", ДанныеШтрихкода.ШтрихКодКраткий);
		СтруктураШтрихКодаМаркировки.Вставить("ШтрихКодПолный",  ДанныеШтрихкода.ШтрихКодПолный); 
		
	КонецЕсли;   
	
	Если ЗамерятьВремя Тогда
		СтруктураШтрихКодаМаркировки.Вставить("ЗамерыВремени", ДанныеШтрихкода.ЗамерыВремени);
	КонецЕсли;
	//-Шульман А. 17.11.2025 #UT10-5516         
		
	Возврат СтруктураШтрихКодаМаркировки;
	
КонецФункции

Функция ПроверитьСостояниеКМ(КодМаркировки) Экспорт
	
	//+Шульман А. 13.11.2025 #UT10-5504  
	РезультатПроверкиКМ = Новый Структура("ТекстОшибки, Действие, СостояниеКМ", "", "", "");
	
	Метод = "/api/v1/km_info?orgId=" + Константы.КодМДМГоловнойОрганизации.Получить();
	АдресСервиса = Константы.АдресСервераЧестныйЗнак.Получить();     // "10.90.100.31:30209";    
	
	Если ПустаяСтрока(АдресСервиса) Тогда
		АдресСервиса = "10.90.100.31:30209";
	КонецЕсли;   
	
	Соединение = Новый HTTPСоединение(АдресСервиса,,,,,, ); //Новый ЗащищенноеСоединениеOpenSSL());
	
	МассивКодов = Новый Массив;  
	МассивКодов.Добавить(КодМаркировки);     
	
	ПараметрыЗапроса = Новый Структура();  
	ПараметрыЗапроса.Вставить("codes", МассивКодов);     
	Отказ = Ложь;
	
	Попытка

		СтрокаЗапроса = ОбщегоНазначения.ВернутьJSON(ПараметрыЗапроса);
		
		Заголовки = Новый Соответствие;  
		Заголовки.Вставить("Content-type", "application/json");
		Заголовки.Вставить("Cache-Control", "no-cache");  
		
		HTTPЗапрос = Новый HTTPЗапрос();  
		HTTPЗапрос.АдресРесурса = Метод;
		HTTPЗапрос.Заголовки = Заголовки;     

    	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаЗапроса);
    	Результат  = Соединение.ОтправитьДляОбработки(HTTPЗапрос);     //Получить(HTTPЗапрос)
		
	Исключение
		
		РезультатПроверкиКМ.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());    
		РезультатПроверкиКМ.Действие = "Обработать ошибку сервиса";  
		Возврат РезультатПроверкиКМ;
		
	КонецПопытки;
		
	Ответ = ОбщегоНазначения.HTTPОтветВСтруктуру(Результат);  

	Если Не Ответ.КодСостояния = 200 Тогда   
		
		РезультатПроверкиКМ.ТекстОшибки = "Ошибка при чтении данных. Код состояния " + Ответ.КодСостояния;  
		Отказ = Истина;
	
	ИначеЕсли Не Ответ.Свойство("Тело") Тогда   
		
		РезультатПроверкиКМ.ТекстОшибки = "Не возвращены данные по запросу";   
		Отказ = Истина;
	
	ИначеЕсли ПустаяСтрока(Ответ.Тело) Тогда
		
		РезультатПроверкиКМ.ТекстОшибки = "Возвращено пустое тело по запросу";   
		Отказ = Истина;     
		
	КонецЕсли;
	
	Если Отказ Тогда
	
		РезультатПроверкиКМ.Действие = "Обработать ошибку сервиса";  
		Возврат РезультатПроверкиКМ;
		
	КонецЕсли;
		
	Попытка
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Ответ.Тело);    
		
	Исключение
		
		РезультатПроверкиКМ.ТекстОшибки = "Ошибка при разборе JSON-данных";  
		Возврат РезультатПроверкиКМ;
		
	КонецПопытки;
	
	СтруктураДанных = ПрочитатьJSON(ЧтениеJSON, Ложь);     
	
	Если Не СтруктураДанных.Свойство("list") Тогда
		
		РезультатПроверкиКМ.ТекстОшибки = "Ошибка при разборе JSON-данных";  
		РезультатПроверкиКМ.Действие = "Обработать ошибку сервиса";     
		Возврат РезультатПроверкиКМ;
		
	КонецЕсли;
	
	СоответствиеСтатусов = Новый Соответствие; 
	СоответствиеСтатусов.Вставить("EMITTED",     "Эмитирован");
	СоответствиеСтатусов.Вставить("APPLIED",     "Нанесён");
	СоответствиеСтатусов.Вставить("INTRODUCED",  "В обороте");
	СоответствиеСтатусов.Вставить("WRITTEN_OFF", "Списан");
	
	Для каждого ЭлементМассива Из СтруктураДанных.list Цикл
		
		Если КодМаркировки = ЭлементМассива.requestedCis Тогда
			
			мСостояниеКМ = СоответствиеСтатусов.Получить(ЭлементМассива.status);   
			РезультатПроверкиКМ.СостояниеКМ = ?(мСостояниеКМ = Неопределено, ЭлементМассива.status, мСостояниеКМ);
			
			Если ЭлементМассива.status = "INTRODUCED" Тогда
				РезультатПроверкиКМ.Действие = "Обработать код в обороте";
			Иначе
				РезультатПроверкиКМ.Действие = "Обработать код не в обороте";
			КонецЕсли;
			
			Возврат РезультатПроверкиКМ;
			
		КонецЕсли;
		
	КонецЦикла;
	
	РезультатПроверкиКМ.ТекстОшибки = "Нет переданного кода маркировки в полученных данных";  
	РезультатПроверкиКМ.Действие = "Обработать ошибку сервиса";   
	
	Возврат РезультатПроверкиКМ;
	//-Шульман А. 13.11.2025 #UT10-5504

КонецФункции // ()

Функция РазложитьКодМаркировки(ПромШтрихКод, ЧастиКода, ЗамерятьВремя = Ложь) Экспорт
	
	//+Шульман А. 17.11.2025 #UT10-5516	                                  
	//ASK_ОбработкаОшибок.Ошибка("начало", ПромШтрихКод, "РазложитьКодМаркировки");
	РасширеннаяПроверкаВалидности = Константы.РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ.Получить();
	
	//+Сёмин Р.И. 29.04.2026 #UT10-5814
	ИспользоватьНовыйМеханизмПроверкиКодовМаркировки = Константы.ИспользоватьНовыйМеханизмПроверкиКодовМаркировки.Получить();
	//-Сёмин Р.И. 29.04.2026 #UT10-5814
	
	ДанныеШтрихкода = Новый Структура("ЭтоКодМаркировки, ПройденаПроверкаКраткогоКода, ШтрихКодКраткий, ШтрихКодПолный, ЧастиКода", Ложь, Ложь, "", "", ЧастиКода);  
	ДанныеШтрихкода.Вставить("ТекстОшибки", "");
	ПровКод = ПромШтрихКод;
	
	НачВремя = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ТекВремя = 0;
	
	Если ЗамерятьВремя Тогда
		
		ЗамерыВремени = Новый Структура();   
		ДанныеШтрихкода.Вставить("ЗамерыВремени", ЗамерыВремени);                           
		
		ЗамерыВремени.Вставить("НачалоПроверкиВалидности", 0);  
	
	КонецЕсли;
	
	//+Шульман А. 17.12.2025 #UT10-5597
	//Если РасширеннаяПроверкаВалидности И (Не ЧастиКода.Свойство("GS1") Или Не ЧастиКода.Свойство("GS2")) Тогда   
	Если РасширеннаяПроверкаВалидности И Не ЧастиКода.Свойство("GS1") Тогда     
	//-Шульман А. 17.12.2025 #UT10-5597    
		ДанныеШтрихкода.Вставить("ТекстОшибки", "Нет GS1");
		Возврат ДанныеШтрихкода;
	КонецЕсли;
	
	Если РасширеннаяПроверкаВалидности И ЧастиКода.Свойство("GS3") Тогда  
		ДанныеШтрихкода.Вставить("ТекстОшибки", "Лишние GS");
		Возврат ДанныеШтрихкода;
	КонецЕсли;
	
	
	// Проверка 01 
	ЕстьСкобки = Ложь;
	
	Если Лев(ПровКод, 2) = "01" Тогда     
		
		ЧастиКода.Вставить("S01", Лев(ПровКод, 2));   
		ПровКод = Сред(ПровКод, 3);   
		
	ИначеЕсли Лев(ПровКод, 4) = "(01)" Тогда     
		
		ЧастиКода.Вставить("S01", Лев(ПровКод, 4));    
		ПровКод = Сред(ПровКод, 5);   
		ЕстьСкобки = Истина;
		
	Иначе                       
		ДанныеШтрихкода.Вставить("ТекстОшибки", "Нет 01");
		Возврат ДанныеШтрихкода;
	КонецЕсли;
	
	Если ЗамерятьВремя Тогда
		
		ВремяСНачала = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачВремя;
		ЗамерыВремени.Вставить("S01", ВремяСНачала - ТекВремя);    
		ТекВремя = ЗамерыВремени.S01;
		
	КонецЕсли;

	//GTINGTINGTINGT21SERIALSERIALSx91KEYKx92CRIPTOCRIPT...
	ЧастиКода.Вставить("GTIN", Лев(ПровКод, 14));  
	ПровКод = Сред(ПровКод, 15);   
	
	Если ПустаяСтрока(ПровКод) Тогда   
		ДанныеШтрихкода.Вставить("ТекстОшибки", "Длина кода " + СтрДлина(ПромШтрихКод) + " меньше ожидаемой");
		Возврат ДанныеШтрихкода;
	КонецЕсли;
	
	Если ЗамерятьВремя Тогда
		
		ВремяСНачала = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачВремя;
		
		ЗамерыВремени.Вставить("GTIN", ВремяСНачала - ТекВремя); 
		ТекВремя = ЗамерыВремени.GTIN;
		
	КонецЕсли;
	
	//21SERIALSERIALSX91KEYKx92CRIPTOCRIPT...
	Если Лев(ПровКод, 2) = "21" И Не ЕстьСкобки Тогда     
		
		ЧастиКода.Вставить("S21", Лев(ПровКод, 2));
		ПровКод = Сред(ПровКод, 3);   
		
	ИначеЕсли Лев(ПровКод, 4) = "(21)" И ЕстьСкобки Тогда     
		
		ЧастиКода.Вставить("S21", Лев(ПровКод, 4));
		ПровКод = Сред(ПровКод, 5);   
		
	Иначе         
		ДанныеШтрихкода.Вставить("ТекстОшибки", "Нет 21");
		Возврат ДанныеШтрихкода;
	КонецЕсли;
	
	Если ЗамерятьВремя Тогда
		
		ВремяСНачала = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачВремя;
		
		ЗамерыВремени.Вставить("S21", ВремяСНачала - ТекВремя);   
		ТекВремя = ЗамерыВремени.S21;

	КонецЕсли;
	
	//SERIALSERIALSx91KEYKx92CRIPTOCRIPT...
	//+Сёмин Р.И. 29.04.2026 #UT10-5814
	//ЧастиКода.Вставить("SERIAL", Лев(ПровКод, 13));
	
	ДлинаЧастиSERIAL = Неопределено;
	
	Если ИспользоватьНовыйМеханизмПроверкиКодовМаркировки И ЧастиКода.Свойство("GS1") И ЗначениеЗаполнено(ЧастиКода.GS1) Тогда
		
		ДлинаЧастиSERIAL = СтрДлина(ПровКод) + ЧастиКода.GS1 - 1 - СтрДлина(ПромШтрихКод);
		
		Если ДлинаЧастиSERIAL >= 6 И ДлинаЧастиSERIAL <= 20 Тогда
			ЧастиКода.Вставить("SERIAL", Лев(ПровКод, ДлинаЧастиSERIAL));
		Иначе
			
			ДанныеШтрихкода.Вставить("ТекстОшибки", "Некорректная длина части SERIAL");
			Возврат ДанныеШтрихкода;
			
		КонецЕсли;
		
	Иначе
		ЧастиКода.Вставить("SERIAL", Лев(ПровКод, 13));
	КонецЕсли;
	//-Сёмин Р.И. 29.04.2026 #UT10-5814
	
	ДанныеШтрихкода.ШтрихКодКраткий = "01" + ЧастиКода.GTIN + "21" + ЧастиКода.SERIAL;
	ДанныеШтрихкода.ШтрихКодПолный  = "(01)" + ЧастиКода.GTIN + "(21)" + ЧастиКода.SERIAL;   
	ДанныеШтрихкода.ПройденаПроверкаКраткогоКода = Истина;
	
	Если ЗамерятьВремя Тогда
		
		ВремяСНачала = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачВремя;
		
		ЗамерыВремени.Вставить("SERIAL", ВремяСНачала - ТекВремя);   
		ТекВремя = ЗамерыВремени.SERIAL;
		
	КонецЕсли;
	
	Если Не РасширеннаяПроверкаВалидности Тогда   
		
		// Если не стоит константа РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ, то проверку заканчиваем
		ДанныеШтрихкода.ЭтоКодМаркировки = Истина;  
		
		Если ЗамерятьВремя Тогда   
			
			ВремяСНачала = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачВремя;
			ДанныеШтрихкода.ЗамерыВремени.Вставить("ОкончаниеПроверкиВалидности", ВремяСНачала - ТекВремя);    
			
		КонецЕсли;
		
		Возврат ДанныеШтрихкода;        
		
	КонецЕсли;
	
	// Если указана константа РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ, то правильным считается только полный штрихкод
	//+Сёмин Р.И. 29.04.2026 #UT10-5814
	//ПровКод = Сред(ПровКод, 14);
	
	Если ЗначениеЗаполнено(ДлинаЧастиSERIAL) Тогда
		ПровКод = Сред(ПровКод, ДлинаЧастиSERIAL + 1);
	Иначе
		ПровКод = Сред(ПровКод, 14);
	КонецЕсли;
	//-Сёмин Р.И. 29.04.2026 #UT10-5814
	
	Если ПустаяСтрока(ПровКод) Тогда   
		
		Если ЗамерятьВремя Тогда   
			
			ВремяСНачала = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачВремя;
			ДанныеШтрихкода.ЗамерыВремени.Вставить("ОкончаниеПроверкиВалидности", ВремяСНачала - ТекВремя);    
			
		КонецЕсли;
		
		ДанныеШтрихкода.Вставить("ТекстОшибки", "Короткий код. Нет 91, 93");
		Возврат ДанныеШтрихкода;
		
	КонецЕсли;
	
	//91KEYKx92CRIPTOCRIPT...    
	ЭтоКод93 = Истина;
	
	Если Лев(ПровКод, 2) = "91" И Не ЕстьСкобки Тогда     
		
		ЧастиКода.Вставить("S91", Лев(ПровКод, 2));
		
		Поз91 = СтрНайти(ПромШтрихКод, ПровКод);
		
		Если Не ЧастиКода.GS1 = Строка(Поз91) И РасширеннаяПроверкаВалидности Тогда 
			ДанныеШтрихкода.Вставить("ТекстОшибки", "GS1 не в той позиции. Ожидаемая позиция " + Строка(Поз91));
           	Возврат ДанныеШтрихкода;
		КонецЕсли;
		
		ПровКод = Сред(ПровКод, 3); 
		ЭтоКод93 = Ложь;
		
	ИначеЕсли Лев(ПровКод, 4) = "(91)" И ЕстьСкобки Тогда     
		
		ЧастиКода.Вставить("S91", Лев(ПровКод, 4));
		
		Поз91 = СтрНайти(ПромШтрихКод, ПровКод);
		
		Если Не ЧастиКода.GS1 = Строка(Поз91) И РасширеннаяПроверкаВалидности Тогда  
			ДанныеШтрихкода.Вставить("ТекстОшибки", "GS1 не в той позиции. Ожидаемая позиция " + Строка(Поз91));
           	Возврат ДанныеШтрихкода;
		КонецЕсли;
		
		ПровКод = Сред(ПровКод, 5); 
		ЭтоКод93 = Ложь;   
		
	КонецЕсли;
	
	Если ЗамерятьВремя И Не ЭтоКод93 Тогда
		
		ВремяСНачала = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачВремя;
		
		ЗамерыВремени.Вставить("S91", ВремяСНачала - ТекВремя);   
		ТекВремя = ЗамерыВремени.S91;

	КонецЕсли;
	
	Если ЭтоКод93 Тогда
		
		//93KEYK    
		Если Лев(ПровКод, 2) = "93" И Не ЕстьСкобки Тогда     
			
			ЧастиКода.Вставить("S93", Лев(ПровКод, 2));  
			Поз91 = СтрНайти(ПромШтрихКод, ПровКод);
			
			Если РасширеннаяПроверкаВалидности И (Не ЧастиКода.GS1 = Строка(Поз91) Или ЧастиКода.Свойство("GS2")) Тогда  
				ДанныеШтрихкода.Вставить("ТекстОшибки", "GS1 не в той позиции. Ожидаемая позиция " + Строка(Поз91));
	           	Возврат ДанныеШтрихкода;
			КонецЕсли;
			
			ПровКод = Сред(ПровКод, 3); 
			
		ИначеЕсли Лев(ПровКод, 4) = "(93)" И ЕстьСкобки Тогда     
			
			ЧастиКода.Вставить("S93", Лев(ПровКод, 4));   
			Поз91 = СтрНайти(ПромШтрихКод, ПровКод);
			
			Если РасширеннаяПроверкаВалидности И (Не ЧастиКода.GS1 = Строка(Поз91) Или ЧастиКода.Свойство("GS2")) Тогда  
				ДанныеШтрихкода.Вставить("ТекстОшибки", "GS1 не в той позиции. Ожидаемая позиция " + Строка(Поз91));
	           	Возврат ДанныеШтрихкода;
			КонецЕсли;
			
			ПровКод = Сред(ПровКод, 5); 
			
		Иначе                      
			
			Если ЗамерятьВремя Тогда   
				
				ВремяСНачала = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачВремя;
				ДанныеШтрихкода.ЗамерыВремени.Вставить("ОкончаниеПроверкиВалидности", ВремяСНачала - ТекВремя);    
				
			КонецЕсли;
			
			ДанныеШтрихкода.Вставить("ТекстОшибки", "Нет 91, 93");
			Возврат ДанныеШтрихкода;  
			
		КонецЕсли;                          
		
		Если ЗамерятьВремя Тогда
			
			ВремяСНачала = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачВремя;
			
			ЗамерыВремени.Вставить("S93", ВремяСНачала - ТекВремя);   
			ТекВремя = ЗамерыВремени.S93;

		КонецЕсли;
		
	КонецЕсли;                          
	
	//+Шульман А. 17.12.2025 #UT10-5597
	Если РасширеннаяПроверкаВалидности И Не ЧастиКода.Свойство("GS2") Тогда  
		
		Если ЭтоКод93 Тогда  
			ДанныеШтрихкода.ЭтоКодМаркировки = Истина; 
		Иначе
			ДанныеШтрихкода.Вставить("ТекстОшибки", "Нет GS2");
		КонецЕсли;
		
		Возврат ДанныеШтрихкода;  
		
	КонецЕсли;      
	//-Шульман А. 17.12.2025 #UT10-5597
	
	//KEYKx92CRIPTOCRIPT... 
	ЧастиКода.Вставить("KEY", Лев(ПровКод, 4));   
	ПровКод = Сред(ПровКод, 5); 
	
	Если ЗамерятьВремя Тогда
		
		ВремяСНачала = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачВремя;
		
		ЗамерыВремени.Вставить("KEY", ВремяСНачала - ТекВремя);   
		ТекВремя = ЗамерыВремени.KEY;

	КонецЕсли;
	
	Если ПустаяСтрока(ПровКод) Тогда    
		
		ДанныеШтрихкода.ЭтоКодМаркировки = Истина;     
		
		Если ЗамерятьВремя Тогда   
			
			ВремяСНачала = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачВремя;
			ДанныеШтрихкода.ЗамерыВремени.Вставить("ОкончаниеПроверкиВалидности", ВремяСНачала - ТекВремя);    
			
		КонецЕсли;
		
		Возврат ДанныеШтрихкода;        
		
	КонецЕсли;
	
	
	//92CRIPTOCRIPT... 
	Если Лев(ПровКод, 2) = "92" И Не ЕстьСкобки Тогда     
		
		ЧастиКода.Вставить("S92", Лев(ПровКод, 2));  
		
		Поз92 = СтрНайти(ПромШтрихКод, ПровКод);
		
		Если Не ЧастиКода.GS2 = Строка(Поз92) И РасширеннаяПроверкаВалидности Тогда    
			ДанныеШтрихкода.Вставить("ТекстОшибки", "GS2 не в той позиции. Ожидаемая позиция " + Строка(Поз92));
           	Возврат ДанныеШтрихкода;
		КонецЕсли;
		
		ПровКод = Сред(ПровКод, 3);  
		
	ИначеЕсли Лев(ПровКод, 4) = "(92)" И ЕстьСкобки Тогда     
		
		ЧастиКода.Вставить("S92", Лев(ПровКод, 4));  
		
		Поз92 = СтрНайти(ПромШтрихКод, ПровКод);
		
		Если Не ЧастиКода.GS2 = Строка(Поз92) И РасширеннаяПроверкаВалидности Тогда   
			ДанныеШтрихкода.Вставить("ТекстОшибки", "GS2 не в той позиции. Ожидаемая позиция " + Строка(Поз92));
           	Возврат ДанныеШтрихкода;
		КонецЕсли;
		
		ПровКод = Сред(ПровКод, 5); 
		
	Иначе               
		
		Если ЗамерятьВремя Тогда   
			
			ВремяСНачала = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачВремя;
			ДанныеШтрихкода.ЗамерыВремени.Вставить("ОкончаниеПроверкиВалидности", ВремяСНачала - ТекВремя);    
			
		КонецЕсли;
		
		ДанныеШтрихкода.Вставить("ТекстОшибки", "Нет 92");
		Возврат ДанныеШтрихкода;        
		
	КонецЕсли;
	
	Если ЗамерятьВремя Тогда
		
		ВремяСНачала = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачВремя;
		
		ЗамерыВремени.Вставить("S92", ВремяСНачала - ТекВремя);   
		ТекВремя = ЗамерыВремени.S92;

	КонецЕсли;
	
	//CRIPTOCRIPT... 
	Если СтрДлина(ПровКод) = 44 Или СтрДлина(ПровКод) = 88 Тогда
		
		ЧастиКода.Вставить("CRIPTO", ПровКод);
		ДанныеШтрихкода.ЭтоКодМаркировки = Истина;
		
		Если ЗамерятьВремя Тогда
			
			ВремяСНачала = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачВремя;
			
			ЗамерыВремени.Вставить("CRIPTO", ВремяСНачала - ТекВремя);   
			ТекВремя = ЗамерыВремени.CRIPTO;

		КонецЕсли;
		
	Иначе
		ДанныеШтрихкода.Вставить("ТекстОшибки", "Неправильная длина криптохвоста: " + СтрДлина(ПровКод));
	КонецЕсли;
	
	Если ЗамерятьВремя Тогда   
		
		ВремяСНачала = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачВремя;
		ДанныеШтрихкода.ЗамерыВремени.Вставить("ОкончаниеПроверкиВалидности", ВремяСНачала - ТекВремя);    
		
	КонецЕсли;
	
	Возврат ДанныеШтрихкода;     
	//-Шульман А. 17.11.2025 #UT10-5516
	
КонецФункции // ()


Функция ПолучитьСтруктуруЧастиКода() Экспорт
	
	//+Шульман А. 17.11.2025 #UT10-5516	                                  
	//x01GTINGTINGTINGT21SERIALSERIALSx91KEYKx92CRIPTOCRIPT...     
	ЧастиКода = Новый Структура;
	ЧастиКода.Вставить("FNC1", 0);    
	
	Возврат ЧастиКода;
	//-Шульман А. 17.11.2025 #UT10-5516	                                  

КонецФункции // ()

&НаСервере
Функция ПолучитьСтруктуруОтвета()
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Ошибка", "");
	СтруктураОтвета.Вставить("Результат", Ложь);	
	СтруктураОтвета.Вставить("Данные", "");
	СтруктураОтвета.Вставить("ТипДанныхРезультат", "");
	
	Возврат СтруктураОтвета;
	
КонецФункции
  
&НаСервере
Функция ПолучитьНайденныеТоварыПоВведенномуЗначению(ЗначениеДляПоиска, ТипДокумента, ДокументГУИД, ТоварГУИД= "") Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл			
		
		Попытка
			WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , , ПолучитьTimeout());
			WSПрокси = Новый WSПрокси(WSОпределение, WSОпределение.Сервисы[0].URIПространстваИмен, WSОпределение.Сервисы[0].Имя, WSОпределение.Сервисы[0].Имя + "Soap" );			
			//WSПрокси.Пользователь = "webadmin";              
			//WSПрокси.Пароль = "web";		
									 
			Ответ = WSПрокси.FindGoodByBarcode50(ЗначениеДляПоиска, ТипДокумента, ДокументГУИД, ТоварГУИД);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);

			Прервать;
			
		Исключение                                                                          
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");               		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьНайденныеТоварыПоВведенномуЗначению");
			
		КонецПопытки;  
				
	КонецЦикла;
	
	Возврат РезультатОтвета;
	
КонецФункции

&НаСервере
Функция ОбработатьОтветWebService(РезультатОтвета, Ответ)
 
	Если ТипЗнч(Ответ) = Тип("ХранилищеЗначения") Тогда
		
		Данные = ХранилищеJSONВСтруктуру(Ответ);
		ЗначениеОшибки = "";
		
		Если ТипЗнч(Данные) = Тип("Структура") и Данные.Свойство("Ошибка",ЗначениеОшибки)  Тогда
			
			Если ЗначениеЗаполнено(ЗначениеОшибки) Тогда				
				
				РезультатОтвета.Вставить("Результат", Ложь);
				РезультатОтвета.Вставить("Ошибка", Данные.Ошибка);				
				Возврат РезультатОтвета;
				
			КонецЕсли; 
			
		КонецЕсли; 				
		
		РезультатОтвета.Вставить("Данные", Данные);
		РезультатОтвета.Вставить("Результат", Истина);
		
	ИначеЕсли ТипЗнч(Ответ) = Тип("Строка") И ЗначениеЗаполнено(Ответ) Тогда
			
		РезультатОтвета.Вставить("Данные", Ответ);							
		РезультатОтвета.Вставить("Результат", Истина);
		
	ИначеЕсли ТипЗнч(Ответ) = Тип("Boolean") Тогда
					
		РезультатОтвета.Вставить("Данные", Ответ);
		РезультатОтвета.Вставить("Результат", Истина);                      
		
	ИначеЕсли ТипЗнч(Ответ) = Тип("Число") Тогда
					
		РезультатОтвета.Вставить("Данные", Ответ);
		РезультатОтвета.Вставить("Результат", Истина);                      
		
	Иначе                                                                 
		
		РезультатОтвета.Вставить("Результат", Ложь);
		РезультатОтвета.Вставить("Ошибка", "Некорректные данные.");				
		
	КонецЕсли; 	
	
	Возврат РезультатОтвета;
	
КонецФункции

&НаСервере
Функция ТаблицуВМассив(Таблица) Экспорт
	
	МассивДанных = Новый Массив;                                            
	
	Для каждого ТекСтрока Из Таблица Цикл
		
		СтруктураДанных = Новый Структура;
		
		Для каждого Колонка ИЗ Таблица.Колонки Цикл			

			СтруктураДанных.Вставить(Колонка.Имя, ТекСтрока[Колонка.Имя]);				
						
		КонецЦикла;
		
		МассивДанных.Добавить(СтруктураДанных);

	КонецЦикла;         
	
	Возврат МассивДанных;

КонецФункции

Функция ПолучитьСсылкуНаЗначениеПеречисления( пИмяПеречисления, пИмяЗначения ) Экспорт
    Попытка
        Возврат Перечисления[пИмяПеречисления][пИмяЗначения];
    исключение
        Сообщить("Ошибка получения ссылки на значение перечисления. " + пИмяПеречисления + " :: " + пИмяЗначения);
        Возврат неопределено;
    КонецПопытки;
КонецФункции 

Функция ПолучитьКонстанту(ИмяКонстанты) Экспорт
	
	Возврат Константы[ИмяКонстанты].Получить();

КонецФункции // ()

Функция ВернутьJSON(Структура) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Структура,,"ОбработатьНеподдерживаемоеСвойствоJSON", ОбщегоНазначения);
	JsonСтрока = ЗаписьJSON.Закрыть();  	
	
	Возврат JsonСтрока;
	
КонецФункции

Функция ВернутьСтруктуруИзJSON(Строка) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Строка);
	
	Данные = ПрочитатьJSON(ЧтениеJSON, Ложь);
	
	Возврат Данные;
	
КонецФункции    

Функция HTTPОтветВСтруктуру(Ответ) Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("КодСостояния", Ответ.КодСостояния);
	Результат.Вставить("Заголовки",  Новый Соответствие);
	
	Для каждого Параметр Из Ответ.Заголовки Цикл
		Результат.Заголовки.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	Если Ответ.Заголовки["Content-Type"] <> Неопределено Тогда
		
		ContentType = Ответ.Заголовки["Content-Type"];
		
		Если СтрНайти(ContentType, "text/plain") > 0 Тогда
			
			Тело = Ответ.ПолучитьТелоКакСтроку();
			Результат.Вставить("Тело", Тело);
			
		ИначеЕсли СтрНайти(ContentType, "text/html") > 0 Тогда
			
			Тело = Ответ.ПолучитьТелоКакСтроку();
			Результат.Вставить("Тело", Тело);
			
		ИначеЕсли СтрНайти(ContentType, "application/json") Тогда
			
			Тело = Ответ.ПолучитьТелоКакСтроку();
			Результат.Вставить("Тело", Тело);
			
		Иначе
			
			Тело = "Не известный ContentType = " + ContentType + ". См. <Функция HTTPОтветВСтруктуру(Ответ) Экспорт>";
			Результат.Вставить("Тело", Тело);
			
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат Результат;

КонецФункции
