
&НаКлиенте
Перем Компонента;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Компонента = ОбщегоНазначенияКлиент.ПодключитьКомпоненту();	
	
	Если Компонента <> Неопределено И Не Компонента.Подключить() Тогда		
		ТекстОшибки = "";
		КодОшибки = Компонента.ПолучитьОшибку(ТекстОшибки);                                                   
		ПоказатьПредупреждение(,"Ошибка: "+КодОшибки+", " + ТекстОшибки);
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Компонента <> Неопределено Тогда		
		Компонента.Отключить();	
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СканированиеШтрихкода" Тогда
		
		#Если МобильноеПриложениеКлиент Тогда
			Если ЗначениеЗаполнено(ЭтаФорма.ОписаниеОшибки) Тогда
				Компонента.Отключить();
			Иначе
				Компонента.Подключить();
			КонецЕсли; 
		#КонецЕсли 	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	// Пользователь может нажать несколько раз сканирование штрихкода, но форма уже закрыта.  
	//+Шульман А. 05.12.2025 #UT10-5576   
	Если Не Источник = "Вручную" Тогда
	//-Шульман А. 05.12.2025 #UT10-5576   
	
		Если Не ВводДоступен() Тогда   
			Возврат;
		КонецЕсли; 
		
	КонецЕсли;
	
	СимволРазделитель = "{GS}";
		
	Если Событие = "UniversalBroadcastEvent" Тогда
		
		Если Не Источник = "Вручную" Тогда
			
			Результат = ОбщегоНазначения.ПолучитьЗначениеШтрихкода(Данные, СимволРазделитель);
			
			Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
				
				ПоказатьПредупреждение(, "Ошибка сканирования штрихкода", 4);
				Возврат;
				
			КонецЕсли;
			
			ШтрихкодДляПроверки = Результат.Штрихкод; 
			
		Иначе
			ШтрихкодДляПроверки = СОКРЛП(Данные);	
		КонецЕсли;	
			
		Если ОбщегоНазначения.ПолучитьКонстанту("РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ") Тогда
			
			СтрокаGS = "";
			
			Попытка
				
				Если Не Источник = "Вручную" Тогда
					СтрокаGS = ОбщегоНазначенияКлиент.ПолучитьПозицииGS(ШтрихкодДляПроверки, СимволРазделитель);
				Иначе
					СтрокаGS = ОбщегоНазначенияКлиент.ПолучитьПозицииGS_Тест(ШтрихкодДляПроверки);
					
					//+Сёмин Р.И. 29.04.2026 #UT10-5814
					СимволРазделительРучной = "<GS>";
					
					Пока НЕ СтрНайти(ШтрихкодДляПроверки, СимволРазделительРучной) = 0 Цикл
						ШтрихкодДляПроверки = СтрЗаменить(ШтрихкодДляПроверки, СимволРазделительРучной, "");
					КонецЦикла;
					//-Сёмин Р.И. 29.04.2026 #UT10-5814
					
				КонецЕсли;
				
				Пока НЕ СтрНайти(ШтрихкодДляПроверки, СимволРазделитель) = 0 Цикл
					ШтрихкодДляПроверки = СтрЗаменить(ШтрихкодДляПроверки, СимволРазделитель, "");
				КонецЦикла;
				
		 	Исключение                                           
				
				ASK_ОбработкаОшибок.ЗаписатьИнформациюВЛогОшибок("Ошибка", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), 
				"Проверка КМ. ВнешнееСобытие", "Поиск GS");   
				Возврат;
				
			КонецПопытки;     
		
		КонецЕсли;
		
		ПроверитьНаСервере(ШтрихкодДляПроверки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаСервере(Данные)
	
	тзПроверка.Очистить();
	
	ДобСтрока = тзПроверка.Добавить();      
	ДобСтрока.Событие = "=== Проверка валидности ===";  
	
	Если Константы.РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ.Получить() Тогда
		ДобСтрока.Событие = "=== Проверка валидности расширенная ===";  
	КонецЕсли;
	
	ДобСтрока.Время = 0;                
	ЧастиКода = ОбщегоНазначения.ПолучитьСтруктуруЧастиКода();   
	
	МассивGS = СтрРазделить(СтрокаGS, ";");
	
	Если ТипЗнч(МассивGS) = Тип("Массив") Тогда
		
		Если МассивGS.Количество() > 0 Тогда
			ЧастиКода.Вставить("GS1", МассивGS[0]);       // Позиция первого GS
		КонецЕсли;
		
		Если МассивGS.Количество() > 1 Тогда
			ЧастиКода.Вставить("GS2", МассивGS[1]);       // Позиция второго GS
		КонецЕсли;
		
		Если МассивGS.Количество() > 2 Тогда
			ЧастиКода.Вставить("GS3", МассивGS[2]);       // Позиция третьего GS
		КонецЕсли;  
			
	КонецЕсли;
		
	НачВремя = ТекущаяУниверсальнаяДатаВМиллисекундах();   
	/////////////////////////////////////////////////////////////////////////
	РезультатПроверкиШтрихКодаМаркировки = ОбщегоНазначения.ЭтоШтрихКодМаркировки(Данные, ЧастиКода, Истина);    
	/////////////////////////////////////////////////////////////////////////
	
	ПоследнееТекВремя = 0;
	
	//+Сёмин Р.И. 30.04.2026 #UT10-5814
	//ПоказатьАнализКодаМаркировки(Данные);
	ПоказатьАнализКодаМаркировки(Данные, РезультатПроверкиШтрихКодаМаркировки.ТекстОшибки);
	//-Сёмин Р.И. 30.04.2026 #UT10-5814
		
	Если РезультатПроверкиШтрихКодаМаркировки.Результат Тогда
		
		КодМаркировки = РезультатПроверкиШтрихКодаМаркировки.ШтрихКодКраткий;
		
		ПоследняяСтрока = тзПроверка.Получить(тзПроверка.Количество() - 1);   
		ТекВремя = ПоследняяСтрока.Время;    
		
		ДобСтрока = тзПроверка.Добавить();      
		ДобСтрока.Событие = "=== Проверка состояния ===";
		
		РезультатПроверкиКМ = ПроверитьСостояниеКМ(КодМаркировки);    
		СостояниеКМ = РезультатПроверкиКМ.СостояниеКМ;   
		
		ПоследняяСтрока = тзПроверка.Получить(тзПроверка.Количество() - 1);   
		
		ВремяСНачала = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачВремя;
		ПоследняяСтрока.Время = ВремяСНачала - ТекВремя;
		
	Иначе
		
		ДобСтрока = тзПроверка.Добавить();    
		ДобСтрока.Штрихкод = РезультатПроверкиШтрихКодаМаркировки.ШтрихКодКраткий;
		ДобСтрока.Ответ = "Это не КМ";   
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	
	//+Шульман А. 05.12.2025 #UT10-5576  
	Данные = Штрихкод;     
	ВнешнееСобытие("Вручную", "UniversalBroadcastEvent", Данные);
	
	//МассивGS = Новый Массив;
	//
	//Если ОбщегоНазначения.ПолучитьКонстанту("РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ") Тогда
	//
	//	Попытка
	//		
	//		ДанныеXML = Штрихкод;     
	//		ASK_ОбработкаОшибок.ЗаписатьИнформациюВЛогОшибок("", ДанныеXML, "Проверка КМ. ВнешнееСобытие", "Данные на входе");
	//		
	//		МассивGS = ОбщегоНазначенияКлиент.ПолучитьПозицииGS(ДанныеXML, Истина);
	//		
	//	Исключение                                           
	//		
	//		ASK_ОбработкаОшибок.ЗаписатьИнформациюВЛогОшибок("Ошибка", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), 
	//		"Проверка КМ. ВнешнееСобытие", "Разбор кода");   
	//		Возврат;
	//		
	//	КонецПопытки;     
	//
	//КонецЕсли;
    //-Шульман А. 05.12.2025 #UT10-5576
	
	//ПроверитьНаСервере(Штрихкод, МассивGS);    

КонецПроцедуры

&НаСервере
Функция ЭтоШтрихКодМаркировки_Удалить(ПромШтрихКод)  
	
	СтруктураШтрихКодаМаркировки = Новый Структура;
	СтруктураШтрихКодаМаркировки.Вставить("Результат" , Ложь);
	СтруктураШтрихКодаМаркировки.Вставить("ШтрихКод"  , ПромШтрихКод);
	
	Если (Лев(ПромШтрихКод , 2) = "01" И Сред(ПромШтрихКод,17,2) = "21") Или (Лев(ПромШтрихКод , 4) = "(01)" И Сред(ПромШтрихКод,19,4) = "(21)") Тогда
		
		СтруктураШтрихКодаМаркировки.Вставить("Результат"       , Истина); 
		
		ПростойВидШтрихКода = Лев(ПромШтрихКод , 2) = "01";                
		
		//Получаем оба вида штрих-кода
		Если ПростойВидШтрихКода Тогда
			
			СтруктураШтрихКодаМаркировки.Вставить("ШтрихКодКраткий" , Лев(ПромШтрихКод , 31));
			ПромШтрихКодПолный = "(01)" + Сред(ПромШтрихКод,3,14) + "(21)" + Сред(ПромШтрихКод , 19 , 13);
			СтруктураШтрихКодаМаркировки.Вставить("ШтрихКодПолный"  , ПромШтрихКодПолный);
			
		Иначе 

			СтруктураШтрихКодаМаркировки.Вставить("ШтрихКодПолный"  , Лев(ПромШтрихКод , 35));
			ПромШтрихКодКраткий =  "01" + Сред(ПромШтрихКод,5,14) + "21" + Сред(ПромШтрихКод , 23 , 13);
			СтруктураШтрихКодаМаркировки.Вставить("ШтрихКодКраткий" , ПромШтрихКодКраткий);
			
		КонецЕсли;

		// Выделяем GTIN
		СтруктураШтрихКодаМаркировки.Вставить("GTIN"                , Сред(СтруктураШтрихКодаМаркировки.ШтрихКодКраткий , 3 , 14));
		
		ДобСтрока = тзПроверка.Добавить();    
		ДобСтрока.Событие = "Анализ КМ старый";
		ДобСтрока.Штрихкод = СтруктураШтрихКодаМаркировки.ШтрихКодКраткий;
		ДобСтрока.Ответ = "Это КМ";
		
	Иначе
		
		ДобСтрока = тзПроверка.Добавить();    
		ДобСтрока.Событие = "Анализ КМ старый";
		ДобСтрока.Ответ = "Это не КМ";
		
		СтруктураШтрихКодаМаркировки.Вставить("Результат" , Ложь); 
		
	КонецЕсли;
		
	ДанныеШтрихкода = РазложитьКодМаркировки_Удалить(ПромШтрихКод);    
	
	Если ДанныеШтрихкода.ЭтоКодМаркировки Тогда       
		
		СтруктураШтрихКодаМаркировки.Вставить("Результат",       Истина); 
		СтруктураШтрихКодаМаркировки.Вставить("ШтрихКодКраткий", ДанныеШтрихкода.ШтрихКодКраткий);
		СтруктураШтрихКодаМаркировки.Вставить("ШтрихКодПолный",  ДанныеШтрихкода.ШтрихКодПолный); 
		СтруктураШтрихКодаМаркировки.Вставить("GTIN",            ДанныеШтрихкода.ЧастиКода.GTIN);  
		
		ДобСтрока = тзПроверка.Добавить();    
		ДобСтрока.Событие = "Анализ КМ новый";
		ДобСтрока.Штрихкод = СтруктураШтрихКодаМаркировки.ШтрихКодКраткий;
		ДобСтрока.Ответ = "Это КМ";
		
	Иначе
		
		ДобСтрока = тзПроверка.Добавить();    
		ДобСтрока.Событие = "Анализ КМ новый";
		ДобСтрока.Ответ = "Это не КМ";
		
		СтруктураШтрихКодаМаркировки.Вставить("Результат" , Ложь);   
		
	КонецЕсли;                     
		
	Возврат СтруктураШтрихКодаМаркировки;
	
КонецФункции

&НаСервере
Функция РазложитьКодМаркировки_Удалить(ПромШтрихКод) Экспорт
	
	//+Шульман А. 17.11.2025 #UT10-5516	                                  
	ЧастиКода = Новый Структура();
	ДанныеШтрихкода = Новый Структура("ЭтоКодМаркировки, ПройденаПроверкаКраткогоКода, ШтрихКодКраткий, ШтрихКодПолный, ЧастиКода", Ложь, Ложь, "", "", ЧастиКода); 
	ПровКод = ПромШтрихКод;
	
	//x01GTINGTINGTINGT21SERIALSERIALSx91KEYKx92CRIPTOCRIPT...
	ЧастиКода.Вставить("FNC1", 0);     // 1
	ЧастиКода.Вставить("S01", 0);       // 2
	ЧастиКода.Вставить("GTIN", "");    // 14
	ЧастиКода.Вставить("S21", 0);       // 2
	ЧастиКода.Вставить("SERIAL", "");  // 13
	ЧастиКода.Вставить("S91", 0);       // 2      
	ЧастиКода.Вставить("S93", 0);       // 2
	ЧастиКода.Вставить("KEY", "");     // 4
	ЧастиКода.Вставить("S92", 0);       // 2
	ЧастиКода.Вставить("CRIPTO", "");  // 44
	
	ДобСтрока = тзПроверка.Добавить();    
	ДобСтрока.Событие = "Проверка первого символа";
	ДобСтрока.Штрихкод = ПровКод;
	
	КодПервогоСимвола = КодСимвола(ПровКод, 1);
	
	Если КодПервогоСимвола < 32 И КодПервогоСимвола > 126 Тогда     
		
		// Это нечитаемый символ, его нужно пропустить
		ПровКод = Сред(ПровКод, 2);
		ДобСтрока.Ответ = "Первый символ нечитаемый, имеет код " + КодПервогоСимвола + ", отбрасывается";
		
	Иначе   
		ДобСтрока.Ответ = "Первый символ читаемый: " + Лев(ПровКод, 1);
	КонецЕсли;  
	
	
	//01GTINGTINGTINGT21SERIALSERIALSx91KEYKx92CRIPTOCRIPT...
	Если СтрДлина(ПровКод) < 31 Тогда   
		
		ДобСтрока = тзПроверка.Добавить();    
		ДобСтрока.Событие = "Проверка: Длина штрикхода меньше 31";
		ДобСтрока.Ответ = "Это не КМ, т.к. длина кода " + СтрДлина(ПровКод);  
		ДобСтрока.Штрихкод = ПровКод;
		Возврат ДанныеШтрихкода;
		
	КонецЕсли;   
	
	// Проверка 01   
	ДобСтрока = тзПроверка.Добавить();    
	ДобСтрока.Событие = "Проверка на 01 или (01)";
	ДобСтрока.Штрихкод = ПровКод;
	
	ЕстьСкобки = Ложь;
	
	Если Лев(ПровКод, 2) = "01" Тогда     
		
		ПровКод = Сред(ПровКод, 3);   
		ЧастиКода.Вставить("S01", "01");   
		
	ИначеЕсли Лев(ПровКод, 4) = "(01)" Тогда     
		
		ПровКод = Сред(ПровКод, 5);   
		ЧастиКода.Вставить("S01", 1);  
		ЕстьСкобки = Истина;
		
	Иначе           
		
		ДобСтрока.Ответ = "Не найден 01, (01)";  
		Возврат ДанныеШтрихкода;
		
	КонецЕсли;
	
	ДобСтрока.Ответ = "Успешно";  
	
	//GTINGTINGTINGT21SERIALSERIALSx91KEYKx92CRIPTOCRIPT...   
	
	ЧастиКода.Вставить("GTIN", Лев(ПровКод, 14));   
	ДобСтрока = тзПроверка.Добавить();    
	ДобСтрока.Событие = "Получен GTIN";
	ДобСтрока.Штрихкод = ПровКод;   
	ДобСтрока.Ответ = ЧастиКода.GTIN;
	
	ПровКод = Сред(ПровКод, 15);   
	
	//21SERIALSERIALSX91KEYKx92CRIPTOCRIPT...  
	ДобСтрока = тзПроверка.Добавить();   
	ДобСтрока.Событие = ?(ЕстьСкобки, "Проверка на (21)",  "Проверка на 21");
	ДобСтрока.Штрихкод = ПровКод;
	
	Если Лев(ПровКод, 2) = "21" И Не ЕстьСкобки Тогда     
		
		ЧастиКода.Вставить("S21", 1);
		ПровКод = Сред(ПровКод, 3);   
		
	ИначеЕсли Лев(ПровКод, 4) = "(21)" И ЕстьСкобки Тогда     
		
		ЧастиКода.Вставить("S21", 1);
		ПровКод = Сред(ПровКод, 5);   
		
	Иначе                         
		
		ДобСтрока.Ответ = ?(ЕстьСкобки, "Не найден (21)", "Не найден 21");  
		Возврат ДанныеШтрихкода; 
		
	КонецЕсли;    
	
	ДобСтрока.Ответ = "Успешно";  
	
	
	//SERIALSERIALSx91KEYKx92CRIPTOCRIPT... 
	ЧастиКода.Вставить("SERIAL", Лев(ПровКод, 13));  
	
	ДобСтрока = тзПроверка.Добавить();    
	ДобСтрока.Событие = "Получен SERIAL";
	ДобСтрока.Штрихкод = ПровКод;
	ДобСтрока.Ответ = ЧастиКода.SERIAL;
	
	ДанныеШтрихкода.ШтрихКодКраткий = "01" + ЧастиКода.GTIN + "21" + ЧастиКода.SERIAL;
	ДанныеШтрихкода.ШтрихКодПолный  = "(01)" + ЧастиКода.GTIN + "(21)" + ЧастиКода.SERIAL;
	
	ДобСтрока = тзПроверка.Добавить();    
	ДобСтрока.Событие = "Пройдена проверка краткого кода";
	ДобСтрока.Штрихкод = ДанныеШтрихкода.ШтрихКодКраткий; 
	ДобСтрока.Ответ = "Успешно";
	ДанныеШтрихкода.ПройденаПроверкаКраткогоКода = Истина;
	
	Если Не Константы.РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ.Получить() Тогда   
		
		// Если не стоит константа РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ, то проверку заканчиваем       
		ДобСтрока.Ответ = "Это краткий КМ";
		
		ДанныеШтрихкода.ЭтоКодМаркировки = Истина;     
		Возврат ДанныеШтрихкода;        
		
	КонецЕсли;
	
	// Если указана константа РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ, то правильным считается только полный штрихкод
	ПровКод = Сред(ПровКод, 14);
	
	//91KEYKx92CRIPTOCRIPT... 
	ДобСтрока = тзПроверка.Добавить();    
	ДобСтрока.Событие = ?(ЕстьСкобки, "Проверка на (91)",  "Проверка на 91");
	ДобСтрока.Штрихкод = ПровКод;
	
	ЭтоКод93 = Истина;
	
	Если Лев(ПровКод, 2) = "91" И Не ЕстьСкобки Тогда     
		
		ЧастиКода.Вставить("S91", 1);
		ПровКод = Сред(ПровКод, 3); 
		ДобСтрока.Ответ = "Успешно";   
		ЭтоКод93 = Ложь;
		
	ИначеЕсли Лев(ПровКод, 4) = "(91)" И ЕстьСкобки Тогда     
		
		ЧастиКода.Вставить("S91", 1);
		ПровКод = Сред(ПровКод, 5); 
		ДобСтрока.Ответ = "Успешно";    
		ЭтоКод93 = Ложь;
		
	Иначе
		ДобСтрока.Ответ = ?(ЕстьСкобки, "Не найден (91)", "Не найден 91");  
	КонецЕсли;
		
	Если ЭтоКод93 Тогда
		
		//93KEYK 
		ДобСтрока = тзПроверка.Добавить();    
		ДобСтрока.Событие = ?(ЕстьСкобки, "Проверка на (93)",  "Проверка на 93");
		ДобСтрока.Штрихкод = ПровКод;
		
		Если Лев(ПровКод, 2) = "93" И Не ЕстьСкобки Тогда     
			
			ЧастиКода.Вставить("S93", 1);
			ПровКод = Сред(ПровКод, 3); 
			ДобСтрока.Ответ = "Успешно";   
			
		ИначеЕсли Лев(ПровКод, 4) = "(93)" И ЕстьСкобки Тогда     
			
			ЧастиКода.Вставить("S93", 1);
			ПровКод = Сред(ПровКод, 5); 
			ДобСтрока.Ответ = "Успешно";    
			
		Иначе              
			
			ДобСтрока.Ответ = ?(ЕстьСкобки, "Не найден (93)", "Не найден 93");  
			Возврат ДанныеШтрихкода;  
			
		КонецЕсли;                          
	
	КонецЕсли;                          
	
	//KEYKx92CRIPTOCRIPT... 
	ЧастиКода.Вставить("KEY", Лев(ПровКод, 4));   
	ДобСтрока = тзПроверка.Добавить();    
	ДобСтрока.Событие = "Получен KEY";
	ДобСтрока.Штрихкод = ПровКод;
	ДобСтрока.Ответ = ЧастиКода.KEY;
	
	ПровКод = Сред(ПровКод, 5); 
	
	Если ПустаяСтрока(ПровКод) Тогда    
		
		ДанныеШтрихкода.ЭтоКодМаркировки = Истина;
		Возврат ДанныеШтрихкода;        
		
	КонецЕсли;
	
	//92CRIPTOCRIPT...        
	ДобСтрока = тзПроверка.Добавить();   
	ДобСтрока.Событие = ?(ЕстьСкобки, "Проверка на (92)",  "Проверка на 92");
	ДобСтрока.Штрихкод = ПровКод;
	
	Если Лев(ПровКод, 2) = "92" И Не ЕстьСкобки Тогда     
		
		ЧастиКода.Вставить("S92", 1);  
		ПровКод = Сред(ПровКод, 3);  
		
	ИначеЕсли Лев(ПровКод, 4) = "(92)" И ЕстьСкобки Тогда     
		
		ЧастиКода.Вставить("S92", 1);  
		ПровКод = Сред(ПровКод, 5);      
		
	Иначе
		
		ДобСтрока.Ответ = ?(ЕстьСкобки, "Не найден (92)", "Не найден 92");  
		Возврат ДанныеШтрихкода;  
		
	КонецЕсли;
	
	ДобСтрока.Ответ = "Успешно";
	
	//CRIPTOCRIPTO...    
	ДобСтрока = тзПроверка.Добавить();    
	ДобСтрока.Событие = "Проверка криптохвоста";
	ДобСтрока.Штрихкод = ПровКод;
	
	Если СтрДлина(ПровКод) = 44 Или СтрДлина(ПровКод) = 88 Тогда
		
		ДобСтрока.Ответ = "Успешно";
		
		ЧастиКода.Вставить("CRIPTO", ПровКод);   
		
		ДобСтрока = тзПроверка.Добавить();    
		ДобСтрока.Событие = "Получен CRIPTO";
		ДобСтрока.Штрихкод = ПровКод;
		ДобСтрока.Ответ = ЧастиКода.CRIPTO;
		
		ДобСтрока = тзПроверка.Добавить();    
		ДобСтрока.Событие = "Пройдена расширенная проверка";
		ДобСтрока.Штрихкод = ПромШтрихКод; 
		ДобСтрока.Ответ = "Это полный КМ";
		
		ДанныеШтрихкода.ЭтоКодМаркировки = Истина;
		Возврат ДанныеШтрихкода;        
		
	Иначе
		ДобСтрока.Ответ = "Длина криптохвоста не равна 44 или 88";
	КонецЕсли;  
		
	
	Возврат ДанныеШтрихкода;     
	//-Шульман А. 17.11.2025 #UT10-5516
	
КонецФункции // ()

&НаСервере

&НаСервере
//+Сёмин Р.И. 30.04.2026 #UT10-5814
//Процедура ПоказатьАнализКодаМаркировки(Данные)
Процедура ПоказатьАнализКодаМаркировки(Данные, ТекстОшибки)
//-Сёмин Р.И. 30.04.2026 #UT10-5814	
	
	//+Шульман А. 17.11.2025 #UT10-5516	  
	РасширеннаяПроверкаВалидности = Константы.РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ.Получить();
	ЧастиКода = ЭтаФорма.РезультатПроверкиШтрихКодаМаркировки.ЧастиКода;   
	
	ЗамерыВремени = Неопределено;           
	ЭтаФорма.РезультатПроверкиШтрихКодаМаркировки.Свойство("ЗамерыВремени", ЗамерыВремени);      
	ВыводитьВремя = ТипЗнч(ЗамерыВремени) = Тип("Структура"); 
	Элементы.тзПроверкаВремя.Видимость = ВыводитьВремя;
		
	ПровКод = Данные;	
	
	ДобСтрока = тзПроверка.Добавить();    
	ДобСтрока.Событие = "Проверка первого символа";
	ДобСтрока.Штрихкод = ПровКод;
	
	КодПервогоСимвола = КодСимвола(ПровКод, 1);
	
	Если ЧастиКода.FNC1 > 0 Тогда     
		ДобСтрока.Ответ = "Первый символ нечитаемый, имеет код " + ЧастиКода.FNC1;
	Иначе   
		ДобСтрока.Ответ = "Первый символ читаемый: " + Лев(ПровКод, 1);
	КонецЕсли;  
	
	Если РасширеннаяПроверкаВалидности Тогда
		
		Если Не ЧастиКода.Свойство("GS1") Тогда
			
			ДобСтрока = тзПроверка.Добавить();    
			ДобСтрока.Событие = "Проверка: количество GS";
			ДобСтрока.Ответ   = "Это не КМ, т.к. нет первого GS";  
			ДобСтрока.Штрихкод = ПровКод;     
			Возврат;
		
		КонецЕсли;     

		Если ЧастиКода.Свойство("GS3") Тогда   
		
			ДобСтрока = тзПроверка.Добавить();    
			ДобСтрока.Событие = "Проверка: лишние GS";
			ДобСтрока.Ответ   = "Это не КМ, т.к. в коде больше двух GS";  
			ДобСтрока.Штрихкод = ПровКод;     
			Возврат;
			
		КонецЕсли;     
		
		//+Шульман А. 17.12.2025 #UT10-5599
		Если ЧастиКода.Свойство("GS2") И ЧастиКода.Свойство("S93") Тогда
			
			ДобСтрока = тзПроверка.Добавить();    
			ДобСтрока.Событие = "Проверка: количество GS";
			ДобСтрока.Ответ   = "Это не КМ, т.к. в коде больше одного GS";  
			ДобСтрока.Штрихкод = ПровКод;     
			Возврат;    
				
		ИначеЕсли Не ЧастиКода.Свойство("GS2") И ЧастиКода.Свойство("S91") Тогда
				
			ДобСтрока = тзПроверка.Добавить();    
			ДобСтрока.Событие = "Проверка: количество GS";
			ДобСтрока.Ответ   = "Это не КМ, т.к. нет двух GS";  
			ДобСтрока.Штрихкод = ПровКод;     
			Возврат;    
			
		КонецЕсли;   
		//-Шульман А. 17.12.2025 #UT10-5599
			
	КонецЕсли;   
	
	//01GTINGTINGTINGT21SERIALSERIALSx91KEYKx92CRIPTOCRIPT...
	// Проверка 01   
	ДобСтрока = тзПроверка.Добавить();    
	ДобСтрока.Событие = "Проверка на 01 или (01)";
	ДобСтрока.Штрихкод = ПровКод; 
	Часть = "";
	
	Если ЧастиКода.Свойство("S01", Часть) Тогда     
		
		ПровКод = Сред(ПровКод, СтрДлина(Часть) + 1);  
		
		Если ВыводитьВремя Тогда
			ЗамерыВремени.Свойство("S01", ДобСтрока.Время);
		КонецЕсли;
		
	Иначе           
		
		ДобСтрока.Ответ = "Не найден 01, (01)";  
		Возврат;
		
	КонецЕсли;
	
	ДобСтрока.Ответ = "Успешно";   
	
	//GTINGTINGTINGT21SERIALSERIALSx91KEYKx92CRIPTOCRIPT...  
	ДобСтрока = тзПроверка.Добавить();    
	ДобСтрока.Событие = "Получен GTIN";
	ДобСтрока.Штрихкод = ПровКод;   
	
	Если ЧастиКода.Свойство("GTIN", Часть) Тогда     
	
		ДобСтрока.Ответ = Часть;   
		
		Если ВыводитьВремя Тогда
			ЗамерыВремени.Свойство("GTIN", ДобСтрока.Время);
		КонецЕсли;
		
		ПровКод = Сред(ПровКод, СтрДлина(Часть) + 1);   
		
	Иначе                         
		
		ДобСтрока.Ответ = "Не найден GTIN";  
		Возврат; 
		
	КонецЕсли;    
		
	//21SERIALSERIALSX91KEYKx92CRIPTOCRIPT...  
	ДобСтрока = тзПроверка.Добавить();   
	ДобСтрока.Событие = "Проверка на 21";
	ДобСтрока.Штрихкод = ПровКод;
	
	Если ЧастиКода.Свойство("S21", Часть) Тогда     
		
		ПровКод = Сред(ПровКод, СтрДлина(Часть) + 1);   
		
		Если ВыводитьВремя Тогда
			ЗамерыВремени.Свойство("S21", ДобСтрока.Время);
		КонецЕсли;
		
	Иначе                         
		
		ДобСтрока.Ответ = "Не найден 21, (21)";  
		Возврат; 
		
	КонецЕсли;    
	
	ДобСтрока.Ответ = "Успешно";  
	
	
	//SERIALSERIALSx91KEYKx92CRIPTOCRIPT...  
	ДобСтрока = тзПроверка.Добавить();    
	ДобСтрока.Событие = "Получен SERIAL";
	ДобСтрока.Штрихкод = ПровКод;
	
	Если ЧастиКода.Свойство("SERIAL", Часть) Тогда     
		
		ДобСтрока.Ответ = Часть;
		
		Если ВыводитьВремя Тогда
			ЗамерыВремени.Свойство("SERIAL", ДобСтрока.Время);
		КонецЕсли;
		
		ПровКод = Сред(ПровКод, СтрДлина(Часть) + 1);   
		
	Иначе                         
		
		ДобСтрока.Ответ = "Не найден SERIAL";
		//+Сёмин Р.И. 30.04.2026 #UT10-5814
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ДобСтрока.Ответ = ДобСтрока.Ответ + ". " + ТекстОшибки;
		КонецЕсли;
		//-Сёмин Р.И. 30.04.2026 #UT10-5814
		Возврат; 
		
	КонецЕсли;    
	
	ДобСтрока.Ответ = "Успешно";  
	
	Если РезультатПроверкиШтрихКодаМаркировки.ПройденаПроверкаКраткогоКода Тогда     
	
		ДобСтрока = тзПроверка.Добавить();    
		ДобСтрока.Событие = "Пройдена проверка краткого кода";
		ДобСтрока.Штрихкод = РезультатПроверкиШтрихКодаМаркировки.ШтрихКодКраткий; 
		ДобСтрока.Ответ = "Успешно";
	
		Если Не РасширеннаяПроверкаВалидности Тогда   
		
			// Если не стоит константа РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ, то проверку заканчиваем       
			ДобСтрока.Ответ = "Это краткий КМ";  
			
			Если ВыводитьВремя Тогда
				ЗамерыВремени.Свойство("ОкончаниеПроверкиВалидности", ДобСтрока.Время);
			КонецЕсли;
			
			Возврат;      
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Если указана константа РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ, то правильным считается только полный штрихкод
	
	//91KEYKx92CRIPTOCRIPT... 
	ДобСтрока = тзПроверка.Добавить();    
	ДобСтрока.Событие = "Проверка на 91";
	ДобСтрока.Штрихкод = ПровКод;
	
	ЭтоКод93 = Истина;
	
	Если ЧастиКода.Свойство("S91", Часть) Тогда     
		
		Если ВыводитьВремя Тогда
			ЗамерыВремени.Свойство("S91", ДобСтрока.Время);
		КонецЕсли;
		
		Поз91 = СтрНайти(Данные, Часть);
		
		Если Не ЧастиКода.GS1 = Строка(Поз91) Тогда
			
			ДобСтрока.Ответ = "Перед 91 нет GS";   
           	Возврат;
		
		КонецЕсли;
		
		ПровКод = Сред(ПровКод, СтрДлина(Часть) + 1);  
		ЭтоКод93 = Ложь;     
		ДобСтрока.Ответ = "Успешно";   
		
	Иначе
		ДобСтрока.Ответ = "Не найден 91, (91)";  
	КонецЕсли;    
	
	//ИначеЕсли НЕ ЧастиКода.Свойство("S93") Тогда
	//	ДобСтрока.Ответ = "Не найден 91, (91), 93, (93)";  
	//КонецЕсли;    
	
	Если ЭтоКод93 Тогда
		
		//93KEYK 
		ДобСтрока = тзПроверка.Добавить();    
		ДобСтрока.Событие = "Проверка на 93";
		ДобСтрока.Штрихкод = ПровКод;
		
		Если ЧастиКода.Свойство("S93", Часть) Тогда     
			
			Если ВыводитьВремя Тогда
				ЗамерыВремени.Свойство("S93", ДобСтрока.Время);
			КонецЕсли;
			
			Поз91 = СтрНайти(Данные, Часть);
			
			Если Не ЧастиКода.GS1 = Строка(Поз91) Тогда
				
				ДобСтрока.Ответ = "Перед 93 нет GS";   
	           	Возврат;
			
			КонецЕсли;
			
			ПровКод = Сред(ПровКод, СтрДлина(Часть) + 1);  
			ДобСтрока.Ответ = "Успешно";   
				
		Иначе              
			
			ДобСтрока.Ответ = "Не найден 93, (93)";  
			Возврат;  
			
		КонецЕсли;                          
	
	КонецЕсли;                          
	
	//KEYKx92CRIPTOCRIPT...  
	ДобСтрока = тзПроверка.Добавить();    
	ДобСтрока.Событие = "Получен KEY";
	ДобСтрока.Штрихкод = ПровКод;
	
	Если ЧастиКода.Свойство("KEY", Часть) Тогда     
	
		ДобСтрока.Ответ = Часть;
		
		Если ВыводитьВремя Тогда
			ЗамерыВремени.Свойство("KEY", ДобСтрока.Время);
		КонецЕсли;
		
		ПровКод = Сред(ПровКод, СтрДлина(Часть) + 1);  
		
		Если ПустаяСтрока(ПровКод) Тогда    
			
			Если ЭтоКод93 Тогда
			
				ДобСтрока.Событие = "Пройдена расширенная проверка";
				ДобСтрока.Штрихкод = ШтрихКод; 
				ДобСтрока.Ответ = "Это упрощенный полный КМ";
				
				Если ВыводитьВремя Тогда
					ЗамерыВремени.Свойство("ОкончаниеПроверкиВалидности", ДобСтрока.Время);
				КонецЕсли;
						
			КонецЕсли;
			
			Возврат;  
			
		//+Шульман А. 17.12.2025 #UT10-5599
		Иначе
			
			Если ЭтоКод93 Тогда
			
				ДобСтрока.Событие = "Не пройдена расширенная проверка";
				ДобСтрока.Штрихкод = ШтрихКод; 
				ДобСтрока.Ответ = "После KEY есть символы";
				
				Если ВыводитьВремя Тогда
					ЗамерыВремени.Свойство("ОкончаниеПроверкиВалидности", ДобСтрока.Время);
				КонецЕсли;
						
			КонецЕсли;
			
			Возврат;  
		//-Шульман А. 17.12.2025 #UT10-5599	
			
		КонецЕсли;
		
	Иначе
		
		ДобСтрока.Ответ = "Не найден KEY";  
		Возврат; 
		
	КонецЕсли;    
		
	//92CRIPTOCRIPT...        
	ДобСтрока = тзПроверка.Добавить();   
	ДобСтрока.Событие = "Проверка на 92";
	ДобСтрока.Штрихкод = ПровКод;
	
	Если ЧастиКода.Свойство("S92", Часть) Тогда     
		
		Если ВыводитьВремя Тогда
			ЗамерыВремени.Свойство("S92", ДобСтрока.Время);
		КонецЕсли;
		
		Поз92 = СтрНайти(Данные, Часть);
		
		Если Не ЧастиКода.GS2 = Строка(Поз92) Тогда
			
			ДобСтрока.Ответ = "Перед 92 нет GS";   
           	Возврат;
		
		КонецЕсли;
		
		ПровКод = Сред(ПровКод, СтрДлина(Часть) + 1);  
		ДобСтрока.Ответ = "Успешно";   
		
	Иначе                         
		
		ДобСтрока.Ответ = "Не найден 92, (92)";  
		Возврат; 
		
	КонецЕсли;    
	
	ДобСтрока.Ответ = "Успешно";
	
	//CRIPTOCRIPTO...    
	Если ЧастиКода.Свойство("CRIPTO", Часть) Тогда     
		
		Если СтрДлина(Часть) = 44 Или СтрДлина(Часть) = 88 Тогда
		
			ДобСтрока = тзПроверка.Добавить();    
			ДобСтрока.Событие = "Получен CRIPTO";
			ДобСтрока.Штрихкод = ПровКод;
			ДобСтрока.Ответ = "Успешно";
			
			Если ВыводитьВремя Тогда
				ЗамерыВремени.Свойство("CRIPTO", ДобСтрока.Время);
			КонецЕсли;
			
			ДобСтрока = тзПроверка.Добавить();    
			ДобСтрока.Событие = "Пройдена расширенная проверка";
			ДобСтрока.Штрихкод = ШтрихКод; 
			ДобСтрока.Ответ = "Это полный КМ";  
			
			Если ВыводитьВремя Тогда
				ЗамерыВремени.Свойство("ОкончаниеПроверкиВалидности", ДобСтрока.Время);
			КонецЕсли;
			
			
		Иначе           
			
			ДобСтрока = тзПроверка.Добавить();    
			ДобСтрока.Событие = "Проверка криптохвоста";
			ДобСтрока.Штрихкод = ПровКод;
			ДобСтрока.Ответ = "Длина криптохвоста не равна 44 или 88";    
			
			Если ВыводитьВремя Тогда
				ЗамерыВремени.Свойство("CRIPTO", ДобСтрока.Время);
			КонецЕсли;
			
		КонецЕсли;  
			
	Иначе
		
		ДобСтрока = тзПроверка.Добавить();    
		ДобСтрока.Событие = "Проверка криптохвоста";
		ДобСтрока.Штрихкод = ПровКод;
		ДобСтрока.Ответ = "Не найден CRIPTO";  
		
	КонецЕсли;   
	//-Шульман А. 17.11.2025 #UT10-5516
	
КонецПроцедуры // ()

Функция ПроверитьСостояниеКМ(КодМаркировки) Экспорт
	
	//+Шульман А. 13.11.2025 #UT10-5504  
	РезультатПроверкиКМ = Новый Структура("ТекстОшибки, Действие, СостояниеКМ", "", "", "");
	
	Метод = "/api/v1/km_info?orgId=" + Константы.КодМДМГоловнойОрганизации.Получить();
	АдресСервиса = Константы.АдресСервераЧестныйЗнак.Получить();     // "10.90.100.31:30209";    
	
	Если ПустаяСтрока(АдресСервиса) Тогда
		АдресСервиса = "10.90.100.31:30209";
	КонецЕсли;   
	
	Соединение = Новый HTTPСоединение(АдресСервиса,,,,,, ); //Новый ЗащищенноеСоединениеOpenSSL());
	
	ДобСтрока = тзПроверка.Добавить();    
	ДобСтрока.Событие = "HTTPСоединение с сервисом ЧЗ";  
	ДобСтрока.Штрихкод = АдресСервиса;
	ДобСтрока.Ответ = "Успешно";  
	
	
	МассивКодов = Новый Массив;  
	МассивКодов.Добавить(КодМаркировки);     
	
	ПараметрыЗапроса = Новый Структура();  
	ПараметрыЗапроса.Вставить("codes", МассивКодов);     
	Отказ = Ложь;
	
	Попытка

		СтрокаЗапроса = ОбщегоНазначения.ВернутьJSON(ПараметрыЗапроса);
		
		Заголовки = Новый Соответствие;  
		Заголовки.Вставить("Content-type", "application/json");
		Заголовки.Вставить("Cache-Control", "no-cache");  
		
		HTTPЗапрос = Новый HTTPЗапрос();  
		HTTPЗапрос.АдресРесурса = Метод;
		HTTPЗапрос.Заголовки = Заголовки;     

    	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаЗапроса);   
		
		ТекСобытие = "HTTPЗапрос.УстановитьТелоИзСтроки ";
		ДобСтрока = тзПроверка.Добавить();    
		ДобСтрока.Событие = ТекСобытие;   
		ДобСтрока.Штрихкод = СтрокаЗапроса;
		ДобСтрока.Ответ = "Успешно";  
		
    	Результат  = Соединение.ОтправитьДляОбработки(HTTPЗапрос);     //Получить(HTTPЗапрос)
		
		ТекСобытие = "Соединение.Получить(HTTPЗапрос)";
		ДобСтрока = тзПроверка.Добавить();    
		ДобСтрока.Событие = ТекСобытие;      
		ДобСтрока.Штрихкод = Метод;

		ДобСтрока.Ответ = "Успешно";  
		
	Исключение
		
		РезультатПроверкиКМ.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());    
		РезультатПроверкиКМ.Действие = "Обработать ошибку сервиса";  
		
		ДобСтрока = тзПроверка.Добавить();    
		ДобСтрока.Событие = ТекСобытие;
		ДобСтрока.Ответ = "Ошибка: " + РезультатПроверкиКМ.ТекстОшибки;  
		
		Возврат РезультатПроверкиКМ;
		
	КонецПопытки;
	
	ДобСтрока = тзПроверка.Добавить();    
	ДобСтрока.Событие = "HTTPОтветВСтруктуру";
	Ответ = ОбщегоНазначения.HTTPОтветВСтруктуру(Результат);   
	ДобСтрока.Ответ = "Успешно";
	
	Если Не Ответ.КодСостояния = 200 Тогда   
		
		РезультатПроверкиКМ.ТекстОшибки = "Ошибка при чтении данных. Код состояния " + Ответ.КодСостояния; 
		ДобСтрока.Ответ = "Код состояния: " +  Ответ.КодСостояния;
		Отказ = Истина;
	
	ИначеЕсли Не Ответ.Свойство("Тело") Тогда   
		
		РезультатПроверкиКМ.ТекстОшибки = "Не возвращены данные по запросу";  
		ДобСтрока.Ответ = "Код состояния: " +  Ответ.КодСостояния;
		Отказ = Истина;
	
	ИначеЕсли ПустаяСтрока(Ответ.Тело) Тогда
		
		РезультатПроверкиКМ.ТекстОшибки = "Возвращено пустое тело по запросу";   
		ДобСтрока.Ответ = РезультатПроверкиКМ.ТекстОшибки;
		Отказ = Истина;     
		
	КонецЕсли;
	
	Если Отказ Тогда
	
		РезультатПроверкиКМ.Действие = "Обработать ошибку сервиса";  
		Возврат РезультатПроверкиКМ;
		
	КонецЕсли;
	
	ДобСтрока = тзПроверка.Добавить();    
	ДобСтрока.Событие = "ЧтениеJSON.УстановитьСтроку()";   
	ДобСтрока.Штрихкод = СтрЗаменить(Ответ.Тело, Символы.ПС, "");
	ДобСтрока.Штрихкод = СтрЗаменить(ДобСтрока.Штрихкод, " ", "");
	
	Попытка
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Ответ.Тело);    
		ДобСтрока.Ответ = "Успешно";
		
	Исключение
		
		РезультатПроверкиКМ.ТекстОшибки = "Ошибка при разборе JSON-данных";  
		ДобСтрока.Ответ = РезультатПроверкиКМ.ТекстОшибки;

		Возврат РезультатПроверкиКМ;
		
	КонецПопытки;
	
	ДобСтрока = тзПроверка.Добавить();    
	ДобСтрока.Событие = "ПрочитатьJSON";       

	СтруктураДанных = ПрочитатьJSON(ЧтениеJSON, Ложь);     
	ДобСтрока.Ответ = "Успешно";
	
	Если Не СтруктураДанных.Свойство("list") Тогда
		
		РезультатПроверкиКМ.ТекстОшибки = "Ошибка при разборе JSON-данных. Нет свойства list";    
		ДобСтрока.Ответ = РезультатПроверкиКМ.ТекстОшибки;
		РезультатПроверкиКМ.Действие = "Обработать ошибку сервиса";     
		
		Возврат РезультатПроверкиКМ;
		
	КонецЕсли;
	
	СоответствиеСтатусов = Новый Соответствие; 
	СоответствиеСтатусов.Вставить("EMITTED",     "Эмитирован");
	СоответствиеСтатусов.Вставить("APPLIED",     "Нанесён");
	СоответствиеСтатусов.Вставить("INTRODUCED",  "В обороте");
	СоответствиеСтатусов.Вставить("WRITTEN_OFF", "Списан");
	
	ДобСтрока = тзПроверка.Добавить();    
	ДобСтрока.Событие = "Разбор list";
	
	Для каждого ЭлементМассива Из СтруктураДанных.list Цикл
		
		Если КодМаркировки = ЭлементМассива.requestedCis Тогда
			
			ДобСтрока.Штрихкод = ЭлементМассива.status;
			мСостояниеКМ = СоответствиеСтатусов.Получить(ЭлементМассива.status);   
			РезультатПроверкиКМ.СостояниеКМ = ?(мСостояниеКМ = Неопределено, ЭлементМассива.status, мСостояниеКМ);
			
			Если ЭлементМассива.status = "INTRODUCED" Тогда
				РезультатПроверкиКМ.Действие = "Обработать код в обороте";
			Иначе
				РезультатПроверкиКМ.Действие = "Обработать код не в обороте";
			КонецЕсли;
			
			ДобСтрока.Ответ = РезультатПроверкиКМ.СостояниеКМ;

			Возврат РезультатПроверкиКМ;
			
		КонецЕсли;
		
	КонецЦикла;
	
	РезультатПроверкиКМ.ТекстОшибки = "Нет переданного кода маркировки в полученных данных";    
	ДобСтрока.Ответ = РезультатПроверкиКМ.ТекстОшибки;
	РезультатПроверкиКМ.Действие = "Обработать ошибку сервиса";   
	
	Возврат РезультатПроверкиКМ;
	//-Шульман А. 13.11.2025 #UT10-5504

КонецФункции // ()

Процедура ВывестиВремя(тзСтрока, ВыводитьВремя)
	
	Если ВыводитьВремя Тогда
		
		Индекс1 = тзПроверка.Индекс(тзСтрока);
		тзСтрокаПред = тзПроверка.Получить(Индекс1 - 1);
	
	КонецЕсли;
	

КонецПроцедуры



