&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначения.ОчиститьРегистрСведений("СписокТранспортныхНакладных");
	Период = ОбщегоНазначения.ПрочитатьПериодТранспортныхНакладных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗагрузитьТранспортныеНакладные();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновлениеТранспортныхНакладных" Тогда
		ЗагрузитьТранспортныеНакладные();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ЗагрузитьТранспортныеНакладные();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	СохранитьПериод();
	ЗагрузитьТранспортныеНакладные();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьТранспортныеНакладные()
	
	РезультатСтруктура = ОбщегоНазначения.ЗагрузитьСписокТранспортныхНакладных(Период.ДатаНачала, Период.ДатаОкончания);
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(, "Ошибка: " + РезультатСтруктура.Ошибка, 3);
		Возврат;
	КонецЕсли;
	
	Элементы.СписокТранспортныхНакладных.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьПериод()
	
	ОбщегоНазначения.СохранитьПериодТранспортныхНакладных(Период.ДатаНачала, Период.ДатаОкончания);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТранспортныхНакладныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДанныеСтроки = Элементы.СписокТранспортныхНакладных.ДанныеСтроки(ВыбраннаяСтрока);
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Идентификатор", ДанныеСтроки.Идентификатор);
	ФормаДокумента = ПолучитьФорму("Обработка.ТранспортныеНакладные.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма);
	ФормаДокумента.Открыть();
	
КонецПроцедуры
