&НаКлиенте
Перем Ошибка;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗагрузитьСписокОбъединений();
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗагрузитьСписокОбъединений()
	
	РезультатСтруктура = ОбщегоНазначения.ЗагрузитьСписокОбъединений(Истина);	
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		ПоказатьПредупреждение(, "Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		Возврат;
		
	КонецЕсли; 
	
	Если РезультатСтруктура.Результат Тогда
		Оповестить("ОбновлениеДанных");
	КонецЕсли;     

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокСлужебныхЗаписок(Команда)
	ЗагрузитьСписокОбъединений();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновлениеДанных" Тогда 
		Элементы.СписокОбъединений.Обновить();  
	КонецЕсли; 
	
КонецПроцедуры

