
&НаКлиенте
Процедура ПриНачалеРаботыСистемы()
		
	ОбщегоНазначения.УстановитьНачальныеПараметры();	
	ASK_ОбработкаОшибок.ОчиститьЛогиПрограммы();
	
	#Если МобильноеПриложениеКлиент Тогда
		ОткрытьФорму("ОбщаяФорма.Авторизация");		     	
	#Иначе
		ОткрытьФорму("ОбщаяФорма.Авторизация");		     	
	#КонецЕсли 
	
	//#Если МобильноеПриложениеКлиент Тогда
	//	ОткрытьФорму("ОбщаяФорма.РабочийСтол")2;		     	
	//#Иначе
	//	ОткрытьФорму("ОбщаяФорма.РабочийСтол");		     	
	//#КонецЕсли 
	
	
	
КонецПроцедуры



 
