
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПараметрыРаботы = ОбщегоНазначения.ПолучитьПараметрыРаботыСДокументомПТУ();	
	ЗаполнитьЗначенияСвойств(Объект, ПараметрыРаботы);	
		
	ЭтаФорма.Шапка.Очистить();
	СтрокаТЗ = Шапка.Добавить();
	СтрокаТЗ.ОписаниеСтатусаДокумента = "Найдено несколько товаров";	
	
	Элементы.ТоварыДокумента.Обновить();
	ОбщегоНазначенияКлиент.ЗаполнитьТабЗначОК(ЭтаФорма);		
	ОбновитьСлуженоеСообщениеПодвал();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСлуженоеСообщениеПодвал() Экспорт
	
	ЭтаФорма.Подвал.Очистить();	
	СтрокаТЗ = Подвал.Добавить();
	СтрокаТЗ.ФИОСотрудника = ОбщегоНазначенияКлиент.ПолучитьОписаниеСотрудника();
	СтрокаТЗ.ОписаниеРежимаВводаКоличества = ОбщегоНазначенияКлиент.ПолучитьОтображениеОРежимеВводеКоличества();	
	
	ЭтаФорма.ПодвалСообщение.Очистить();	
	СтрокаТЗ = ПодвалСообщение.Добавить();	
	СтрокаТЗ.СообщениеДляПользователя = "Выберите товар:";
	Элементы.ПодвалСообщение.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьДляРазмещения(Команда)
	
	ТоварГУИД  = Элементы.ТоварыДокумента.ТекущиеДанные.Владелец;
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("ТоварГУИД", ТоварГУИД);
	Закрыть( СписокПараметров );
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначения.ЗаписатьРегистрСведений("СписокТоваровДляВыбора", Параметры.НайденныеТовары);
КонецПроцедуры



