
&НаКлиенте
Процедура КнопкаОКВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "КнопкаОК" Тогда
		
		Если ВведеноеКоличествоВРучную = 0  Тогда
			ВведеноеКоличествоВРучную = 1;
		КонецЕсли; 
		
		СтруктураВозврата = Новый Структура("ВведеноеКоличествоВРучную", ВведеноеКоличествоВРучную);
		Закрыть(СтруктураВозврата);
			
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВведеноеКоличествоВРучную = Параметры.Количество;
КонецПроцедуры

&НаКлиенте
Процедура Ввести(Команда)
	
	Если ВведеноеКоличествоВРучную = 0  Тогда
		ВведеноеКоличествоВРучную = 1;
	КонецЕсли; 
	
	СтруктураВозврата = Новый Структура("ВведеноеКоличествоВРучную", ВведеноеКоличествоВРучную);
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщегоНазначенияКлиент.ЗаполнитьТабЗначОК(ЭтаФорма);
	
КонецПроцедуры
