&НаКлиенте
Перем Компонента;
&НаКлиенте
Перем РежимВводаАвтоматический;
&НаКлиенте
Перем Ошибка;


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновлениеДанных" Тогда
		Элементы.СписокЗаданийНаДоставку.Обновить();
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДокументыЗаданияНаДоставку(Команда)
	
	ЗапроситьСписокДокументовЗаданияНаДоставку();

КонецПроцедуры


&НаКлиенте
Процедура ЗапроситьСписокДокументовЗаданияНаДоставку()
	
	РезультатСтруктура = ОбщегоНазначения.ЗагрузитьСписокЗаданийНаДоставку();	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "ЗагрузитьСписокЗаданийНаДоставку");					
		Возврат;
	КонецЕсли; 
		                                 
	Если РезультатСтруктура.Результат Тогда
		
		Оповестить("ОбновлениеДанных");
		
	КонецЕсли;                                      
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗапроситьСписокДокументовЗаданияНаДоставку();	
	
	Компонента = ОбщегоНазначенияКлиент.ПодключитьКомпоненту();	
	
	Если Компонента <> Неопределено И Не Компонента.Подключить() Тогда		
		ТекстОшибки = "";
		КодОшибки = Компонента.ПолучитьОшибку(ТекстОшибки);                                                   
		ПоказатьПредупреждение(,"Ошибка: "+КодОшибки+", " + ТекстОшибки);
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "Компонента");					
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)                                            
	
	Если Не ВводДоступен() Тогда
		Возврат;
	КонецЕсли; 
	
	Если Событие = "UniversalBroadcastEvent" Тогда
		
		Результат = ОбщегоНазначения.ПолучитьЗначениеШтрихкода(Данные);
		Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
			ПоказатьПредупреждение(, "Ошибка сканирования штрихкода", 4);
			Возврат;
		КонецЕсли; 
		
		ЭтаФорма.Штрихкод = Результат.Штрихкод;				
		ЭтаФорма.ЗаданиеНаДоставкуГУИД = ОбщегоНазначения.ПолучитьЗаданиеНаДоставку(ЭтаФорма.Штрихкод);
		
		Если Не ЗначениеЗаполнено(ЭтаФорма.ЗаданиеНаДоставкуГУИД) Тогда
			
			ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();
			СтрокаСообщения = "Отсканирован штрикод " + ЭтаФорма.Штрихкод + Символы.ПС;
			СтрокаСообщения = СтрокаСообщения + "Задание на доставку не найдено";
			ПоказатьПредупреждение(, СтрокаСообщения, 4);
			Возврат;
			
		КонецЕсли; 
		
		ОткрытьФормуСписокГрузовыхМест();
		
	ИначеЕсли Событие = "ClipboardEvent" Тогда
		ЭтаФорма.Штрихкод = Данные;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСписокГрузовыхМест()
	
	Закрыть();	
	П = Новый Структура;
	П.Вставить("ЗаданиеНаДоставкуГУИД", ЭтаФорма.ЗаданиеНаДоставкуГУИД); 
	ОткрытьФорму("Обработка.ПогрузкаВАвто.Форма.СписокГрузовыхМест_OLD", П);
	
КонецПроцедуры
 

&НаКлиенте
Процедура СписокЗаданийНаДоставкуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ЭтаФорма.ЗаданиеНаДоставкуГУИД = Элементы.СписокЗаданийНаДоставку.ДанныеСтроки(ВыбраннаяСтрока).Объект;
	ОткрытьФормуСписокГрузовыхМест();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначения.ОчиститьРегистрСведений("СписокЗаданийНаДоставку");
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Компонента <> Неопределено Тогда
		Компонента.Отключить();
	КонецЕсли;

КонецПроцедуры




