
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗагрузитьСписокСборокПоЯчейке();
	
	СписокСборок.Параметры.УстановитьЗначениеПараметра("ЯчейкаГУИД", Параметры.ЯчейкаГУИД);
	Элементы.СписокСборок.Обновить();	
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСписокСборокПоЯчейке()
	
	РезультатСтруктура = ОбщегоНазначения.ЗагрузитьСписокСборокПоЯчейке(Параметры.ЯчейкаГУИД);	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "ЗагрузитьСписокМаршрутовИзРазгрузкаАвто");					
		Возврат;
	КонецЕсли; 
	
	
КонецПроцедуры
 