
#Область ТестированиеВебСервисов

&НаКлиенте
Процедура ПоискТовараПоШтрихкоду(Команда)
	ПоискТовараПоШтрихкодуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПоискТовараПоШтрихкодуНаСервере()
	
	РезультатВебСервиса = "";
	
	Попытка
		
		WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , ,3);
		WSПрокси = Новый WSПрокси(WSОпределение, "Data", "ARMStoreKeeper", "ARMStoreKeeperSoap" );
		//WSПрокси.Пользователь = "webadmin";
		//WSПрокси.Пароль = "web";		
		
		//Ответ = WSПрокси.FindGoodByBarcode(Штрихкод,  "ПоступлениеТоваровУслуг", ГУИДокумента2,  "ПоискШтрихкодов");
		//Ответ = WSПрокси.FindGoodByBarcode(Штрихкод,  "ПоступлениеТоваровУслуг", ГУИДокумента2,  "ПоискПоНормализованномуКоду");		
		Ответ = WSПрокси.FindGoodByBarcode50(Штрихкод,  "ПоискПоКоду", ГУИДокумента2,  "ПоискПоКоду");		
		Если ТипЗнч(Ответ) = Тип("ХранилищеЗначения") Тогда			
			//Данные = ОбщегоНазначения.ХранилищеJSONВСтруктуру(Ответ);
			РезультатВебСервиса = РезультатВебСервиса + Ответ.Получить();			
		КонецЕсли; 		
		
	Исключение
		
		Сообщить("Ошибка подключения к сервису обновления");
		
	КонецПопытки; 
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПолучитьСписокТоваровДокумента(Команда)	
	ПолучитьСписокТоваровДокументаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокТоваровДокументаНаСервере()
	
	РезультатВебСервиса = "";
	
	Попытка
		
		WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , ,3);
		WSПрокси = Новый WSПрокси(WSОпределение, "Data", "ARMStoreKeeper", "ARMStoreKeeperSoap" );
		//WSПрокси.Пользователь = "webadmin";
		//WSПрокси.Пароль = "web";		
		
		Ответ = WSПрокси.GetListGoodsFromPTU(ГУИДДокументаПТУ);
		
		Если ТипЗнч(Ответ) = Тип("ХранилищеЗначения") Тогда			
			//Данные = ОбщегоНазначения.ХранилищеJSONВСтруктуру(Ответ);
			РезультатВебСервиса = Ответ.Получить();			
		КонецЕсли; 	
		
	Исключение
		
		Сообщить("Ошибка подключения к сервису обновления");
		
	КонецПопытки; 
			
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокДокументов(Команда)
	ПолучитьСписокДокументовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокДокументовНаСервере()
	
	РезультатВебСервиса = "";
	
	Попытка
		
		WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , ,3);
		WSПрокси = Новый WSПрокси(WSОпределение, "Data", "ARMStoreKeeper", "ARMStoreKeeperSoap" );
		//WSПрокси.Пользователь = "webadmin";
		//WSПрокси.Пароль = "web";		
		
		Ответ = WSПрокси.GetListOfDocumentsPTU();
				
		Если ТипЗнч(Ответ) = Тип("ХранилищеЗначения") Тогда			
			//Данные = ОбщегоНазначения.ХранилищеJSONВСтруктуру(Ответ);
			РезультатВебСервиса = Ответ.Получить();			
		КонецЕсли; 	
		
	Исключение
		
		Сообщить("Ошибка подключения к сервису обновления");
		
	КонецПопытки; 
		                                                   	
КонецПроцедуры


&НаСервере
Процедура ПолучитьОписаниеТовараНаСервере()
	
	РезультатВебСервиса = "";
	
	Попытка
		
		WSОпределение = Новый WSОпределения(ПолучитьАдресВебСервиса(), , , ,3);
		WSПрокси = Новый WSПрокси(WSОпределение, "Data", "ARMStoreKeeper", "ARMStoreKeeperSoap" );
		//WSПрокси.Пользователь = "webadmin";
		//WSПрокси.Пароль = "web";		
		
		Ответ = WSПрокси.GetDescriptionGood(ГУИДТовара);        
		
		Если ТипЗнч(Ответ) = Тип("ХранилищеЗначения") Тогда
			//Данные = ОбщегоНазначения.ХранилищеJSONВСтруктуру(Ответ);
			РезультатВебСервиса = Ответ.Получить();		
		КонецЕсли; 	
		
	Исключение
		
		Сообщить("Ошибка подключения к сервису обновления");
		
	КонецПопытки; 
		
КонецПроцедуры
 

&НаКлиенте
Процедура ПолучитьОписаниеТовара(Команда)
	ПолучитьОписаниеТовараНаСервере();		
КонецПроцедуры


#КонецОбласти  

&НаКлиенте
Процедура WorkПолучитьСписокДокументов(Команда)
	ОбщегоНазначения.ЗагрузитьСписокДокументовПТУ();
КонецПроцедуры

&НаКлиенте
Процедура WorkПолучитьСписокТоваровДокументаПТУ(Команда)
	ОбщегоНазначения.ЗагрузитьСписокТовараДокументаПТУ(ГУИДДокументаПТУ);
КонецПроцедуры

&НаКлиенте
Процедура WorkДобавитьШтрихкод(Команда)
	
	Результат = ОбщегоНазначения.ПрисвоитьШтрихкодТовару(Штрихкод, ГУИДТовара);
	Если Результат <> Неопределено И Результат.BarcodeAdded = 1 Тогда		
		Сообщить("Barcode " + Строка(Результат.BarcodeAdded));		
	Иначе 
		Сообщить("Barcode " + Строка(Результат.BarcodeAdded));		
		Сообщить("Error " + Результат.Error); 		
		Сообщить("Результат неопределен");
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СисИнфор = Новый СистемнаяИнформация;
	Индентификатор = СисИнфор.ИдентификаторКлиента;	

КонецПроцедуры





