&НаСервере
Функция ПолучитьАдресВебСервиса() Экспорт                 
	
	Адрес = Константы.Адрес.Получить();
	
	//+Шульман А. 13.11.2025 #UT10-5504
	Если Адрес = "hs-sql-test/kazan_asanov" Тогда    
		// для базы Srvr="hs-sql-test2";Ref="kazan_asanov";
		Возврат "http://hs-sql-test/kazan_asanov/ws/ARMStoreKeeper.1cws?wsdl";
	КонецЕсли;     
	//-Шульман А. 13.11.2025 #UT10-5504
	
	Если ОбщегоНазначения.ПолучитьРежимРаботыПриложения() = "Production" Тогда
		
		Если Константы.ТестированиеВключено.Получить() = Истина Тогда
			#Если МобильноеПриложениеСервер Тогда
				Возврат "http://" + Адрес + "/armklad/ws/ARMStoreKeeper_Test.1cws?wsdl";     	
			#Иначе					
				Возврат "http://192.168.1.117/armklad/ws/ARMStoreKeeper_Test.1cws?wsdl";				
			#КонецЕсли   		
		Иначе
			//#Если МобильноеПриложениеСервер Тогда
				Возврат "http://" + Адрес + "/armklad/ws/ARMStoreKeeper.1cws?wsdl";     	
			//#Иначе					
			//	Возврат "http://192.168.1.117/armklad/ws/ARMStoreKeeper.1cws?wsdl";				
			//#КонецЕсли   		
			
		КонецЕсли; 
	Иначе
		Если Константы.ТестированиеВключено.Получить() = Истина Тогда
			Возврат "http://192.168.1.117/armklad/ws/ARMStoreKeeper_Test.1cws?wsdl";	
		Иначе
			Возврат "http://192.168.1.117/armklad/ws/ARMStoreKeeper.1cws?wsdl";	
		КонецЕсли;		
	КонецЕсли;	
КонецФункции                                                

&НаСервере
Функция ПолучитьTimeout() Экспорт
	Возврат Константы.Timeout.Получить();
КонецФункции

