
&НаКлиенте
Процедура ОтправитьЛогиТСД(Команда)

	Оповещение = Новый ОписаниеОповещения("ЗакрытиеФормыДополнительныйФункционал", ЭтаФорма);
	
	РезультатСтруктура = ОбщегоНазначения.ОтправитьЛогиТСДвУТ10();
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
		ПоказатьПредупреждение(Оповещение,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		
	Иначе
		ПоказатьПредупреждение(Оповещение, "Инфо: Логи отправлены на сервер", 4); 		
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ЗакрытиеФормыДополнительныйФункционал(Результат) Экспорт 
	Закрыть();	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(ОбщегоНазначения.ПолучитьПользователяГУИД()) Тогда
		
		Отказ = Истина;
		ОткрытьФорму("ОбщаяФорма.Авторизация");
						
	КонецЕсли; 

	
КонецПроцедуры
 