	
&НаКлиенте
Функция ЗаполнитьТабЗначОК(ЭтаФорма) Экспорт
	
	СтрокаТЗ = ЭтаФорма.КнопкаОК.Добавить();
	СтрокаТЗ.Ок = "ОК";
	СтрокаТЗ.Продолжить= "Продолжить";
	СтрокаТЗ.Заглушка = "";		
	
КонецФункции

&НаКлиенте
Функция ЗаполнитьТЗРазместитьТовары(ЭтаФорма) Экспорт
	
	СтрокаТЗ = ЭтаФорма.КнопкаРазместитьТовары.Добавить();
	СтрокаТЗ.РазместитьТовары = "Разместить товары";		
	
КонецФункции


&НаКлиенте
Функция ЗаполнитьТЧКнопокДляШКнеНайден(ЭтаФорма) Экспорт
	
	СтрокаТЗ = ЭтаФорма.КнопкаПропустить.Добавить();
	СтрокаТЗ.Пропустить = Символы.ПС + "ПРОПУСТИТЬ    " + Символы.ПС;
	
	СтрокаТЗ = ЭтаФорма.КнопкаДобавитьШтрихкод.Добавить();
	СтрокаТЗ.ДобавитьШтрихкод = Символы.ПС + Символы.ПС + "ДОБАВИТЬ ШТРИХКОД К ТОВАРУ";
	
	СтрокаТЗ = ЭтаФорма.КнопкаВыбратьТоварИзДокумента.Добавить();
	СтрокаТЗ.ВыбратьТовар = "ВЫБРАТЬ ТОВАР ИЗ ДОКУМЕНТА";
	
	Если ЭтаФорма.ИмяФормы = "Обработка.ПеремещениеТовараИзЯчейки.Форма.ФормаПеремещениеНоменклатуры" Тогда
		СтрокаТЗ.ВыбратьТовар = "ВЫБРАТЬ ТОВАР ИЗ ЯЧЕЙКИ";	
	ИначеЕсли ЭтаФорма.ИмяФормы = "Обработка.ПриемкаКоллективная.Форма.ФормаРазмещениеТовара" Тогда
		СтрокаТЗ.ВыбратьТовар = "ВЫБРАТЬ ТОВАР ИЗ ДОКУМЕНТА";	
	КонецЕсли; 
	
	
КонецФункции
 
	
&НаКлиенте
Функция СканированныйШтрихкодЯвляетсяЯчейкой(Штрихкод, Ячейка) Экспорт
	
	Результат = Ложь;
	Если ВРег(Штрихкод) = ВРег(Ячейка) Тогда
		Результат = Истина;
	КонецЕсли; 
	
	Возврат Результат;
	                
КонецФункции


&НаКлиенте
Функция ПроигратьЗвуковойФайлОшибки() Экспорт
	
	//+Шульман А. 05.12.2025 #UT10-5576  
	//ЗаписыватьРасширенныеЛоги = ОбщегоНазначения.ПолучитьКонстанту("ЗаписыватьРасширенныеЛоги");  
	//
	//Если ЗаписыватьРасширенныеЛоги Тогда
	//	ASK_ОбработкаОшибок.ПолучитьСтекВызовов("ПроигратьЗвуковойФайлОшибки", " ", Истина);
	//КонецЕсли;       
	//-Шульман А. 05.12.2025 #UT10-5576
	
	#Если МобильноеПриложениеКлиент Тогда		
		Попытка
			
			//ПутьДоФайла = "\\storage\\emulated\\0\\Install\\SoundsFile\\Error-converted.mp3";		
			ПутьДоФайла = ОбщегоНазначения.ПолучитьПутьДоЗвукФайлаОшибки();
			СредстваМультимедиа.ВоспроизвестиАудио(ПутьДоФайла); 
			
		Исключение
		    
		КонецПопытки; 				
	#КонецЕсли	
	                                                                                 
КонецФункции


&НаКлиенте
Функция ПроигратьЗвуковойФайлЯчейки() Экспорт
	
	#Если МобильноеПриложениеКлиент Тогда		
		Попытка
			
			//ПутьДоФайла = "\\storage\\emulated\\0\\Install\\SoundsFile\\Cell-converted.mp3";		
			ПутьДоФайла = ОбщегоНазначения.ПолучитьПутьДоЗвукФайлаЯчейки();
			СредстваМультимедиа.ВоспроизвестиАудио(ПутьДоФайла); 
			
		Исключение
		    
		КонецПопытки; 				
	#КонецЕсли	
	                                                                                 
КонецФункции

&НаКлиенте
Функция ОткрытьФормуКоллективнойПриемки() Экспорт
	
	ОткрытьФорму("Обработка.ПриемкаКоллективная.Форма.ФормаСпискаПТУ");
	
КонецФункции

&НаКлиенте
Функция СформироватьПараметрыДляФормы(ИмяОбработки, Объект) Экспорт
	
	Если ИмяОбработки = "ПриемкаКоллективная" Тогда
		
		ПараметрыРаботы = Новый Структура;
		ПараметрыРаботы.Вставить("НомерСкладскогоДокумента", Объект.НомерСкладскогоДокумента);
		ПараметрыРаботы.Вставить("ЯчейкаПриемки", Объект.ЯчейкаПриемки);
		ПараметрыРаботы.Вставить("ЯчейкаПриемкиГУИД", Объект.ЯчейкаПриемкиГУИД);
		ПараметрыРаботы.Вставить("ДокументГУИД", Объект.ДокументГУИД);	
		//+Шульман А. 13.11.2025 #UT10-5504
		ПараметрыРаботы.Вставить("ПоставкаОтВнешнегоПоставщика", Объект.ПоставкаОтВнешнегоПоставщика);
		//-Шульман А. 13.11.2025 #UT10-5504    
		
	ИначеЕсли ИмяОбработки = "ПеремещениеТовараИзЯчейки"  Тогда 
		
		ПараметрыРаботы = Новый Структура;
		ПараметрыРаботы.Вставить("ЯчейкаКуда", Объект.ЯчейкаКуда);
		ПараметрыРаботы.Вставить("ЯчейкаКудаГУИД", Объект.ЯчейкаКудаГУИД);
		ПараметрыРаботы.Вставить("ЯчейкаОткуда", Объект.ЯчейкаОткуда);
		ПараметрыРаботы.Вставить("ЯчейкаОткудаГУИД", Объект.ЯчейкаОткудаГУИД);			
		
	КонецЕсли; 
	                          
	Возврат ПараметрыРаботы;	
		
КонецФункции

 
&НаКлиенте
Функция ПодключитьКомпоненту(РежимПодключения = "Broadcast") Экспорт
	
	//Return Неопределено;
	
	#Если МобильноеПриложениеКлиент Тогда
		
	Возврат ПодключитьКомпоненту_AddInBroadcastsUniversalBroadcast(РежимПодключения );
	     	
	#КонецЕсли

	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция ПодключитьКомпоненту_ДрайверMobileDriver() Экспорт
	
	
	
КонецФункции

&НаКлиенте
Функция ПодключитьКомпоненту_AddInBroadcastsUniversalBroadcast(РежимПодключения = "Broadcast") Экспорт
	
	//Return Неопределено;
	
#Если МобильноеПриложениеКлиент Тогда
	                                                                             
	// Работает для ТСД модели PM 80
	//ИмяСобытия = "device.scanner.EVENT";
	//Параметр = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонДанных,"EXTRA_EVENT_DECODE_VALUE",XMLСтрока(Истина),XMLСтрока(15));						
	
	
	//ТСД CipherLab RS30 и С70
	//ИмяСобытия = "com.scanner.broadcast";
	//Параметр = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонДанных,"data",XMLСтрока(Ложь),XMLСтрока(0));						
	
	// ТСД UROVO i6300	
	//ИмяСобытия = "android.intent.ACTION_DECODE_DATA";
	//Параметр = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонДанных,"barcode_string",XMLСтрока(Ложь),XMLСтрока(0));						
	
	// ТСД Honeywell CT 60                                       
	// ИмяСобытия = "com.honeywell.sample.action.BARCODE_DATA";
	// Параметр = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонДанных,"data",XMLСтрока(Ложь),XMLСтрока(0));						
	
	// ТСД Honeywell CT 60                                       
	ИмяСобытия = "com.honeywell.sample.action.BARCODE_DATA";	
	Если ПодключитьВнешнююКомпоненту("ОбщийМакет.Component", "Broadcasts", ТипВнешнейКомпоненты.Native) Тогда
		
		Если РежимПодключения = "Broadcast" Тогда
			                                                                                   
			Компонента = Новый("AddIn.Broadcasts.UniversalBroadcast");                         
			Компонента.УстановитьПараметр("FilterName", ИмяСобытия);
			
			ШаблонДанных = Компонента.ПолучитьШаблонОписанияДанных();		    
			Параметр = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонДанных,"data",XMLСтрока(Ложь),XMLСтрока(0));									
			Компонента.УстановитьПараметр("CaptureData",Параметр);
			//Компонента.УстановитьПараметр("Category",Параметр);
			
			Возврат Компонента;
			
		КонецЕсли;                                                                        
		
		Если РежимПодключения = "clipboard" Тогда
				                                                                        
			КомпонентаБуфер = Новый("AddIn.Broadcasts.Clipboard");                       
			СодержимоеБуфера = КомпонентаБуфер.СодержимоеБуфера;
			КомпонентаБуфер.Подключить();                                       
			
			Возврат КомпонентаБуфер;
			
		КонецЕсли;
		
	Иначе
		ПоказатьПредупреждение(,"Компонента не подключена",5);              
	КонецЕсли;
#КонецЕсли

	Возврат Неопределено;
	
КонецФункции


&НаКлиенте
Функция ПолучитьОписаниеСотрудника() Экспорт 
	
	Возврат ОбщегоНазначения.ПолучитьНаименованиеСотрудника();
	
КонецФункции
 

&НаКлиенте
Функция ПолучитьОтображениеОРежимеВводеКоличества() Экспорт                     
	
	Результат = "";
	РежимВводаАвтоматический = ОбщегоНазначения.УстановленРежимВводаАвтоматический();
	Если РежимВводаАвтоматический Тогда
		Результат = "А";
		//Результат = "Режим: автомат.ввод кол-ва"; 		
	Иначе		
		Результат = "Р";
		//Результат = "Режим: ручной ввод кол-ва"; 
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции


&НаКлиенте
Функция ПолучитьДляОтсканированногоТовара_Структура(НайденныйТовар, ОстатокПоТоваруВДокументе) Экспорт
			
	Результат = Новый Структура;
	Если НайденныйТовар.Свойство("ГруппаАВСФилиала") Тогда 
		Результат.Вставить("ГруппаАВСФилиала", НайденныйТовар.ГруппаАВСФилиала); 
	КонецЕсли; 
	Результат.Вставить("КодПроизводителя", НайденныйТовар.КодПроизводителя);
	Результат.Вставить("Производитель", НайденныйТовар.Производитель);
	Результат.Вставить("Наименование", НайденныйТовар.Наименование);
	Результат.Вставить("Кратность", "Кратность: " + Строка(НайденныйТовар.Кратность) + Символы.ПС);
		
	Сканировано = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Сканировано %1 из %2", 
				Строка(ОстатокПоТоваруВДокументе.КоличествоВБуфере + ОстатокПоТоваруВДокументе.КоличествоВРазмещении), 
				Строка(ОстатокПоТоваруВДокументе.КоличествоВДокументе),				       
				НайденныйТовар.ЕдИзмНаименование);
					
	Результат.Вставить("Сканировано", Сканировано);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьДляОтсканированногоТовараДляМаркировки_Структура(НайденныйТовар , ОстатокПоТоваруВДокументе ) Экспорт
			
	Результат = Новый Структура;
	Если НайденныйТовар.Свойство("ГруппаАВСФилиала") Тогда 
		Результат.Вставить("ГруппаАВСФилиала", НайденныйТовар.ГруппаАВСФилиала); 
	КонецЕсли; 
	Результат.Вставить("КодПроизводителя", НайденныйТовар.КодПроизводителя);
	Результат.Вставить("Производитель", НайденныйТовар.Производитель);
	Результат.Вставить("Наименование", НайденныйТовар.Наименование);
	Результат.Вставить("Кратность", "Кратность: " + Строка(НайденныйТовар.Кратность) + Символы.ПС);
		
	Сканировано = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Сканировано %1 из %2", 
				Строка(ОстатокПоТоваруВДокументе.КоличествоОтсканированныхМаркировок + ОстатокПоТоваруВДокументе.КоличествоВБуфереМаркировок), 
				Строка(ОстатокПоТоваруВДокументе.КоличествоТоваровСМаркировкой));      
					
	Результат.Вставить("Сканировано", Сканировано);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьДляОтсканированногоТовара_Структура_Инвентаризация(НайденныйТовар, КоличествоНабраноНаТСД) Экспорт
			
	Результат = Новый Структура;
	Результат.Вставить("КодПроизводителя", НайденныйТовар.КодПроизводителя);
	Результат.Вставить("Производитель", НайденныйТовар.Производитель);
	Результат.Вставить("Наименование", НайденныйТовар.Наименование);
	Результат.Вставить("Кратность", "Кратность: " + Строка(НайденныйТовар.Кратность) + Символы.ПС);
		
	Сканировано = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Сканировано %1 %2", 
				Строка(КоличествоНабраноНаТСД), 
				НайденныйТовар.ЕдИзмНаименование);
					
	Результат.Вставить("Сканировано", Сканировано);
	
	Возврат Результат;
	
КонецФункции


&НаКлиенте
Функция ПолучитьОписаниеОтсканированногоТовара_Структура_Перемещение(НайденныйТовар,  
														   			 ОстатокПоТоваруВЯчейке,
														   			 ОстатокВЯчейкеКуда,
														   			 ОстатокВыбранногоТовараНаСкладе) Экспорт
			
	Результат = Новый Структура;
	Если НайденныйТовар.Свойство("ГруппаАВСФилиала") Тогда 
		Результат.Вставить("ГруппаАВСФилиала", НайденныйТовар.ГруппаАВСФилиала); 
	КонецЕсли;
	Результат.Вставить("КодПроизводителя", НайденныйТовар.КодПроизводителя);
	Результат.Вставить("Производитель", НайденныйТовар.Производитель);
	Результат.Вставить("Наименование", НайденныйТовар.Наименование);
	Результат.Вставить("Кратность", "Кратность: " + Строка(НайденныйТовар.Кратность) + Символы.ПС);
		
	Сканировано = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Сканировано %1 из %2", 
																		  Строка(ОстатокПоТоваруВЯчейке.КоличествоНабрано), 
																		  Строка(ОстатокПоТоваруВЯчейке.ОстатокВЯчейке) );
					
	Результат.Вставить("Сканировано", Сканировано);
		
	КоличествоТовараВЯчейкеКуда = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("В ячейке ""Куда"" %1 %2",
																	   					  Строка(ОстатокВЯчейкеКуда),
																	   					  НайденныйТовар.ЕдИзмНаименование);
	Результат.Вставить("КоличествоТовараВЯчейкеКуда", КоличествоТовараВЯчейкеКуда);			
	
	ВсегоНаСкладе =  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Всего на складе %1 %2", 
																		      Строка(ОстатокВыбранногоТовараНаСкладе), 
																			  НайденныйТовар.ЕдИзмНаименование);
	Результат.Вставить("ВсегоНаСкладе", ВсегоНаСкладе);
	
	Возврат Результат;
	
КонецФункции


&НаКлиенте
Функция ПолучитьТекстДляОтсканированногоТовара(НайденныйТовар, ОстатокПоТоваруВДокументе) Экспорт
		
	Результат = """%1"" %2 %3" + Символы.ПС;
	Результат = Результат + " кратность %4" + Символы.ПС;
	Результат = Результат + "Сканировано %5 из %6 %7" + Символы.ПС;
	Результат = Результат + "всего в поставке %6" ;
	
	КоличествоНабрано = ОстатокПоТоваруВДокументе.КоличествоВБуфере + ОстатокПоТоваруВДокументе.КоличествоВРазмещении;
	
	Результат  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Результат, 
			Строка(НайденныйТовар.КодПроизводителя),
			НайденныйТовар.Производитель, 			
			НайденныйТовар.Наименование, 
			Строка(НайденныйТовар.Кратность),			
			//Строка(ОстатокПоТоваруВДокументе.КоличествоВБуфере),
			Строка(КоличествоНабрано),
			Строка(ОстатокПоТоваруВДокументе.КоличествоВДокументе), 			
			НайденныйТовар.ЕдИзмНаименование
			);						
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьОписаниеТовара(НайденныйТовар) Экспорт
		
	Результат = """%1"" %2 %3" + Символы.ПС;
	                                                                  
	Результат  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Результат, 
			Строка(НайденныйТовар.КодПроизводителя),
			НайденныйТовар.Производитель,
			НайденныйТовар.Наименование);						
	
	Возврат Результат;
	
КонецФункции
 
&НаКлиенте                                                                             
Процедура ОтобразитьИнформациюОТоваре(ИнформацияОТоваре, Ошибка, ЭтаФорма) Экспорт
	
	ОчиститьПоляНайденныйТовар(ЭтаФорма);		
	ЭтаФорма.ОписаниеНайденногоТовара = ИнформацияОТоваре;
	Если ЗначениеЗаполнено(Ошибка) Тогда
		
		ЭтаФорма.ОписаниеОшибки = Ошибка;
		Оповестить("СканированиеШтрихкода");
		Возврат;                                                                        
		
	КонецЕсли;                                                                
			
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоляНайденныйТовар(ЭтаФорма) Экспорт
	                                                               
	Если ЭтаФорма.ИмяФормы = "Обработка.ПриемкаКоллективная.Форма.ФормаРазмещениеТовара" Тогда
		ЭтаФорма.Набрано.Очистить();
	КонецЕсли;  

	Если ЭтаФорма.ИмяФормы = "Обработка.ПеремещениеТовараИзЯчейки.Форма.ФормаПеремещениеНоменклатуры" Тогда
		ЭтаФорма.Набрано.Очистить();
	КонецЕсли;                                                                                     
	
	Если ЭтаФорма.ИмяФормы = "Обработка.ИнвентаризацияПоЯчейкам.Форма.ФормаРаботыСЗаданиемНаИнвентаризацию" Тогда
		ЭтаФорма.Набрано.Очистить();
	КонецЕсли; 
	
	Если ЭтаФорма.ИмяФормы = "Обработка.ПриемкаКоллективная.Форма.ФормаРазмещениеГМ" Тогда
		ЭтаФорма.Набрано.Очистить();
	КонецЕсли; 
	
	//+Кабанов А.В. 04.09.2025 # UT10-5361	
	Если ЭтаФорма.ИмяФормы = "Обработка.ПриемкаКоллективная.Форма.ФормаСканированияМаркировок" Тогда
		ЭтаФорма.Набрано.Очистить();
	КонецЕсли; 
	//+Кабанов А.В. 04.09.2025 # UT10-5361	
	
КонецПроцедуры
 
&НаКлиенте
Процедура ИнициализацияТЗ_Набрано(ЭтаФорма) Экспорт
	
	ЭтаФорма.Набрано.Очистить();
	НоваяСтрока = ЭтаФорма.Набрано.Добавить();
	
	Если ЭтаФорма.ИмяФормы = "Обработка.ПогрузкаВАвто.Форма.ФормаГрузовогоМеста" Или 
		 ЭтаФорма.ИмяФормы = "Обработка.РазгрузкаАвто.Форма.ФормаГрузовогоМеста" Или 
		 ЭтаФорма.ИмяФормы = "Обработка.ПриемкаГрузовыхМестИзРазгрузкиАвто.Форма.ФормаГрузовогоМеста" Тогда
		
		НоваяСтрока.Заголовок = "Место:";
		Возврат;
		
	КонецЕсли; 
		
	ТекстСообщения = "Отсканированный штрихкод " + ЭтаФорма.Штрихкод + " не найден в поставке!";
	НоваяСтрока.СообщениеШКнеНайденВПоставке = ТекстСообщения;
	
	ТекстСообщения = "Отсканированный штрихкод " + ЭтаФорма.Штрихкод + " не найден в ячейке!";
	НоваяСтрока.СообщениеШКнеНайденВЯчейке = ТекстСообщения;
	
	НоваяСтрока.Заголовок = "Товар:";
	
КонецПроцедуры


&НаКлиенте                                                                             
Процедура ОтобразитьИнформациюОТоваре_Структура(ИнформацияОТоваре, Ошибка, ЭтаФорма) Экспорт
	
	ЭтаФорма.ОписаниеНайденногоТовара = "";
	Если ЗначениеЗаполнено(Ошибка) Тогда
		
		ЭтаФорма.ОписаниеОшибки = Ошибка;
		Оповестить("СканированиеШтрихкода");
		//Возврат;
		
	КонецЕсли;                                                                
	
	ИнициализацияТЗ_Набрано(ЭтаФорма);
	
	НоваяСтрока = ЭтаФорма.Набрано[0];
	Если ИнформацияОТоваре.Свойство("ГруппаАВСФилиала") И НоваяСтрока.Свойство("ГруппаАВСФилиала") Тогда
		НоваяСтрока.ГруппаАВСФилиала = ИнформацияОТоваре.ГруппаАВСФилиала;
	КонецЕсли;
	НоваяСтрока.КодПроизводителя = ИнформацияОТоваре.КодПроизводителя;
	НоваяСтрока.Кратность = ИнформацияОТоваре.Кратность;
	НоваяСтрока.Производитель = ИнформацияОТоваре.Производитель;
	НоваяСтрока.Наименование = ИнформацияОТоваре.Наименование;
	НоваяСтрока.Сканировано = ИнформацияОТоваре.Сканировано;
	
	Если ИнформацияОТоваре.Свойство("КоличествоТовараВЯчейкеКуда", )  Тогда
		НоваяСтрока.КоличествоТовараВЯчейкеКуда = ИнформацияОТоваре.КоличествоТовараВЯчейкеКуда;
	КонецЕсли; 
	
	Если ИнформацияОТоваре.Свойство("ВсегоНаСкладе", ) Тогда
		НоваяСтрока.ВсегоНаСкладе = ИнформацияОТоваре.ВсегоНаСкладе;
	КонецЕсли; 

	
КонецПроцедуры 

Процедура ОтобразитьИнформациюОГМ_Структура(ИнформацияОТоваре, Ошибка, ЭтаФорма) Экспорт
	
	ЭтаФорма.ОписаниеНайденногоТовара = "";
	Если ЗначениеЗаполнено(Ошибка) Тогда
		
		ЭтаФорма.ОписаниеОшибки = Ошибка;
		Оповестить("СканированиеШтрихкода");
		
	КонецЕсли;  
	
	ЭтаФорма.Набрано.Очистить();
	НоваяСтрока = ЭтаФорма.Набрано.Добавить();
		
	ТекстСообщения = "Отсканированный штрихкод " + ЭтаФорма.Штрихкод + " не найден в поставке!";
	НоваяСтрока.СообщениеШКнеНайденВПоставке = ТекстСообщения;
	
	ТекстСообщения = "Отсканированный штрихкод " + ЭтаФорма.Штрихкод + " не найден в ячейке!";
	НоваяСтрока.СообщениеШКнеНайденВЯчейке = ТекстСообщения;
	
	НоваяСтрока.Заголовок = "Грузоместо:";
	НоваяСтрока.Наименование = ИнформацияОТоваре.Наименование;
	
КонецПроцедуры 

&НаКлиенте
Функция ПолучитьТекстДляОтсканированногоТовараПеремещения(НайденныйТовар, 
														  ОстатокПоТоваруВЯчейке,
														  ОстатокВЯчейкеКуда,
														  ОстатокВыбранногоТовараНаСкладе) Экспорт
		
	Результат = """%1"" %2 %3" + Символы.ПС;
	Результат = Результат + " кратность %4" + Символы.ПС;
	Результат = Результат + "Сканировано %5 из %6 %7" + Символы.ПС;
	Результат = Результат + "В ячейке ""Куда"" %8 %7" + Символы.ПС;
	Результат = Результат + "Всего на складе %9 %7";                       
	
	
	Результат  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Результат, 
			НайденныйТовар.КодПроизводителя,
			НайденныйТовар.Производитель, 			
			НайденныйТовар.Наименование, 
			НайденныйТовар.Кратность,			
			ОстатокПоТоваруВЯчейке.КоличествоНабрано,
			ОстатокПоТоваруВЯчейке.ОстатокВЯчейке, 			
			НайденныйТовар.ЕдИзмНаименование,
			ОстатокВЯчейкеКуда,                                                                
			ОстатокВыбранногоТовараНаСкладе
			);						
	
	Возврат Результат;
	
КонецФункции
  

&НаКлиенте
Процедура ОтобразитьИнформациюОТоваре_ОстаткиТоваровПоШК(ЭтаФорма, ЗначениеДляПоиска, МассивДанных) Экспорт 
	
	Структура = МассивДанных[0];
	
	ЭтаФорма.Набрано.Очистить();
	НоваяСтрока = ЭтаФорма.Набрано.Добавить();
	Если Структура.Свойство("ГруппаАВСФилиала") И НоваяСтрока.Свойство("ГруппаАВСФилиала") Тогда
		НоваяСтрока.ГруппаАВСФилиала = Структура.ГруппаАВСФилиала;
	КонецЕсли;
	НоваяСтрока.СообщениеТоварНеНайден = "";
	НоваяСтрока.НаСкладеЗаголовок = "На складе:";
	НоваяСтрока.ВРезервеЗаголовок = "В резерве:";
	НоваяСтрока.Заголовок = "Товар:";
	НоваяСтрока.Наименование = Структура.Наименование;
	НоваяСтрока.КодПроизводителя = Структура.КодПроизводителя;
	НоваяСтрока.Производитель = Структура.Производитель;
	НоваяСтрока.Штрихкод = ЗначениеДляПоиска;
	НоваяСтрока.НаСкладе = Структура.КоличествоНаСкладе;
	НоваяСтрока.ВРезерве = Структура.КоличествоВРезерве;
	НоваяСтрока.НаСкладеСтр = СокрЛ(Строка(Структура.КоличествоНаСкладе)) + " ед.";
	НоваяСтрока.ВРезервеСтр = СокрЛ(Строка(Структура.КоличествоВРезерве)) + " ед.";
	
КонецПроцедуры

&НаКлиенте
Функция ТаблицуВМассив(Таблица) Экспорт
	
	МассивДанных = Новый Массив;                                            
	
	Для каждого ТекСтрока Из Таблица Цикл
		
		СтруктураДанных = Новый Структура;
		
		Для каждого Колонка ИЗ Таблица.Колонки Цикл			

			СтруктураДанных.Вставить(Колонка.Имя, ТекСтрока[Колонка.Имя]);				
						
		КонецЦикла;
		
		МассивДанных.Добавить(СтруктураДанных);

	КонецЦикла;         
	
	Возврат МассивДанных;

КонецФункции    

Функция РазложитьСтрокуВМассив(Знач Стр, Разделитель = ";") Экспорт
	 
	 МассивСтрок = Новый Массив();  
	 
	 Если Разделитель = " " Тогда 
		 
		Стр = СокрЛП(Стр);    
		
		Пока 1 = 1 Цикл         
			
			Поз = Найти(Стр,Разделитель); 
			
			Если Поз = 0 Тогда              
				
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;     
				
			КонецЕсли;
			
			МассивСтрок.Добавить(Лев(Стр, Поз - 1));
			Стр = СокрЛ(Сред(Стр, Поз));
			
		КонецЦикла;  
		
	Иначе         
		
		ДлинаРазделителя = СтрДлина(Разделитель); 
		
		Пока 1 = 1 Цикл   
			
			Поз = Найти(Стр,Разделитель);
			
			Если Поз = 0 Тогда  
				
				МассивСтрок.Добавить(Стр);				
				Возврат МассивСтрок;    
				
			КонецЕсли;                 
			
			МассивСтрок.Добавить(Лев(Стр, Поз - 1)); 
			
			Стр = Сред(Стр, Поз + ДлинаРазделителя);
			
		КонецЦикла;   
		
	КонецЕсли;	

КонецФункции

&НаКлиенте
Процедура ПолучитьИнформациюОТовареДляПеремещенияТовара(ЭтаФорма) Экспорт

	Объект        = ЭтаФорма.Объект;
	Штрихкод      = ЭтаФорма.Штрихкод; 
	ТоварГУИД     = ЭтаФорма.ТоварГУИД;                                              
	ДокументГУИД  = Объект.ДокументГУИД;                                                  
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Получить остаток по найденному товару	
	ТоварГУИД = ЭтаФорма.НайденныйТовар.Владелец;
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	// Получить остаток по найденному товару в ячейке КУДА			
	РезультатСтруктура = ОбщегоНазначения.ПолучитьОстатокПоТоваруВЯчейке(Объект.ЯчейкаКудаГУИД, Штрихкод, ТоварГУИД);

	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();			
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		Возврат;
		
	КонецЕсли; 
	
	Если РезультатСтруктура.Данные.Количество() = 0 Или РезультатСтруктура.Данные[0].ОстатокВЯчейке = 0 Тогда
		ЭтаФорма.ОстатокВЯчейкеКуда = 0;
	Иначе
		ЭтаФорма.ОстатокВЯчейкеКуда = РезультатСтруктура.Данные[0].ОстатокВЯчейке;
	КонецЕсли; 
	

	// Получить ВЕСЬ остаток по найденному товару 
	РезультатСтруктура = ОбщегоНазначения.ПолучитьОстатокТовара(ТоварГУИД);	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();			
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		Возврат;		
		
	КонецЕсли; 	
	
	ЭтаФорма.ОстатокВыбранногоТовараНаСкладе = РезультатСтруктура.Данные;
	
	ИнформацияОТовареСтруктура = ОбщегоНазначенияКлиент.ПолучитьОписаниеОтсканированногоТовара_Структура_Перемещение(ЭтаФорма.НайденныйТовар, 
																								 ЭтаФорма.ОстатокПоТоваруВЯчейке,
																								 ЭтаФорма.ОстатокВЯчейкеКуда,
																								 ЭтаФорма.ОстатокВыбранногоТовараНаСкладе);
																									
	ОбщегоНазначенияКлиент.ОтобразитьИнформациюОТоваре_Структура(ИнформацияОТовареСтруктура, "", ЭтаФорма);
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
КонецПроцедуры


&НаКлиенте
Функция ОтобразитьИнформациюОГрузовомМесте_Структура(ГрузовоеМесто, ЭтаФорма) Экспорт
				
	ИнициализацияТЗ_Набрано(ЭтаФорма);
	
	НоваяСтрока = ЭтаФорма.Набрано[0];
	НоваяСтрока.НомерДокументаГрузовогоМеста = ГрузовоеМесто.ГрузовоеМестоНомер;
	НоваяСтрока.Грузополучатель = ГрузовоеМесто.Контрагент;
		
КонецФункции


// Проверяет наличие реквизита или свойства у произвольного объекта без обращения к метаданным.
//
// Параметры:
//  Объект       - Произвольный - объект, у которого нужно проверить наличие реквизита или свойства;
//  ИмяРеквизита - Строка       - имя реквизита или свойства.
//
// Возвращаемое значение:
//  Булево - Истина, если есть.
//
Функция ЕстьРеквизитИлиСвойствоОбъекта(Объект, ИмяРеквизита) Экспорт
    
    КлючУникальности   = Новый УникальныйИдентификатор;
    СтруктураРеквизита = Новый Структура(ИмяРеквизита, КлючУникальности);
    ЗаполнитьЗначенияСвойств(СтруктураРеквизита, Объект);
    
    Возврат СтруктураРеквизита[ИмяРеквизита] <> КлючУникальности;
    
КонецФункции


Функция ПолучитьПозицииGS_Тест(Знач ПромШтрихКод) Экспорт        
	
	// На выходе - массив с номерами позиций GS 
	СтрокаGS = "";
	
	// Добавление символов 29 для теста  
	Если (Лев(ПромШтрихКод , 2) = "01" И Сред(ПромШтрихКод,17,2) = "21") Или (Лев(ПромШтрихКод , 4) = "(01)" И Сред(ПромШтрихКод,19,4) = "(21)") Тогда
		
		//+Сёмин Р.И. 29.04.2026 #UT10-5814
		//для теста код должен быть в формате
		//01(GTIN)21(SERIAL)<GS>91(4CHARS)<GS>92(44CHARS)
		//или
		//01(GTIN)21(SERIAL)<GS>93(4CHARS)
		Поз1 = СтрНайти(ПромШтрихКод, "<GS>");
		Поз2 = СтрНайти(ПромШтрихКод, "<GS>", , Поз1 + 1) - 4; //т.к. эти символы надо убрать, и в итоге позиция второго сместится на длину первой убранной группы символов, т.е. на 4 штуки
		//-Сёмин Р.И. 29.04.2026 #UT10-5814
		
		Если Лев(ПромШтрихКод , 2) = "01" Тогда
			
			//+Сёмин Р.И. 29.04.2026 #UT10-5814
			//Поз1 = 32;
			//Поз2 = 38;
			//-Сёмин Р.И. 29.04.2026 #UT10-5814
			
			ЭтоКод93 = Сред(ПромШтрихКод, Поз1, 2) = "93";
			
		Иначе 
			
			//+Сёмин Р.И. 29.04.2026 #UT10-5814
			//Поз1 = 36;
			//Поз2 = 44;
			//-Сёмин Р.И. 29.04.2026 #UT10-5814
			
			ЭтоКод93 = Сред(ПромШтрихКод, Поз1, 4) = "(93)";

		КонецЕсли; 
		
		СтрокаGS = Строка(Поз1) + ?(ЭтоКод93, "", ";" + Строка(Поз2));
		
		ASK_ОбработкаОшибок.ЗаписатьИнформациюВЛогОшибок("Найдена позиция GS", СтрокаGS, "ПолучитьПозицииGS_Тест", "Поиск позиций GS");   
		
	Иначе            
		
		ASK_ОбработкаОшибок.ЗаписатьИнформациюВЛогОшибок("", ПромШтрихКод, "ПолучитьПозицииGS_Тест", "Не найдены 01 и 21");   
		
	КонецЕсли;
	
	Возврат СтрокаGS;   

КонецФункции // ()   

Функция ПолучитьПозицииGS(Знач ДанныеXML, СимволРазделитель) Экспорт        
	
	СтрокаGS = "";
	
	Если СтрНайти(ДанныеXML, СимволРазделитель) = 0 Тогда
		
		ASK_ОбработкаОшибок.ЗаписатьИнформациюВЛогОшибок("", "Символов GS нет", "ПолучитьПозицииGS", "Проверка на наличие GS");   
		Возврат СтрокаGS;
		
	КонецЕсли;  
	
	// Получение позиций GS в массив
	Поз = СтрНайти(ДанныеXML, СимволРазделитель);
	
	Пока Поз > 0 Цикл
		
		ASK_ОбработкаОшибок.ЗаписатьИнформациюВЛогОшибок("Найдена позиция GS", Строка(Поз), "ПолучитьПозицииGS", "Поиск позиций GS");   
		
		СтрокаGS = СтрокаGS + ?(ПустаяСтрока(СтрокаGS), "", ";") + Строка(Поз);        
		ДанныеXML = Лев(ДанныеXML, Поз - 1) + Сред(ДанныеXML, Поз + 4);
		
		Поз = СтрНайти(ДанныеXML, СимволРазделитель);
	
	КонецЦикла;     
	
	ASK_ОбработкаОшибок.ЗаписатьИнформациюВЛогОшибок("", ДанныеXML, "ПолучитьПозицииGS", "Получен штрихкод без GS из шк");   
	
	Возврат СтрокаGS;

КонецФункции // ()   










