&НаКлиенте
Перем ОткрытьФормуПеремещениеТовараИзЯчейки;

&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
	
	ОткрытьФормуСпискаПТУ();
	
КонецПроцедуры

&НаКлиенте
Процедура Декорация2Нажатие(Элемент)
	
	ОткрытьФормуСпискаПТУ();
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСпискаПТУ()
	
	Если ЗначениеЗаполнено(ОбщегоНазначения.ПолучитьПользователяГУИД()) Тогда
		
		ОбщегоНазначения.ОчиститьПараметрыРаботы();
		
		ФормаПриемки = ПолучитьФорму("Обработка.ПриемкаКоллективная.Форма.ФормаСпискаПТУ", , ЭтаФорма);	
		ФормаПриемки.Открыть();
		                
	Иначе 
		
		ОткрытьФорму("ОбщаяФорма.Авторизация");
		
	КонецЕсли; 
	
КонецПроцедуры
 
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "РабочийСтолОбновление" Тогда  
		
		ЭтаФорма.Сотрудник = ОбщегоНазначения.ПолучитьНаименованиеСотрудника();
		Если Не ЗначениеЗаполнено(ЭтаФорма.Сотрудник) Тогда
			ЭтаФорма.Сотрудник = "Не авторизован";
		КонецЕсли; 
		
		//+Кабанов А.В. 07.04.2023 # UT10-3285
		Элементы.Группа8.Видимость = ОбщегоНазначения.ПолучитьРазрешениеНаПроведениеПТУ();
		//-Кабанов А.В. 07.04.2023 # UT10-3285
		
		//+Кабанов А.В. 12.03.2024 # UT10-4328
		Элементы.Группа9.Видимость = ОбщегоНазначения.ПолучитьРазрешениеОтображанияСлужебныхЗаписок();
		//-Кабанов А.В. 12.03.2024 # UT10-4328 
		
		//+Белов А. 04.03.2025 #UT10-5124
		Элементы.Группа10.Видимость = ОбщегоНазначения.ПолучитьРазрешениеОтображанияТЕ();
		//-Белов А. 04.03.2025 #UT10-5124
		
		//+Кабанов А.В. 21.07.2025 # UT10-5343 
		Элементы.Группа11.Видимость = ОбщегоНазначения.ПолучитьРазрешениеОтображанияМаркировкиТоваров();
		//-Кабанов А.В. 21.07.2025 # UT10-5343 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОткрытьФормуПеремещениеТовараИзЯчейки = Ложь;
	//ПодключитьОбработчикОжидания("ОткрытьФормуПеремещениеТовараИзЯчейки", 5, Ложь);	
	
	Если ОбщегоНазначения.ПолучитьРежимРаботыПриложения() = "Developing" Тогда
		Элементы.КомандаТестированияВебСервиса.Видимость = Истина;
	Иначе
		Элементы.КомандаТестированияВебСервиса.Видимость = Ложь;	
	КонецЕсли;
	
	//+Кабанов А.В. 07.04.2023 # UT10-3285
	Элементы.Группа8.Видимость = ОбщегоНазначения.ПолучитьРазрешениеНаПроведениеПТУ();
	//-Кабанов А.В. 07.04.2023 # UT10-3285
	
	//+Кабанов А.В. 12.03.2024 # UT10-4328
	Элементы.Группа9.Видимость = ОбщегоНазначения.ПолучитьРазрешениеОтображанияСлужебныхЗаписок();
	//-Кабанов А.В. 12.03.2024 # UT10-4328  
	
	//+Белов А. 04.03.2025 #UT10-5124
	Элементы.Группа10.Видимость = ОбщегоНазначения.ПолучитьРазрешениеОтображанияТЕ();
	//-Белов А. 04.03.2025 #UT10-5124

	//+Кабанов А.В. 21.07.2025 # UT10-5343 
	//Элементы.Группа11.Видимость = ОбщегоНазначения.ПолучитьРазрешениеОтображанияМаркировкиТоваров();
	//-Кабанов А.В. 21.07.2025 # UT10-5343 
	
КонецПроцедуры

&НаКлиенте
Процедура Декорация5Нажатие(Элемент)
	ОткрытьФормуПеремещениеТовара();
КонецПроцедуры

&НаКлиенте
Процедура Декорация4Нажатие(Элемент)
	ОткрытьФормуПеремещениеТовара();	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПеремещениеТовара()
	
	Если ЗначениеЗаполнено(ОбщегоНазначения.ПолучитьПользователяГУИД()) Тогда
		
		ОбщегоНазначения.ОчиститьПараметрыРаботы();				

		// Необходимо проверить, есть ли не перемещенные товары в буфере.
		РезультатСтруктура = ОбщегоНазначения.ПолучитьСписокТоваровИзБуфераПеремещения("", "");
		
		Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
			ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
			Закрыть();	
			Возврат;
		КонецЕсли; 
		
		
		Если ОбщегоНазначения.ПолучитьРежимРаботыПриложения() = "Developing" Тогда
			
			ФормаПриемки = ПолучитьФорму("Обработка.ПеремещениеТовараИзЯчейки.Форма.ФормаПеремещениеНоменклатуры", , ЭтаФорма);	
			ФормаПриемки.Открыть();
			Возврат;
			
		КонецЕсли; 
		
		Колво = ОбщегоНазначения.ПолучитьКоличествоЗаписейВРегистреСведений("СписокТоваровВБуфереПеремещения");		
		Если Колво > 0 Тогда
			
			Оповещение = Новый ОписаниеОповещения("ФормаНеПеремещенныхТоваровВБуфереПослеЗакрытияФормы", ЭтаФорма);
			ОткрытьФорму("Обработка.ПеремещениеТовараИзЯчейки.Форма.ФормаНеПеремещенныхТоваровВБуфере",,,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);			
			
		Иначе			
			
			ФормаПриемки = ПолучитьФорму("Обработка.ПеремещениеТовараИзЯчейки.Форма.ФормаПеремещениеНоменклатуры", , ЭтаФорма);	
			ФормаПриемки.Открыть();
			
		КонецЕсли; 		
		
	Иначе 
		
		ОткрытьФорму("ОбщаяФорма.Авторизация");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаНеПеремещенныхТоваровВБуфереПослеЗакрытияФормы(Результат, ДополнительныеПараметры) Экспорт
		
	Если Результат <> Неопределено И Результат.ПризнакВозврата = Истина Тогда
		
		 Оповещение = Новый ОписаниеОповещения("ОткрытьФормуПеремещениеТовараИзЯчейки", ЭтаФорма);
		 ПоказатьПредупреждение(Оповещение, Результат.ТекстСообщения, 4);
		
	КонецЕсли;
	
КонецПроцедуры
 
&НаКлиенте
Процедура ОткрытьФормуПеремещениеТовараИзЯчейки(Результат) Экспорт
	
	ФормаПриемки = ПолучитьФорму("Обработка.ПеремещениеТовараИзЯчейки.Форма.ФормаПеремещениеНоменклатуры", , ЭтаФорма);	
	ФормаПриемки.Открыть();	
	
	//Если ОткрытьФормуПеремещениеТовараИзЯчейки Тогда
	//	
	//	ОткрытьФормуПеремещениеТовараИзЯчейки = Ложь;
	//	ФормаПриемки = ПолучитьФорму("Обработка.ПеремещениеТовараИзЯчейки.Форма.ФормаПеремещениеНоменклатуры", , ЭтаФорма);	
	//	ФормаПриемки.Открыть();	
	//	
	//КонецЕсли; 
	
КонецПроцедуры
 
&НаКлиенте
Процедура Декорация7Нажатие(Элемент)
	ОткрытьФормуПогрузкуВАвто();
КонецПроцедуры

&НаКлиенте
Процедура Декорация6Нажатие(Элемент)
	ОткрытьФормуПогрузкуВАвто();
КонецПроцедуры
 
&НаКлиенте
Процедура ОткрытьФормуПогрузкуВАвто()
	
	Если ЗначениеЗаполнено(ОбщегоНазначения.ПолучитьПользователяГУИД()) Тогда
		
		ОбщегоНазначения.ОчиститьПараметрыРаботы();				
		ФормаПриемки = ПолучитьФорму("Обработка.ПогрузкаВАвто.Форма.ФормаСпискаЗаданийНаДоставку", , ЭтаФорма);	
		ФормаПриемки.Открыть();
		
	Иначе 
		
		ОткрытьФорму("ОбщаяФорма.Авторизация");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Декорация8Нажатие(Элемент)
	ОткрытьФормуОстаткиПоЯчейкам();
КонецПроцедуры
 
&НаКлиенте
Процедура ОткрытьФормуОстаткиПоЯчейкам()
	
	Если ЗначениеЗаполнено(ОбщегоНазначения.ПолучитьПользователяГУИД()) Тогда
		
		ОбщегоНазначения.ОчиститьПараметрыРаботы();				             
		ФормаПриемки = ПолучитьФорму("Обработка.ОстаткиПоЯчейкам.Форма.ФормаОстаткиТоваров");
		ФормаПриемки.Открыть();
		
	Иначе 
		
		ОткрытьФорму("ОбщаяФорма.Авторизация");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Приемка(Команда)
	ОткрытьФормуСпискаПТУ();
КонецПроцедуры

&НаКлиенте
Процедура Погрузка(Команда)
	ОткрытьФормуПогрузкуВАвто();
КонецПроцедуры

&НаКлиенте
Процедура Перемещение(Команда)
	ОткрытьФормуПеремещениеТовара();	
КонецПроцедуры

&НаКлиенте
Процедура Остатки(Команда)
	ОткрытьФормуОстаткиПоЯчейкам();
КонецПроцедуры

&НаКлиенте
Процедура Приемка2Нажатие(Элемент)
	ОткрытьФормуСпискаПТУ();
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиВер2(Команда)
	
	Если ЗначениеЗаполнено(ОбщегоНазначения.ПолучитьПользователяГУИД()) Тогда
		
		ОбщегоНазначения.ОчиститьПараметрыРаботы();				             
		ФормаПриемки = ПолучитьФорму("Обработка.ОстаткиПоЯчейкам.Форма.ФормаОстаткиТоваров");
		ФормаПриемки.Открыть();
		
	Иначе 
		
		ОткрытьФорму("ОбщаяФорма.Авторизация");
		
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ПеремещениеВер2(Команда)
	
	Если ЗначениеЗаполнено(ОбщегоНазначения.ПолучитьПользователяГУИД()) Тогда
		
		ОбщегоНазначения.ОчиститьПараметрыРаботы();				             
		ФормаПриемки = ПолучитьФорму("Обработка.ПеремещениеТовараИзЯчейки.Форма.ФормаПеремещениеНоменклатуры");
		ФормаПриемки.Открыть();
		
	Иначе 
		
		ОткрытьФорму("ОбщаяФорма.Авторизация");
		
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура Декорация9Нажатие(Элемент)
	ОткрытьФормуИнвентаризацияПоЯчейкам();
КонецПроцедуры

&НаКлиенте                                                                           
Процедура ИнвентаризацяЯчеек(Команда)                                        
	ОткрытьФормуИнвентаризацияПоЯчейкам();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуИнвентаризацияПоЯчейкам()
	
	Если ЗначениеЗаполнено(ОбщегоНазначения.ПолучитьПользователяГУИД()) Тогда
		
		ОбщегоНазначения.ОчиститьПараметрыРаботы();				             
		ФормаЗаданийНаИнвентаризацию = ПолучитьФорму("Обработка.ИнвентаризацияПоЯчейкам.Форма.ФормаСпискаЗаданийНаИнвентаризацию");
		ФормаЗаданийНаИнвентаризацию.Открыть();
		
	Иначе 
		ОткрытьФорму("ОбщаяФорма.Авторизация");		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначения.ОчиститьКонстантыПоПользователю();
	
	//ОбщегоНазначения.УстановитьРежимРаботы(Перечисления.РежимРаботыПриложения.Developing);
	ОбщегоНазначения.УстановитьРежимРаботы(Перечисления.РежимРаботыПриложения.Production);
	
	Если  ОбщегоНазначения.ПолучитьРежимРаботыПриложения() = "Developing" Тогда 
		Константы.ТестированиеВключено.Установить(Истина);
	Иначе 
		Константы.ТестированиеВключено.Установить(Ложь);
	КонецЕсли;
	//Если  ОбщегоНазначения.ПолучитьРежимРаботыПриложения() = "Developing" Тогда 
	//	
	//	ОбщегоНазначения.УстановитьПользователя("000000117", "fd3c8e7d-7992-11ea-9424-005056892544");		
	//	Константы.ПолноеИмя.Установить("Валеев Рустем Абдулгафарович");
	//	Константы.Пароль.Установить("117");				
		
	//КонецЕсли;
	
КонецПроцедуры                                                       

&НаКлиенте
Процедура КомандаТестированияВебСервиса(Команда)
	
	ФормаДляТестирования = ПолучитьФорму("ОбщаяФорма.ФормаДляТестированияВебСервиса");
	ФормаДляТестирования.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура РазгрузкаАвто(Команда)
	ОткрытьФормуРазгрузкиАвто();
КонецПроцедуры

&НаКлиенте
Процедура Декорация10Нажатие(Элемент)
	ОткрытьФормуРазгрузкиАвто();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРазгрузкиАвто() Экспорт
	
	Если ЗначениеЗаполнено(ОбщегоНазначения.ПолучитьПользователяГУИД()) Тогда
		
		ОбщегоНазначения.ОчиститьПараметрыРаботы();
		ФормаРазгрузкиАвто = ПолучитьФорму("Обработка.РазгрузкаАвто.Форма.ФормаСпискаЗаданийНаДоставку", , ЭтаФорма);	
		ФормаРазгрузкиАвто.Открыть();	
		
	Иначе 
		ОткрытьФорму("ОбщаяФорма.Авторизация");		
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура Декорация11Нажатие(Элемент)
	ОткрытьФормуПриемкаГрузовыхМест();
КонецПроцедуры

&НаКлиенте
Процедура ПриемкаГрузовыхМест(Команда)
	ОткрытьФормуПриемкаГрузовыхМест()
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПриемкаГрузовыхМест() Экспорт
	
	Если ЗначениеЗаполнено(ОбщегоНазначения.ПолучитьПользователяГУИД()) Тогда
		
		ОбщегоНазначения.ОчиститьПараметрыРаботы();
		ФормаРазгрузкиАвто = ПолучитьФорму("Обработка.ПриемкаГрузовыхМестИзРазгрузкиАвто.Форма.ФормаСписокМаршрутовИзРазгрузкаАвто", , ЭтаФорма);	
		ФормаРазгрузкиАвто.Открыть();	
		
	Иначе 
		ОткрытьФорму("ОбщаяФорма.Авторизация");		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Декорация12Нажатие(Элемент)
	//+Кабанов А.В. 07.04.2023 # UT10-3285
	ОткрытьФормуТоварыВПути();            
	//-Кабанов А.В. 07.04.2023 # UT10-3285
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВПути(Команда)            
	//+Кабанов А.В. 07.04.2023 # UT10-3285
	ОткрытьФормуТоварыВПути();            
	//-Кабанов А.В. 07.04.2023 # UT10-3285
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуТоварыВПути() Экспорт
	//+Кабанов А.В. 07.04.2023 # UT10-3285
	
	Если ЗначениеЗаполнено(ОбщегоНазначения.ПолучитьПользователяГУИД()) Тогда
		
		ОбщегоНазначения.ОчиститьПараметрыРаботы();
		ФормаРазгрузкиАвто = ПолучитьФорму("Обработка.ТоварыВПути.Форма.ФормаНепроведенныхПТУ", , ЭтаФорма);	
		ФормаРазгрузкиАвто.Открыть();	
		
	Иначе 
		ОткрытьФорму("ОбщаяФорма.Авторизация");		
	КонецЕсли; 
	
	//-Кабанов А.В. 07.04.2023 # UT10-3285
КонецПроцедуры

&НаКлиенте
Процедура Декорация13Нажатие(Элемент)
	ОткрытьФормуСлужебныеЗаписки();
КонецПроцедуры

&НаКлиенте
Процедура СлужебныеЗаписки(Команда)
	//+Кабанов А.В. 15.02.2024 # UT10-4254		
	ОткрытьФормуСлужебныеЗаписки();
	//+Кабанов А.В. 15.02.2024 # UT10-4254
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСлужебныеЗаписки() Экспорт
	//+Кабанов А.В. 15.02.2024 # UT10-4254		
	Если ЗначениеЗаполнено(ОбщегоНазначения.ПолучитьПользователяГУИД()) Тогда
		
		ОбщегоНазначения.ОчиститьПараметрыРаботы();
		ФормаСлужебныеЗаписки = ПолучитьФорму("Обработка.СлужебныеЗаписки.Форма.ФормаСлужебныеЗаписки", , ЭтаФорма);	
		ФормаСлужебныеЗаписки.Открыть();	
		
	Иначе 
		ОткрытьФорму("ОбщаяФорма.Авторизация");		
	КонецЕсли; 
	//+Кабанов А.В. 15.02.2024 # UT10-4254		
КонецПроцедуры

&НаКлиенте
Процедура Декорация14Нажатие(Элемент)
	ОткрытьФормуРаботаСТЕ();
КонецПроцедуры

&НаКлиенте
Процедура РаботаСТЕ(Команда)
	
	ОткрытьФормуРаботаСТЕ();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРаботаСТЕ() Экспорт
	
	Если ЗначениеЗаполнено(ОбщегоНазначения.ПолучитьПользователяГУИД()) Тогда
		
		ОбщегоНазначения.ОчиститьПараметрыРаботы();
		ФормаСлужебныеЗаписки = ПолучитьФорму("Обработка.Объединения.Форма.ФормаОбъединений", , ЭтаФорма);	
		ФормаСлужебныеЗаписки.Открыть();	
		
	Иначе 
		ОткрытьФорму("ОбщаяФорма.Авторизация");		
	КонецЕсли; 
			
КонецПроцедуры

&НаКлиенте
Процедура Декорация15Нажатие(Элемент)
	//+Кабанов А.В. 21.07.2025 # UT10-5343 
	ОткрытьФормуМаркировкаТоваров();
	//+Кабанов А.В. 21.07.2025 # UT10-5343	
КонецПроцедуры

&НаКлиенте
Процедура МаркировкаТоваров(Команда) 
	//+Кабанов А.В. 21.07.2025 # UT10-5343 
	ОткрытьФормуМаркировкаТоваров();
	//+Кабанов А.В. 21.07.2025 # UT10-5343	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуМаркировкаТоваров()
	//+Кабанов А.В. 21.07.2025 # UT10-5343
	Сообщить("Маркировка");
	Если ЗначениеЗаполнено(ОбщегоНазначения.ПолучитьПользователяГУИД()) Тогда
		
		ОбщегоНазначения.ОчиститьПараметрыРаботы();
		ФормаСлужебныеЗаписки = ПолучитьФорму("Обработка.МаркировкаТоваров.Форма.ФормаСпискаДокументов", , ЭтаФорма);	
		ФормаСлужебныеЗаписки.Открыть();	
		
	Иначе 
		ОткрытьФорму("ОбщаяФорма.Авторизация");		
	КонецЕсли; 
	//-Кабанов А.В. 21.07.2025 # UT10-5343
КонецПроцедуры














