
&НаКлиенте
Процедура РазместитьМаркировки(Команда)
	
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("ДокументГУИД", Параметры.ДокументГУИД);
	Закрыть( СписокПараметров );	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	РезультатСтруктура = ОбщегоНазначения.ПолучитьСписокМаркировокПоПТУ(Параметры.ДокументГУИД);
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		Закрыть();	
		Возврат;
	КонецЕсли; 
	
	Оповестить("ОбновлениеДанных");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Объект.ОписаниеДокумента = Параметры.НомерДокументаОоформление;
	
	Сообщение = "По данному документу система ";
	Сообщение = Сообщение + "обнаружила ранее размещенные Вами маркировки ,";
	Сообщение = Сообщение + " которые не были отражены в документе ";
	Сообщение = Сообщение + """Поступление товаров и услуг"". ";
	Сообщение = Сообщение + "Нажмите на кнопку ""Разместить маркировки"" ";

	ЭтаФорма.Объект.ТекстСообщения = Сообщение;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновлениеДанных" Тогда
		Элементы.СписокТоваровВБуфереМаркировок.Обновить();
	КонецЕсли; 
	
КонецПроцедуры
