
&НаКлиенте
Перем Компонента;
&НаКлиенте
Перем Ошибка;

&НаКлиенте
Процедура ЗагрузитьСписокЗаданийНаДоставку() 
	
	РезультатСтруктура = ОбщегоНазначения.ЗагрузитьСписокЗаданийНаДоставкуДляРазгрузкиАвто();	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "ЗагрузитьСписокЗаданийНаДоставкуДляРазгрузкиАвто");					
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Компонента = ОбщегоНазначенияКлиент.ПодключитьКомпоненту();	
	
	Если Компонента <> Неопределено И Не Компонента.Подключить() Тогда		
		ТекстОшибки = "";
		КодОшибки = Компонента.ПолучитьОшибку(ТекстОшибки);                                                   
		ПоказатьПредупреждение(,"Ошибка: "+КодОшибки+", " + ТекстОшибки);
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "Компонента");					
	КонецЕсли;
	
	ЗагрузитьСписокЗаданийНаДоставку();
	
	СписокЗаданийНаДоставку.Параметры.УстановитьЗначениеПараметра("ОтобразитьВсеЗаписи", Ложь);
	СписокЗаданийНаДоставку.Параметры.УстановитьЗначениеПараметра("ЗаданиеНаДоставкуГУИД", "#####################");	
	Элементы.СписокЗаданийНаДоставку.Обновить();
	
	УстановитьВидимостьЭлементовФормы();
	ОбщегоНазначенияКлиент.ЗаполнитьТабЗначОК(ЭтаФорма);	
	ОбновитьСлуженоеСообщениеПодвал();	
	
КонецПроцедуры
 
&НаКлиенте
Процедура ОбновитьСлуженоеСообщениеПодвал() Экспорт
	
	ЭтаФорма.Подвал.Очистить();	
	СтрокаТЗ = Подвал.Добавить();

	СтрокаТЗ.ФИОСотрудинка = ОбщегоНазначенияКлиент.ПолучитьОписаниеСотрудника();
	Элементы.Подвал.Обновить();
	
	ЭтаФорма.ПодвалСообщение.Очистить();	
	СтрокаТЗ = ПодвалСообщение.Добавить();	
	СтрокаТЗ.СообщениеДляПользователя = ОбщегоНазначения.ПолучитьИнструкциюДляДействийПользователя_РазгрузкаАвто(ЭтаФорма.ИмяФормы);
	Элементы.ПодвалСообщение.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСвайпПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "ГруппаСтраница_2" Тогда 
		
	Иначе
		
		
	КонецЕсли; 
	
КонецПроцедуры                                                       

&НаКлиенте                                                                                                                       
Процедура ПолучитьСписокЗаданийНаДоставку(Команда)
	
	ЗагрузитьСписокЗаданийНаДоставку();
	
	СписокЗаданийНаДоставку.Параметры.УстановитьЗначениеПараметра("ОтобразитьВсеЗаписи", Истина);
	СписокЗаданийНаДоставку.Параметры.УстановитьЗначениеПараметра("ЗаданиеНаДоставкуГУИД", "#####################");	
	Элементы.СписокЗаданийНаДоставку.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если Не ВводДоступен() Тогда
		Возврат;
	КонецЕсли; 
	
	Если Событие = "UniversalBroadcastEvent" Тогда
		
		Результат = ОбщегоНазначения.ПолучитьЗначениеШтрихкода(Данные);
		Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
			ПоказатьПредупреждение(, "Ошибка сканирования штрихкода", 4);                            
			Возврат;
		КонецЕсли; 
		
		ЭтаФорма.Штрихкод = Результат.Штрихкод;				
		
		Если ОбщегоНазначения.ПолучитьСтатусРаботыСЗаданиемНаДоставкуИзРазгрузкаАвто() = "ПоискЗаданияНаДоставку" Тогда
			ЭтаФорма.ЗаданиеНаДоставкуГУИД = ОбщегоНазначения.ПолучитьЗаданиеНаДоставку(ЭтаФорма.Штрихкод);
					
			Если Не ЗначениеЗаполнено(ЭтаФорма.ЗаданиеНаДоставкуГУИД) Тогда
				
				ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();
				СтрокаСообщения = "Задание на доставку с данным штрихкодом не обнаружено.";
				
				ПоказатьПредупреждение(, СтрокаСообщения, 4);
				Возврат;
				                              
			КонецЕсли; 
			
			СписокЗаданийНаДоставку.Параметры.УстановитьЗначениеПараметра("ОтобразитьВсеЗаписи", Ложь);
			СписокЗаданийНаДоставку.Параметры.УстановитьЗначениеПараметра("ЗаданиеНаДоставкуГУИД", ЭтаФорма.ЗаданиеНаДоставкуГУИД);
			Элементы.СписокЗаданийНаДоставку.Обновить();
			
		КонецЕсли; 
		
		Если ОбщегоНазначения.ПолучитьСтатусРаботыСЗаданиемНаДоставкуИзРазгрузкаАвто() = "ШККладовщика" Тогда						
			ОбработатьОтсканированныйШтрихкодКладовщика(ЭтаФорма.Штрихкод);						
		КонецЕсли;
		
		ЭтаФорма.Штрихкод = "";
		
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ОткрытьФормуСписокГрузовыхМест() 
			
	П = Новый Структура;                                                  
	П.Вставить("РазгрузкаАвтоГУИД", ЭтаФорма.РазгрузкаАвтоГУИД); 
	П.Вставить("ЗаданиеНаДоставкуГУИД", ЭтаФорма.ЗаданиеНаДоставкуГУИД); 
	
	Если Компонента <> Неопределено Тогда
		Компонента.Отключить();
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ОбновитьДанныеПриЗакытииФормыФормаГрузовогоМеста", ЭтотОбъект );			
	ОткрытьФорму("Обработка.РазгрузкаАвто.Форма.ФормаГрузовогоМеста", П, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	ОбщегоНазначения.УстановитьРежимРаботыСЗаданиемНаДоставкуИзРазгрузкаАвто("ПоискЗаданияНаДоставку");	
	УстановитьВидимостьЭлементовФормы();
	ОбновитьСлуженоеСообщениеПодвал();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПриЗакытииФормыФормаГрузовогоМеста(Результат, ДополнительныеПараметры) Экспорт
	
	Если Компонента <> Неопределено Тогда
		Компонента.Подключить();
	КонецЕсли;

	ОбщегоНазначения.УстановитьРежимРаботыСЗаданиемНаДоставкуИзРазгрузкаАвто("ПоискЗаданияНаДоставку");
	
	СписокЗаданийНаДоставку.Параметры.УстановитьЗначениеПараметра("ОтобразитьВсеЗаписи", Ложь);
	СписокЗаданийНаДоставку.Параметры.УстановитьЗначениеПараметра("ЗаданиеНаДоставкуГУИД", ЭтаФорма.ЗаданиеНаДоставкуГУИД);	
	Элементы.СписокЗаданийНаДоставку.Обновить();
	
КонецПроцедуры
 

&НаКлиенте
Процедура ВыбратьЗаданиеНаДоставку(Команда)
	
	ЭтаФорма.ЗаданиеНаДоставкуГУИД = Элементы.СписокЗаданийНаДоставку.ТекущиеДанные.Объект;
	ЭтаФорма.РазгрузкаАвтоГУИД = Элементы.СписокЗаданийНаДоставку.ТекущиеДанные.РазгрузкаАвтоГУИД;
	ОткрытьФормуСписокГрузовыхМест();
	
	СписокЗаданийНаДоставку.Параметры.УстановитьЗначениеПараметра("ОтобразитьВсеЗаписи", Ложь);
	СписокЗаданийНаДоставку.Параметры.УстановитьЗначениеПараметра("ЗаданиеНаДоставкуГУИД", ЭтаФорма.ЗаданиеНаДоставкуГУИД);	
	Элементы.СписокЗаданийНаДоставку.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Компонента <> Неопределено Тогда
		Компонента.Отключить();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокЗаданийНаДоставкуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ЭтаФорма.ЗаданиеНаДоставкуГУИД = Элементы.СписокЗаданийНаДоставку.ТекущиеДанные.Объект;	
	ЭтаФорма.РазгрузкаАвтоГУИД = Элементы.СписокЗаданийНаДоставку.ТекущиеДанные.РазгрузкаАвтоГУИД;
	ОткрытьФормуСписокГрузовыхМест();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначения.УстановитьРежимРаботыСЗаданиемНаДоставкуИзРазгрузкаАвто("ПоискЗаданияНаДоставку");
КонецПроцедуры

&НаКлиенте
Процедура РежимКладовщика(Команда)
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.ЗаданиеНаДоставкуГУИД) Тогда
		ПоказатьПредупреждение(,"Отсканируйте или выберите задание на доставку", 3);						
		Возврат;
	КонецЕсли; 
		
	ОбщегоНазначения.УстановитьРежимРаботыСЗаданиемНаДоставкуИзРазгрузкаАвто("ШККладовщика");
	УстановитьВидимостьЭлементовФормы();
	ОбновитьСлуженоеСообщениеПодвал();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимПоискаЗаданияНаДоставку(Команда)
	
	ОбщегоНазначения.УстановитьРежимРаботыСЗаданиемНаДоставкуИзРазгрузкаАвто("ПоискЗаданияНаДоставку");
	УстановитьВидимостьЭлементовФормы();
	ОбновитьСлуженоеСообщениеПодвал();

КонецПроцедуры

&НаКлиенте
Процедура ПоискШКкладовщика(Команда)
	
	ОбработатьОтсканированныйШтрихкодКладовщика(ЭтаФорма.ШКкладовщика);
	ЭтаФорма.ШКкладовщика = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтсканированныйШтрихкодКладовщика(КодКладовщика)
	
	ДлинаКода = СтрДлина(СокрЛП(КодКладовщика));
	Если ДлинаКода < 2 Тогда
		ПоказатьПредупреждение(,"Код кладовщика должен быть больше > 2 символов", 3);					
	КонецЕсли; 
	
	РезультатСтруктура = ОбщегоНазначения.ПолучитьИнформациюОПользователе(СокрЛП(КодКладовщика));	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьИнформациюОПользователе");					
		ОбновитьФормуДляНачалаРаботы();
		Возврат;
		
	КонецЕсли; 
	
	Результат = ОбщегоНазначения.ЭтоШтрихкодКладовщика(СокрЛП(КодКладовщика));
	ЗаписьЗаданиеНаДоставку = ОбщегоНазначения.ПолучитьИтогиПоЗаданиюНаДоставкуПоРазгрузкамАвто(ЭтаФорма.ЗаданиеНаДоставкуГУИД);
	
	Если Результат Тогда
		
		//ЗаписьФизЛицо = ОбщегоНазначения.ПолучитьЗаписьИзРегистраСведений("ФизическоеЛицо", "Код", Формат(Число(КодКладовщика), "ЧЦ=9; ЧВН=; ЧГ=0"));		
		ЗаписьФизЛицо = ОбщегоНазначения.ПолучитьФизЛицоКладовщика(Формат(Число(КодКладовщика), "ЧЦ=5; ЧВН=; ЧГ=0"));		
		Если ЗаписьЗаданиеНаДоставку[0].КоличествоНеРазгружено > 0 Тогда
			
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("ЗаписьФизЛицо", ЗаписьФизЛицо);
			
			Оповещение = Новый ОписаниеОповещения("ОбработатьОтветНаВопрос", ЭтотОбъект, ДопПараметры);	
			ТекстВопроса = "Остались неотсканированные грузовые места. Уверены, что хотите завершить разгрузку?";
			ПоказатьВопрос(Оповещение, ТекстВопроса,РежимДиалогаВопрос.ДаНет,0,КодВозвратаДиалога.Да, "Грузовые места",);
			
		Иначе			
			ЗавершитьВыгрузкуГрузовыхМестИзРегистраСведений(ЭтаФорма.ЗаданиеНаДоставкуГУИД, ЗаписьФизЛицо[0].ФизическоеЛицоГУИД);		
		КонецЕсли; 
		
	Иначе 		
		ПоказатьПредупреждение(,"По отсканированному штрихкоду не найден кладовщик.", 3);					
	КонецЕсли; 
	
	ОбщегоНазначения.УстановитьРежимРаботыСЗаданиемНаДоставкуИзРазгрузкаАвто("ПоискЗаданияНаДоставку");
	УстановитьВидимостьЭлементовФормы();                                                                                         
	ОбновитьСлуженоеСообщениеПодвал();		
		
КонецПроцедуры                                                                       

&НаКлиенте
Процедура ОбработатьОтветНаВопрос(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда		
		ЗаписьФизЛицо = ДополнительныеПараметры.ЗаписьФизЛицо;
		ЗавершитьВыгрузкуГрузовыхМестИзРегистраСведений(ЭтаФорма.ЗаданиеНаДоставкуГУИД, ЗаписьФизЛицо[0].ФизическоеЛицоГУИД);							
	КонецЕсли; 

	ОбщегоНазначения.УстановитьРежимРаботыСЗаданиемНаДоставкуИзРазгрузкаАвто("ПоискЗаданияНаДоставку");
	УстановитьВидимостьЭлементовФормы();
	ОбновитьСлуженоеСообщениеПодвал();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыгрузкуГрузовыхМестИзРегистраСведений(ЗаданиеНаДоставкуГУИД, ФизическоеЛицо)
	
	РезультатСтруктура = ОбщегоНазначения.ЗавершитьРазгрузкуГрузовыхМестИзРазгрузкаАвто(ЗаданиеНаДоставкуГУИД, ФизическоеЛицо);	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "ЗавершитьРазгрузкуГрузовыхМестИзРазгрузкаАвто");					
		ОбновитьФормуДляНачалаРаботы();
		Возврат;
	КонецЕсли; 
	
	ПоказатьПредупреждение(,"Данные выгружены в 1С", 3);							
	ОбновитьФормуДляНачалаРаботы();
	
КонецПроцедуры
 

&НаКлиенте
Процедура ОбновитьФормуДляНачалаРаботы()
	
	ЗагрузитьСписокЗаданийНаДоставку();	
	ОбщегоНазначения.УстановитьРежимРаботыСЗаданиемНаДоставкуИзРазгрузкаАвто("ПоискЗаданияНаДоставку");
	
	ЗагрузитьСписокЗаданийНаДоставку();		
	СписокЗаданийНаДоставку.Параметры.УстановитьЗначениеПараметра("ОтобразитьВсеЗаписи", Ложь);
	СписокЗаданийНаДоставку.Параметры.УстановитьЗначениеПараметра("ЗаданиеНаДоставкуГУИД", "#####################");	
	Элементы.СписокЗаданийНаДоставку.Обновить();		
	ЭтаФорма.ЗаданиеНаДоставкуГУИД = "";
	
КонецПроцедуры
 

&НаКлиенте                                                
Процедура УстановитьВидимостьЭлементовФормы()
	
	Статус = ОбщегоНазначения.ПолучитьСтатусРаботыСЗаданиемНаДоставкуИзРазгрузкаАвто();
	Если Статус = "ПоискЗаданияНаДоставку" Тогда
		
		Элементы.ГруппаШКкладовщика.Видимость = Ложь;
		
	ИначеЕсли  Статус = "ШККладовщика" Тогда 		                   
		
		Элементы.ГруппаШКкладовщика.Видимость = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры
 



