
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ОткрытьФорму("Обработка.ОстаткиПоЯчейкам.Форма.ОтсканироватьШтрихкод");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.ОписаниеТовара = ОбщегоНазначения.ПолучитьОписаниеНайденогоТовара(Параметры.ТоварГУИД);	

	РезультатСтруктура = ОбщегоНазначения.ПолучитьОстаткиТовара(Параметры.Штрихкод, Параметры.ТоварГУИД);	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		Возврат;
	КонецЕсли; 
	
	Для Индекс = 0 По РезультатСтруктура.Данные.Количество()- 1 Цикл
		
		Строка = РезультатСтруктура.Данные[Индекс];
		СтрокаТЗ = ЭтаФорма.ТЗСписокЯчеек.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЗ, Строка);
	КонецЦикла; 
	
КонецПроцедуры
 