&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Параметры.ГрузJSON) Тогда
		Возврат;
	КонецЕсли;
	
	МассивГруза = ОбщегоНазначения.МассивИзJSON(Параметры.ГрузJSON);
	
	Если ТипЗнч(МассивГруза) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаГруза Из МассивГруза Цикл
		
		НоваяСтрока = Груз.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаГруза);
		
	КонецЦикла;
	
	Заголовок = "Груз (" + Формат(Груз.Количество(), "ЧГ=0") + ")";
	
КонецПроцедуры
