&НаКлиенте
Перем Компонента;
&НаКлиенте
Перем Ошибка;


&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ПодключитьВнешенюКомпоненту();
	ЗагрузитьДанныеИЗаполнитьФорму();		  
	ОбновитьСлуженоеСообщениеПодвал();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИЗаполнитьФорму()
	
	СписокГрузовыхМест.Очистить();
	СписокГрузовыхМестБуфер.Очистить();   
	
	РезультатСтруктура = ОбщегоНазначения.ЗагрузитьСписокОбъединений(, Ложь, Параметры.ГУИДОбъединения);
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "ЗагрузитьСписокОбъединений");			
		Возврат;
		
	КонецЕсли;  
	
	Если РезультатСтруктура.Результат И РезультатСтруктура.Данные.Шапка.Количество() > 0 Тогда
		
		Шапка = РезультатСтруктура.Данные.Шапка[0];  
		ГМБуфер= РезультатСтруктура.Данные.ГМБуфер;
		ГМ = РезультатСтруктура.Данные.ГМ;  
		
		
		ДатаДокумента = ПреобразоватьДату(Шапка.ДатаДокумента);
		
		ОбъединениеГУИД = Шапка.СсылкаОбъединение;
		ШтрихкодОбъединения = Шапка.Штрихкод;
		Статус = Шапка.Статус;  
		НомерДокументаОформление = Шапка.НомерДокумента + " от " + Формат(ДатаДокумента, "ДФ=dd.MM.yyyy") + "г."; ;  
		Контрагент = Шапка.Контрагент;  
		КоличествоГрузовыхМест = Шапка.КоличествоГрузомест;  
		КоличествоГрузовыхМестНеОбъединено = Шапка.НеОбъединено;  
		
		ЕстьБуфер = ГМБуфер.Количество() > 0;
				
		Если ТЕФормируется ИЛИ ЕстьБуфер Тогда
			
			Элементы.НомерИДатаТЕ.Заголовок = "<номер> от " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
			Элементы.НомерИДатаТЕ.Видимость = Истина;
		Иначе
			Элементы.НомерИДатаТЕ.Видимость = Ложь;
		КонецЕсли;
		
		ЕстьТранзит = Ложь;
		
		Если ЕстьБуфер Тогда
					
			Для каждого ГМСтруктура Из ГМБуфер Цикл
				
				НСтр = СписокГрузовыхМестБуфер.Добавить(); 
				ЗаполнитьЗначенияСвойств(НСтр, ГМСтруктура);
				
				НСтр.ГМ = "ГМ" + ГМСтруктура.ГМ;
				НСтр.Транзит = ?(ЗначениеЗаполнено(ГМСтруктура.Назначение), "транзит", "");  
				
				Если ЗначениеЗаполнено(НСтр.Транзит) Тогда
					ЕстьТранзит = Истина;	
				КонецЕсли;   
								
			КонецЦикла;		
			
			ТЕФормируется = Истина;
			
		КонецЕсли;     
				
		Элементы.ДекорацияТранизит.Видимость = ЕстьТранзит; 
		
		Для каждого ГМСтруктура Из ГМ Цикл
			
			НСтр = СписокГрузовыхМест.Добавить(); 
			ЗаполнитьЗначенияСвойств(НСтр, ГМСтруктура);
			
			НСтр.ГМ = "ГМ" + ГМСтруктура.ГМ;
			НСтр.Транзит = ?(ЗначениеЗаполнено(ГМСтруктура.Назначение), "транзит", ""); 
			
			Если ЗначениеЗаполнено(НСтр.Транзит) Тогда
				ЕстьТранзит = Истина;	
			КонецЕсли;   
			
		КонецЦикла;	
			
	КонецЕсли;   
	
	Оповестить("ОбновлениеДанных");
	
КонецПроцедуры 

&НаСервере
Функция ПреобразоватьДату(СтроковаяДата) 
	
	СтроковаяДата = СтрЗаменить(СтроковаяДата , "-",""); 
	СтроковаяДата = СтрЗаменить(СтроковаяДата , ":","");
	СтроковаяДата = СтрЗаменить(СтроковаяДата , "T","");
	Возврат Дата(СтроковаяДата);
	
КонецФункции

&НаКлиенте
Процедура ПодключитьВнешенюКомпоненту()
	
	Компонента = ОбщегоНазначенияКлиент.ПодключитьКомпоненту();
	Если Компонента <> Неопределено И Не Компонента.Подключить() Тогда
		
		ТекстОшибки = "";
		КодОшибки = Компонента.ПолучитьОшибку(ТекстОшибки);
		ПоказатьПредупреждение(,"Ошибка: "+КодОшибки+", " + ТекстОшибки);
		ASK_ОбработкаОшибок.Ошибка("#Ошибка обработки данных", "Ошибка получения данных." + ОписаниеОшибки(), "Компонента");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Компонента <> Неопределено Тогда
		Компонента.Отключить();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСлуженоеСообщениеПодвал(Режим = "") Экспорт
	
	ЭтаФорма.Подвал.Очистить();	
	
	СтрокаТЗ = Подвал.Добавить(); 
	СтрокаТЗ.ФИОСотрудинка = ОбщегоНазначенияКлиент.ПолучитьОписаниеСотрудника(); 
	
	Элементы.Подвал.Обновить();
	
	ЭтаФорма.ПодвалСообщение.Очистить();
	
	НСтр = ПодвалСообщение.Добавить();
	НСтр.СообщениеДляПользователя = "Отсканируйте ШК ГМ, либо введите вручную смахнув влево";
	НСтр.Действие = "ТЕШК";
	
	НСтр = ПодвалСообщение.Добавить();
	НСтр.СообщениеДляПользователя = "Смахните влево для открытия/закрытия ТЕ либо отсканируйте универсальный ШК";
	НСтр.Действие = "ТЕЗакрытиеОткрытие";
	
	Элементы.ПодвалСообщение.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновлениеДанных" Тогда 
		Элементы.СписокГрузовыхМест.Обновить();  
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	                                                                                                   
	Если Событие = "UniversalBroadcastEvent" ИЛИ Источник = "Вручную" Тогда
		
		Вручную = Ложь;
		
		Если Не Источник = "Вручную" Тогда 		
			
			Если Не ВводДоступен() Тогда
				Возврат;
			КонецЕсли; 		
			
		КонецЕсли;  
	
		Если Источник = "Вручную" Тогда
			
			Штрихкод = Данные;
			Вручную = Истина;
			
		Иначе
			
			Результат = ОбщегоНазначения.ПолучитьЗначениеШтрихкода(Данные);      
			
			Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
				
				ПоказатьПредупреждение(, "Ошибка сканирования штрихкода");
				Возврат;			
				
			КонецЕсли;  
			
			Штрихкод = Результат.Штрихкод;
			
		КонецЕсли;				
				
		ЭтоТЕ = Ложь;
		ЭтоГМ = Ложь; 

		Если Штрихкод = "1234567890128" Тогда			
			ЭтоТЕ = Истина;		
		Иначе
			
			ГМ = ПолучитьГМ(Штрихкод);
			
			Если Не ЗначениеЗаполнено(ГМ) Тогда
				
				ПоказатьПредупреждение(, "Не найдено ГМ по такому штрихкоду");
				Возврат;     
				
			Иначе
				ЭтоГМ = Истина;				
			КонецЕсли;   
			
		КонецЕсли;    
		
		Если ЭтоГМ Тогда
			
			Если НЕ ТЕФормируется Тогда
				
				ПоказатьПредупреждение(, "Необходимо просканировать универсальный штрихкод для открытия ТЕ", 10);
				Возврат;

			КонецЕсли;
			
			СтрокиПоиска = СписокГрузовыхМест.НайтиСтроки(Новый Структура("ГУИД", ГМ.ГУИД));   
			
			Если СтрокиПоиска.Количество() = 0 Тогда 
				
				ПоказатьПредупреждение(, "Некорректный ШК / Отсканированный ШК не может быть добавлен в данную ТЕ");
				Возврат;
				
			КонецЕсли;         
			
			СтрокиПоиска = СписокГрузовыхМестБуфер.НайтиСтроки(Новый Структура("ГУИД", ГМ.ГУИД));
			
			Если СтрокиПоиска.Количество() > 0 Тогда
				
				ПоказатьПредупреждение(, "Данный ШК уже был отсканирован", 10);
				Возврат;
				
			КонецЕсли;  
			
			СтрокиПоиска = СписокГрузовыхМест.НайтиСтроки(Новый Структура("ГУИД", ГМ.ГУИД));
			
			Если СтрокиПоиска.Количество() > 0 И ЗначениеЗаполнено(СтрокиПоиска[0].Статус) Тогда
				
				ПоказатьПредупреждение(, "Данный ШК уже был отсканирован", 10);
				Возврат;
				
			КонецЕсли; 
			
			УТекущегоГМНазначение = ЗначениеЗаполнено(ГМ.Назначение);
			
			ВТЕГМСНазначением = Ложь;  
				
			Для каждого Стр Из СписокГрузовыхМестБуфер Цикл
				
				Если ЗначениеЗаполнено(Стр.Назначение) Тогда
					
					ВТЕГМСНазначением = Истина;
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
			//+Сёмин Р.И. 08.04.2026 #UT10-5772
			УТекущегоГММаркировка = ГМ.ТребуетсяМаркировка;
			
			ВТЕГМСМаркировкой = Ложь;
			
			Для каждого Стр Из СписокГрузовыхМестБуфер Цикл
				
				Если Стр.ТребуетсяМаркировка Тогда
					
					ВТЕГМСМаркировкой = Истина;
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
			ВТЕГМБезУсловий = НЕ ВТЕГМСНазначением И НЕ ВТЕГМСМаркировкой;
			ТекущееГМБезУсловий = НЕ УТекущегоГМНазначение И НЕ УТекущегоГММаркировка;
			//-Сёмин Р.И. 08.04.2026 #UT10-5772
						
			Если СписокГрузовыхМестБуфер.Количество() > 0 Тогда
				
				//+Сёмин Р.И. 08.04.2026 #UT10-5772
				//Если УТекущегоГМНазначение И ВТЕГМСНазначением = Ложь Тогда
				//	
				//	ПоказатьПредупреждение(, "В ТЕ уже есть ГМ без назначений. Объединение невозможно");
				//	Возврат;
				//	
				//ИначеЕсли Не УТекущегоГМНазначение И ВТЕГМСНазначением = Истина Тогда
				//	
				//	ПоказатьПредупреждение(, "В ТЕ уже есть ГМ с назначениями. Объединение невозможно");
				//	Возврат;
				//	
				//КонецЕсли;
				
				СтруктураПоВидуТЕ = Новый Структура("ЕстьНазначение,ЕстьМаркировка,БезУсловий", ВТЕГМСНазначением, ВТЕГМСМаркировкой, ВТЕГМБезУсловий);
				СтруктураПоВидуГМ = Новый Структура("ЕстьНазначение,ЕстьМаркировка,БезУсловий", УТекущегоГМНазначение, УТекущегоГММаркировка, ТекущееГМБезУсловий);
				
				ПроверкаОбъединения = ПроверитьВозможностьОбъединенияПоСтруктурам(СтруктураПоВидуТЕ, СтруктураПоВидуГМ);
				
				Если НЕ ПроверкаОбъединения.ОбъединениеВозможно Тогда
					
					ПоказатьПредупреждение(, ПроверкаОбъединения.Сообщение);
					Возврат;
				
				КонецЕсли;
				//-Сёмин Р.И. 08.04.2026 #UT10-5772
				
			КонецЕсли;
			
			ДобавитьВБуферГМ(ГМ, Вручную);
						
		ИначеЕсли ЭтоТЕ Тогда
			ОткрытьЗакрытьТЕ(); 			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВБуферГМ(ГМ, Вручную)
	
	РезультатСтруктура = ОбщегоНазначения.ДобавитьТоварВБуферАРМКладовщикаОбъединения(ОбъединениеГУИД, ОбщегоНазначения.ПолучитьПользователяГУИД(),ТекущаяДата(), ГМ.ШК, ГМ.ГУИД, Вручную); 

	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда

		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
		ПоказатьПредупреждение(, "Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		Возврат;
		
	ИначеЕсли РезультатСтруктура.Данные = Ложь Тогда 
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();			
		ПоказатьПредупреждение(, "Ошибка добавления отсканированного товара", 4);	
		Возврат;
		
	КонецЕсли; 	
	
	ЗагрузитьДанныеИЗаполнитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗакрытьТЕ() 
	
	СтруктураОтвета = ОбщегоНазначения.ОткрытьЗакрытьТЕ(ОбъединениеГУИД);
	
	Если Не СтруктураОтвета.Результат ИЛИ ЗначениеЗаполнено(СтруктураОтвета.Сообщение) Тогда
		ПоказатьПредупреждение(, СтруктураОтвета.Сообщение);		
	КонецЕсли;       
	
	Если СтруктураОтвета.Результат Тогда 
		
		ТЕФормируется = Не ТЕФормируется;
		
		Если НЕ ТЕФормируется И СписокГрузовыхМестБуфер.Количество() = 0 Тогда
			ПоказатьПредупреждение(, "Набор в документ ТЕ отменен, так как в него не положены ГМ", 10);	         
		КонецЕсли;
		
	КонецЕсли;  
			
	ЗагрузитьДанныеИЗаполнитьФорму();
	
	Если СписокГрузовыхМест.НайтиСтроки(Новый Структура("Статус", "")).Количество() = 0 Тогда
		ОбработатьЗакрытие();	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытие()
	
   ПоказатьПредупреждение(, "Объединение " + НомерДокументаОформление + " успешно завершено", 10);  
   Оповестить("ОбновитьСписокОбъединений");
   Закрыть();  
 	
КонецПроцедуры	

Функция ПолучитьГМ(Штрихкод)

	СтрокиГМ = СписокГрузовыхМест.НайтиСтроки(Новый Структура("ШК", Штрихкод));
	
	Если СтрокиГМ.Количество() > 0 Тогда
		//+Сёмин Р.И. 08.04.2026 #UT10-5772
		//Возврат Новый Структура("ГУИД, ШК, Назначение", СтрокиГМ[0].ГУИД, СтрокиГМ[0].ШК, СтрокиГМ[0].Назначение);
		Возврат Новый Структура("ГУИД, ШК, Назначение, ТребуетсяМаркировка", СтрокиГМ[0].ГУИД, СтрокиГМ[0].ШК, СтрокиГМ[0].Назначение, СтрокиГМ[0].ТребуетсяМаркировка);
		//-Сёмин Р.И. 08.04.2026 #UT10-5772
	КонецЕсли;   
	
	Возврат Неопределено;
		
КонецФункции

&НаКлиенте
Процедура ВыбратьДействие(Команда)
	
	ТекущиеДанные = Элементы.ПодвалСообщение.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	Действие = ТекущиеДанные.Действие;
	
	Если Действие = "ТЕШК" Тогда
		
		ШКРучной = "";
		
		Если ВвестиСтроку(ШКРучной, "Введите ШК") Тогда
			
			Если СтрДлина(ШКРучной) < 6 Тогда
				
				ПоказатьПредупреждение(, "Длина должна быть не менее 6 символов", 4); 
				ШКРучной = ""
				
			Иначе 
				
				Если СтрДлина(ШКРучной) < 25 Тогда
					
					ШКРучной = ПолучитьШКПоЧастиНомера(ШКРучной);
					
					Если Не ЗначениеЗаполнено(ШКРучной) Тогда
						ПоказатьПредупреждение(, "Не найдено грузоместо по такому номеру", 4); 		
					КонецЕсли;
					
				КонецЕсли;			
								
			КонецЕсли;  
				
			Если ЗначениеЗаполнено(ШКРучной) Тогда
				ВнешнееСобытие("Вручную", "", ШКРучной);					
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли Действие = "ТЕЗакрытиеОткрытие" Тогда 
		ВнешнееСобытие("Вручную", "", "1234567890128");	
	КонецЕсли;
	
КонецПроцедуры 

Функция ПолучитьШКПоЧастиНомера(ШК)

	Для каждого Стр Из СписокГрузовыхМест Цикл
		
		Если СтрНайти(Стр.ШК, ШК) > 0 Тогда
			Возврат Стр.ШК;	
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат "";
	
КонецФункции 

&НаКлиенте
Процедура ПодвалСообщениеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Функция ПроверитьВозможностьОбъединенияПоСтруктурам(СтруктураПоВидуТЕ, СтруктураПоВидуГМ)
	
	//+Сёмин Р.И. 08.04.2026 #UT10-5772
	ДанныеПоВидуТЕ = СоздатьТаблицуДляПроверки();
	ДанныеПоВидуГМ = СоздатьТаблицуДляПроверки();
	
	ДобавитьСтрокуВТаблицуПоВидуДокумента(ДанныеПоВидуТЕ, "ЕстьНазначение", СтруктураПоВидуТЕ.ЕстьНазначение, "В данной ТЕ уже есть ГМ с назначением. ");
	ДобавитьСтрокуВТаблицуПоВидуДокумента(ДанныеПоВидуТЕ, "ЕстьМаркировка", СтруктураПоВидуТЕ.ЕстьМаркировка, "В данной ТЕ уже есть ГМ с маркировкой. ");
	ДобавитьСтрокуВТаблицуПоВидуДокумента(ДанныеПоВидуТЕ, "БезУсловий", СтруктураПоВидуТЕ.БезУсловий, "В данной ТЕ уже есть ГМ без назначений и маркировок. ");
	
	ДобавитьСтрокуВТаблицуПоВидуДокумента(ДанныеПоВидуГМ, "ЕстьНазначение", СтруктураПоВидуГМ.ЕстьНазначение, "Добавляемое ГМ имеет назначение. ");
	ДобавитьСтрокуВТаблицуПоВидуДокумента(ДанныеПоВидуГМ, "ЕстьМаркировка", СтруктураПоВидуГМ.ЕстьМаркировка, "Добавляемое ГМ имеет маркировку. ");
	ДобавитьСтрокуВТаблицуПоВидуДокумента(ДанныеПоВидуГМ, "БезУсловий", СтруктураПоВидуГМ.БезУсловий, "Добавляемое ГМ без назначения и маркировки. ");
	
	ПроверкаОбъединения = ПроверитьВозможностьОбъединения(ДанныеПоВидуТЕ, ДанныеПоВидуГМ);
	
	Возврат ПроверкаОбъединения;
	//-Сёмин Р.И. 08.04.2026 #UT10-5772
	
КонецФункции

Функция ПроверитьВозможностьОбъединения(ДанныеПоВидуТЕ, ДанныеПоВидуГМ)
	
	//+Сёмин Р.И. 08.04.2026 #UT10-5772
	СтруктураВозврата = Новый Структура("ОбъединениеВозможно,Сообщение", Истина, "");
	
	ВидТЕ = ДанныеПоВидуТЕ.Найти(Истина, "Значение");
	ВидГМ = ДанныеПоВидуГМ.Найти(Истина, "Значение");
	
	Если ВидГМ.Параметр <> ВидТЕ.Параметр Тогда
		
		СтруктураВозврата.ОбъединениеВозможно = Ложь;
		СтруктураВозврата.Сообщение = ВидТЕ.Сообщение + ВидГМ.Сообщение + "Объединение невозможно.";
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	//-Сёмин Р.И. 08.04.2026 #UT10-5772
	
КонецФункции

Функция СоздатьТаблицуДляПроверки()
	
	//+Сёмин Р.И. 08.04.2026 #UT10-5772
	ТаблицаДляПроверки = Новый ТаблицаЗначений;
	ТаблицаДляПроверки.Колонки.Добавить("Параметр");
	ТаблицаДляПроверки.Колонки.Добавить("Значение");
	ТаблицаДляПроверки.Колонки.Добавить("Сообщение");
	
	Возврат ТаблицаДляПроверки;
	//-Сёмин Р.И. 08.04.2026 #UT10-5772
	
КонецФункции

Процедура ДобавитьСтрокуВТаблицуПоВидуДокумента(ТаблицаДанных, Параметр, Значение, Сообщение)
	
	//+Сёмин Р.И. 08.04.2026 #UT10-5772
	НовСтр = ТаблицаДанных.Добавить();
	
	НовСтр.Параметр = Параметр;
	НовСтр.Значение = Значение;
	НовСтр.Сообщение = Сообщение;
	//-Сёмин Р.И. 08.04.2026 #UT10-5772
	
КонецПроцедуры
