
&НаКлиенте
Функция ОбработкаШтрихкодаВАвтоматическомРежиме(ЭтаФорма, ТипДокумента, ГМ = Ложь) Экспорт
	
	Ошибка = "";
	Объект        = ЭтаФорма.Объект;
	Штрихкод      = ЭтаФорма.Штрихкод; 
	ТоварГУИД     = ЭтаФорма.ТоварГУИД;  
	
	ДокументГУИД  = Объект.ДокументГУИД;
	ПолучитьТабЗнач = Ложь;       
	
	//+Шульман А. 17.11.2025 #UT10-5516   
	ИмяФормы = ЭтаФорма.ИмяФормы;
	СтрокаGS = "";
	РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ = Ложь;
	
	Если ИмяФормы = "Обработка.ПриемкаКоллективная.Форма.ФормаСканированияМаркировок"  Тогда
		
		РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ = Объект.РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ;    
		
		//+Шульман А. 28.11.2025 #UT10-5550    
		СверятьКодыСОжидаемымиПриПриемке = Объект.СверятьКодыСОжидаемымиПриПриемке;    
		//-Шульман А. 28.11.2025 #UT10-5550  
		
	КонецЕсли;    
	//-Шульман А. 17.11.2025 #UT10-5516     
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	// Найти товар по штрихкоду         
	Если ГМ Тогда 
		РезультатСтруктура = ОбщегоНазначения.НайтиГМПоШтрихкоду(Штрихкод, ТипДокумента, ДокументГУИД, ПолучитьТабЗнач);
	Иначе
		
		//+Шульман А. 05.12.2025 #UT10-5576     
		СтатусРаботыСРазмещениемДокумента = ОбщегоНазначения.ПолучитьСтатусРаботыСРазмещениемДокумента();
		
		ЧастиКода = ОбщегоНазначения.ПолучитьСтруктуруЧастиКода();   
		
		Если ИмяФормы = "Обработка.ПриемкаКоллективная.Форма.ФормаСканированияМаркировок"
			Или ИмяФормы = "Обработка.ПеремещениеТовараИзЯчейки.Форма.ФормаПеремещениеНоменклатуры" Тогда
			
			СтрокаGS = ЭтаФорма.СтрокаGS;
			
			//+Сёмин Р.И. 15.05.2026 #UT10-5855
			//раскоментить при ручном тестировании кодов маркировок
			//Если НЕ ЗначениеЗаполнено(СтрокаGS) Тогда
			//	
			//	СтрокаGS = ОбщегоНазначенияКлиент.ПолучитьПозицииGS_Тест(Штрихкод);
			//	Штрихкод = СтрЗаменить(Штрихкод, "<GS>", "");
			//	
			//КонецЕсли;
			//-Сёмин Р.И. 15.05.2026 #UT10-5855
			
			МассивGS = СтрРазделить(СтрокаGS, ";");
			
			Если ТипЗнч(МассивGS) = Тип("Массив") И Не ПустаяСтрока(СтрокаGS) Тогда
			
				Если МассивGS.Количество() > 0 Тогда
					ЧастиКода.Вставить("GS1", МассивGS[0]);       // Позиция первого GS
				КонецЕсли;
				
				Если МассивGS.Количество() > 1 Тогда
					ЧастиКода.Вставить("GS2", МассивGS[1]);       // Позиция второго GS
				КонецЕсли;
				
				Если МассивGS.Количество() > 2 Тогда
					ЧастиКода.Вставить("GS3", МассивGS[2]);       // Позиция третьего GS
				КонецЕсли;
				
			КонецЕсли;  
			
		КонецЕсли;
		//-Шульман А. 05.12.2025 #UT10-5576
		
		РезультатПроверкиШтрихКодаМаркировки = ОбщегоНазначения.ЭтоШтрихКодМаркировки(Штрихкод, ЧастиКода); 
		
		//+Шульман А. 05.12.2025 #UT10-5599 
		Если Не РезультатПроверкиШтрихКодаМаркировки.Результат И ИмяФормы = "Обработка.ПеремещениеТовараИзЯчейки.Форма.ФормаПеремещениеНоменклатуры" Тогда  
			
			Если Объект.ПеремещениеИзЯчейкиМаркировка Тогда
				ASK_ОбработкаОшибок.ЗаписатьИнформациюВЛогОшибок(РезультатПроверкиШтрихКодаМаркировки.ТекстОшибки, Штрихкод, 
				"ОбработкаШтрихкодаВАвтоматическомРежиме", "ЭтоШтрихКодМаркировки");   
			КонецЕсли;  
			
		КонецЕсли;
		//-Шульман А. 05.12.2025 #UT10-5599 
		
		Если РезультатПроверкиШтрихКодаМаркировки.Результат Тогда
			
			Если ИмяФормы = "Обработка.ПриемкаКоллективная.Форма.ФормаСканированияМаркировок"  Тогда
				
				Если СтатусРаботыСРазмещениемДокумента = "ВыборНомеклатурыДляМаркировки" Тогда
					
					ЭтаФорма.ОтсканированТовар = Ложь;
					ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
					ПоказатьПредупреждение(,"Ошибка: " + "Отсканируйте штрихкод товара !", 4);	
					Возврат "";	
					
				Иначе
					
					//+Шульман А. 28.11.2025 #UT10-5550  
					ЭтаФорма.ОтсканированТовар = Ложь;
					
					//+Сёмин Р.И. 24.09.2026 #UT10-6057
					МинимальнаяЕдиницаПотребления = 1;
					
					РезультатВладелецМаркировки = ОбщегоНазначения.НайтиТоварПоМаркировке(
						РезультатПроверкиШтрихКодаМаркировки.ШтрихКодКраткий,
						РезультатПроверкиШтрихКодаМаркировки.ШтрихКодПолный,
						ТипДокумента,
						ДокументГУИД,
						ТоварГУИД,
						ПолучитьТабЗнач
					);
					
					Если ЗначениеЗаполнено(РезультатВладелецМаркировки.Данные) Тогда
						
						Если РезультатВладелецМаркировки.Данные[0].ГруппаЧЗПеременныеХарактеристики Тогда
							
							Если ЗначениеЗаполнено(РезультатВладелецМаркировки.Данные[0].МинимальнаяЕдиницаПотребления) Тогда
								МинимальнаяЕдиницаПотребления = РезультатВладелецМаркировки.Данные[0].МинимальнаяЕдиницаПотребления;
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
					РезультатПроверкиШтрихКодаМаркировки.Вставить("МинимальнаяЕдиницаПотребления", МинимальнаяЕдиницаПотребления);
					//-Сёмин Р.И. 24.09.2026 #UT10-6057
					
					Если СверятьКодыСОжидаемымиПриПриемке Тогда
					//-Шульман А. 28.11.2025 #UT10-5550
					
						//+Шульман А. 17.03.2026 #UT10-5748
						//Если НЕ ОбщегоНазначения.МаркировкаЕстьВОжидаемых(РезультатПроверкиШтрихКодаМаркировки.ШтрихКодКраткий, 
						//	РезультатПроверкиШтрихКодаМаркировки.ШтрихКодПолный, ДокументГУИД) Тогда
							
						Результат = ОбщегоНазначения.МаркировкаЕстьВОжидаемых(РезультатПроверкиШтрихКодаМаркировки.ШтрихКодКраткий, 
							РезультатПроверкиШтрихКодаМаркировки.ШтрихКодПолный, ДокументГУИД);  
							
						ТекстОшибки = "";         
						
						Если Не Результат.ЕстьМаркировка Тогда
							
							//+Сёмин Р.И. 19.05.2026 #UT10-5855
							//ТекстОшибки = "Ошибка: Маркировка отсутствует в списке ожидаемых!";
							
							Если НЕ ЭтаФорма.ТоварОбъемноСортовойУчет Тогда
								ТекстОшибки = "Ошибка: Маркировка отсутствует в списке ожидаемых!";
							КонецЕсли;
							//-Сёмин Р.И. 19.05.2026 #UT10-5855
							
						ИначеЕсли Результат.Невалиден Тогда
							ТекстОшибки = "Ошибка: Маркировка невалидна. Причина: " + Результат.Причина + "!";
						КонецЕсли;
						
						//+Сёмин Р.И. 26.06.2026 #UT10-5920
						Если ПустаяСтрока(ТекстОшибки) Тогда
							
							//+Сёмин Р.И. 24.09.2026 #UT10-6057
							//РезультатВладелецМаркировки = ОбщегоНазначения.НайтиТоварПоМаркировке(
							//	РезультатПроверкиШтрихКодаМаркировки.ШтрихКодКраткий,
							//	РезультатПроверкиШтрихКодаМаркировки.ШтрихКодПолный,
							//	ТипДокумента,
							//	ДокументГУИД,
							//	ТоварГУИД,
							//	ПолучитьТабЗнач
							//);
							//-Сёмин Р.И. 24.09.2026 #UT10-6057
							
							//+Сёмин Р.И. 14.08.2026 #UT10-6005
							//КодМаркировкиПринадлежитОтсканированномуТовару = Ложь;
							
							Если ЭтаФорма.ТоварОбъемноСортовойУчет Тогда
								КодМаркировкиПринадлежитОтсканированномуТовару = Истина;
							Иначе
								КодМаркировкиПринадлежитОтсканированномуТовару = Ложь;
							КонецЕсли;
							//-Сёмин Р.И. 14.08.2026 #UT10-6005
							
							Если ЗначениеЗаполнено(РезультатВладелецМаркировки.Данные) Тогда
								
								Если ЭтаФорма.НайденныйТовар.Владелец = РезультатВладелецМаркировки.Данные[0].Владелец Тогда
									КодМаркировкиПринадлежитОтсканированномуТовару = Истина;
								КонецЕсли;
								
							КонецЕсли;
							
							Если НЕ КодМаркировкиПринадлежитОтсканированномуТовару Тогда
								ТекстОшибки = "Ошибка: Отсканированный код маркировки (QR-код) принадлежит другой номенклатуре!";
							КонецЕсли;
							
						КонецЕсли;
						//-Сёмин Р.И. 26.06.2026 #UT10-5920
						
						Если Не ПустаяСтрока(ТекстОшибки) Тогда
						//-Шульман А. 17.03.2026 #UT10-5748	
						
							ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
							
							//+Шульман А. 28.11.2025 #UT10-5550
							//ПоказатьПредупреждение(,"Ошибка: " + "Маркировка отсутствует в списке ожидаемых !", 4);	   
							СписокОтветов = Новый СписокЗначений;      
							СписокОтветов.Добавить(КодВозвратаДиалога.Да, "Продолжить");        
							
							//+Шульман А. 17.03.2026 #UT10-5748
							//ОтветНаВопрос = Вопрос("" , СписокОтветов , , КодВозвратаДиалога.Да , "Ошибка: Маркировка отсутствует в списке ожидаемых !");   
							ОтветНаВопрос = Вопрос("" , СписокОтветов, , КодВозвратаДиалога.Да, ТекстОшибки);    
							//-Шульман А. 17.03.2026 #UT10-5748
							
							//-Шульман А. 28.11.2025 #UT10-5550
							Возврат "";
							
						КонецЕсли;
						
					КонецЕсли;
						
					//+Шульман А. 13.11.2025 #UT10-5504  
					ЭтаФорма.СостояниеКМ = "";    
					СостояниеКМ = "";
					
					Если Объект.ПроверятьСостояниеКодаВЧЗ Тогда
						
						Если ОшибкаПроверкиСостоянияКода(РезультатПроверкиШтрихКодаМаркировки.ШтрихКодКраткий, Объект.РазрешитьПриниматьКМБезПроверкиСостояния, СостояниеКМ) Тогда   
								  
							ЭтаФорма.СостояниеКМ = СостояниеКМ; 
							ЭтаФорма.НайденнаяМаркировка = РезультатПроверкиШтрихКодаМаркировки;

							Если СостояниеКМ = "Разместить для возврата" Тогда   
								
								Попытка
									
									ТоварГУИД = ЭтаФорма.НайденныйТовар.Владелец;
									ОбщегоНазначения.ДобавитьРесурсСписокТоваровДокументаПТУ(ДокументГУИД, ТоварГУИД, "КоличествоРазместитьДляВозврата", 1);   
									
								Исключение
								КонецПопытки;
								
							КонецЕсли;
							
							Возврат "";
							
						КонецЕсли;   
						
						ЭтаФорма.СостояниеКМ = СостояниеКМ;
						
					Иначе
						ЭтаФорма.СостояниеКМ = "Без проверки";												
					КонецЕсли;        
					//-Шульман А. 13.11.2025 #UT10-5504
					
					
					//+Шульман А. 20.11.2025 #UT10-5518    
					Если Объект.ПроверятьСоответствиеКодаТоваруПоGTIN Тогда
					
						GTIN = РезультатПроверкиШтрихКодаМаркировки.GTIN;               
						РезультатСтруктура = ОбщегоНазначения.НайтиТоварПоGTIN(GTIN, ТипДокумента, ДокументГУИД, ЭтаФорма.НайденныйТовар.Владелец);   // ТоварГУИД
						
						Если НЕ РезультатСтруктура.Результат Тогда
							
							ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();
							
							СписокОтветов = Новый СписокЗначений;      
							СписокОтветов.Добавить(КодВозвратаДиалога.Да, "Продолжить");  
							ОтветНаВопрос = Вопрос("" , СписокОтветов , , КодВозвратаДиалога.Да , "Ошибка: " + РезультатСтруктура.Ошибка);  
							Возврат "";	
							
						КонецЕсли;
							
					КонецЕсли;
					//-Шульман А. 20.11.2025 #UT10-5518
					
					ЭтаФорма.НайденнаяМаркировка = РезультатПроверкиШтрихКодаМаркировки;
					ЭтаФорма.ОтсканированТовар = Ложь;   
					
					Результат = ОбработатьШтрихкод_ДляПоступлениеТоваровУслуг(ЭтаФорма, ТипДокумента, ГМ);
					Возврат Результат;
					
				КонецЕсли;
			
			Иначе
				
				РезультатСтруктура = ОбщегоНазначения.НайтиТоварПоМаркировке(РезультатПроверкиШтрихКодаМаркировки.ШтрихКодКраткий, 
				РезультатПроверкиШтрихКодаМаркировки.ШтрихКодПолный,  ТипДокумента, ДокументГУИД, ТоварГУИД, ПолучитьТабЗнач);
				
				// Пропустить проверку, при перемещении из "ячейки маркировки" и надо знать, что сканируется маркировка, а не штрихкод 
				//+Шульман А. 05.12.2025 #UT10-5599 отладка
				Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) И ИмяФормы = "Обработка.ПеремещениеТовараИзЯчейки.Форма.ФормаПеремещениеНоменклатуры" Тогда  
					
					Если Объект.ПеремещениеИзЯчейкиМаркировка Тогда
						ASK_ОбработкаОшибок.ЗаписатьИнформациюВЛогОшибок("Ошибка при поиске маркировки", РезультатСтруктура.Ошибка, "ОбработкаШтрихкодаВАвтоматическомРежиме", "НайтиТоварПоМаркировке");   
					КонецЕсли;  
					
				КонецЕсли;
				//-Шульман А. 05.12.2025 #UT10-5599 отладка

				Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
					
					ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
					ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
					Возврат "";
					
				КонецЕсли;
				
				Если ТипДокумента = "ПеремещениеТовараИзЯчейки" Тогда
					
					Если НЕ РезультатСтруктура.Данные[0].ВведенВОборот Тогда
						
						ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
						ПоказатьПредупреждение(,"Ошибка: " + "Маркировка не введена в оборот !", 4);	
						Возврат "";					
						
					КонецЕсли;
					
				ИначеЕсли ТипДокумента = "ПоступлениеТоваровУслуг" Тогда
					
					Если НЕ ОбщегоНазначения.МаркировкаОтсканированнаВПТУ(РезультатПроверкиШтрихКодаМаркировки.ШтрихКодКраткий , РезультатПроверкиШтрихКодаМаркировки.ШтрихКодПолный , ДокументГУИД) Тогда
						
						ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
						ПоказатьПредупреждение(,"Ошибка: " + "Маркировка не внесена в документ !", 4);	
						
						Возврат "";	
						
					КонецЕсли;				
					
				КонецЕсли;
				
			КонецЕсли;
			
		//+Шульман А. 17.11.2025 #UT10-5516
		ИначеЕсли РезультатПроверкиШтрихКодаМаркировки.ПройденаПроверкаКраткогоКода И РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ Тогда
			
			Если СтатусРаботыСРазмещениемДокумента = "ВыборНомеклатурыДляМаркировки" Тогда
				
				ЭтаФорма.ОтсканированТовар = Ложь;
				ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
				ПоказатьПредупреждение(,"Ошибка: " + "Отсканируйте штрихкод товара !", 4);	
				
			Иначе
			
				ЭтаФорма.ОтсканированТовар = Ложь; 
				ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
							
				СписокОтветов = Новый СписокЗначений;      
				СписокОтветов.Добавить(КодВозвратаДиалога.Да, "Продолжить");  
				ОтветНаВопрос = Вопрос("" , СписокОтветов , , КодВозвратаДиалога.Да , "Ошибка: Код маркировки не прошел расширенную проверку на валидность!");  
				
				ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборНомеклатурыДляМаркировки");   
			
			КонецЕсли;
			
			Возврат "";
		//-Шульман А. 17.11.2025 #UT10-5516	  
			
		Иначе
			
			//+Шульман А. 15.12.2025 #UT10-5588   
			// Перенесено ниже
			//РезультатСтруктура = ОбщегоНазначения.НайтиТоварПоШтрихкоду(Штрихкод, ТипДокумента, ДокументГУИД, ТоварГУИД, ПолучитьТабЗнач); 
			//-Шульман А. 15.12.2025 #UT10-5588
			
			Если ИмяФормы = "Обработка.ПриемкаКоллективная.Форма.ФормаСканированияМаркировок"  Тогда
				
				//+Шульман А. 15.12.2025 #UT10-5588
				Если Не СтатусРаботыСРазмещениемДокумента = "ВыборНомеклатурыДляМаркировки" Тогда     
					
					ЭтаФорма.ОтсканированТовар = Ложь;
					ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();
					
					//+Сёмин Р.И. 19.05.2026 #UT10-5855
					ЭтаФорма.ТоварОбъемноСортовойУчет = Ложь;
					//-Сёмин Р.И. 19.05.2026 #UT10-5855
					
					СписокОтветов = Новый СписокЗначений;      
					СписокОтветов.Добавить(КодВозвратаДиалога.Да, "Продолжить");  
					ОтветНаВопрос = Вопрос("" , СписокОтветов , , КодВозвратаДиалога.Да , "Ошибка: Код маркировки не прошел проверку на валидность!");  

					ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборНомеклатурыДляМаркировки");   
					Возврат "";
				//-Шульман А. 15.12.2025 #UT10-5588	
					
				Иначе
					
					//+Шульман А. 15.12.2025 #UT10-5588
					РезультатСтруктура = ОбщегоНазначения.НайтиТоварПоШтрихкоду(Штрихкод, ТипДокумента, ДокументГУИД, ТоварГУИД, ПолучитьТабЗнач); 
					//-Шульман А. 15.12.2025 #UT10-5588
					
					Если НЕ РезультатСтруктура.Данные.Количество() = 0 Тогда
						
						Если НЕ РезультатСтруктура.Данные[0].ТребуетсяМаркировка Тогда
							
							ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();
							ЭтаФорма.НайденныйТовар = Неопределено;     
							//+Шульман А. 15.12.2025 #UT10-5588
							//ПоказатьПредупреждение(,"Ошибка: " + "Товар не подлежит маркировке !", 4);	 
							
							СписокОтветов = Новый СписокЗначений;      
							СписокОтветов.Добавить(КодВозвратаДиалога.Да, "Продолжить");  
							ОтветНаВопрос = Вопрос("" , СписокОтветов , , КодВозвратаДиалога.Да , "Ошибка: Товар не подлежит маркировке!");  
							//-Шульман А. 15.12.2025 #UT10-5588
							Возврат "";	
							
						КонецЕсли;
						
					Иначе
						
						//+Шульман А. 15.12.2025 #UT10-5588	
						ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
						ПоказатьПредупреждение(,"Ошибка: " + "Отсканируйте штрихкод товара !", 4);	
						Возврат "";	
						//-Шульман А. 15.12.2025 #UT10-5588
						
					КонецЕсли;
					
					Если НЕ СтатусРаботыСРазмещениемДокумента = "ВыборНомеклатурыДляМаркировки" Тогда
						ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборНомеклатурыДляМаркировки"); 					
					КонецЕсли;
					
					//+Марков И. 07.10.2025 #UT10-5451
					Если РезультатСтруктура.Данные.Количество() = 1 Тогда
						
						ЭтаФорма.ОтсканированТовар = Истина;
						ЭтаФорма.НайденныйТовар = РезультатСтруктура.Данные[0];
						
						//+Сёмин Р.И. 19.05.2026 #UT10-5855
						ЭтаФорма.ТоварОбъемноСортовойУчет = РезультатСтруктура.Данные[0].ОбъемноСортовойУчет;
						//-Сёмин Р.И. 19.05.2026 #UT10-5855
						
					КонецЕсли;
					//-Марков И. 07.10.2025 #UT10-5451    
					
				КонецЕсли;
				
			//+Шульман А. 15.12.2025 #UT10-5588   
			Иначе
				РезультатСтруктура = ОбщегоНазначения.НайтиТоварПоШтрихкоду(Штрихкод, ТипДокумента, ДокументГУИД, ТоварГУИД, ПолучитьТабЗнач); 
			//-Шульман А. 15.12.2025 #UT10-5588
			
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;   
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		Возврат "";
		
	КонецЕсли; 
	
	Если РезультатСтруктура.Данные.Количество() = 1 Тогда
		
		Если РезультатСтруктура.Данные[0].ТипСтрокиЗапроса = "Ячейка" Тогда
			
			Если ТипДокумента = "ПоступлениеТоваровУслуг" Тогда				
				
				Результат = ОбработатьВыбраннуюЯчейкуДляРазмещенияТовара(ЭтаФорма);
				Возврат Результат;
				
			ИначеЕсли ТипДокумента = "ПеремещениеТовараИзЯчейки" Тогда 				
				
				Результат = ОбработатьВыбраннуюЯчейкуДляПеремещенияТовара(ЭтаФорма);				
				Возврат Результат;
				
			ИначеЕсли ТипДокумента = "ЗаданиеНаИнвентаризацию" Тогда 				
				
				Результат = ОбработатьВыбраннуюЯчейкуИзЗаданияНаИнвентаризацию(ЭтаФорма);				
				Возврат Результат;
				
			КонецЕсли;
			
			Возврат "";						
			
		КонецЕсли; 
		
		ЭтаФорма.НайденныйТовар = РезультатСтруктура.Данные[0];
		
		Если ТипДокумента = "ПоступлениеТоваровУслуг" Тогда
			
			Результат = ОбработатьШтрихкод_ДляПоступлениеТоваровУслуг(ЭтаФорма, ТипДокумента, ГМ);
			Возврат Результат;
			
		КонецЕсли; 
		
		Если ТипДокумента = "ПеремещениеТовараИзЯчейки" Тогда 
			
			Результат = ОбработатьШтрихкод_ДляПеремещенияТоваровУслуг(ЭтаФорма, ТипДокумента);
			Возврат Результат;
			
		КонецЕсли; 
		
		Если ТипДокумента = "ЗаданиеНаИнвентаризацию" Тогда
			
			Результат = ОбработатьШтрихкод_ДляИнвентаризируемойЯчейки(ЭтаФорма, ТипДокумента);
			Возврат Результат;
			
		КонецЕсли; 
		
		
	ИначеЕсли РезультатСтруктура.Данные.Количество() >  1 Тогда		
		
		Оповестить("СканированиеШтрихкода");	
		ДополнительныеПараметры  = Новый Структура("ЭтаФорма, ТипДокумента, НайденныеТовары", ЭтаФорма, ТипДокумента, РезультатСтруктура.Данные);
		Оповещение = Новый ОписаниеОповещения("ПолучениеДанныхПриЗакрытииФормыВыбораТовараДокумента", ЭтотОбъект, ДополнительныеПараметры);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("НайденныеТовары", РезультатСтруктура.Данные);		
		ОткрытьФорму("Обработка.ОбщиеФормы.Форма.ФормаВыбораТовараДокумента", ПараметрыФормы, ЭтаФорма, ,, , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);		
		
	Иначе                 
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
		Возврат "НеизвестныйШтрихкод";                          
		
	КонецЕсли;                                                                        
	
КонецФункции                                          


&НаКлиенте		  
Процедура ПолучениеДанныхПриЗакрытииФормыВыбораТовараДокумента(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ЭтаФорма = ДополнительныеПараметры.ЭтаФорма;
		Если Результат.ТипСтрокиЗапроса = "Ячейка" Тогда
						
			Если ДополнительныеПараметры.ТипДокумента = "ПоступлениеТоваровУслуг" Тогда
				
				ОбработатьВыбраннуюЯчейкуДляРазмещенияТовара(ЭтаФорма);				
				
			ИначеЕсли ДополнительныеПараметры.ТипДокумента = "ПеремещениеТовараИзЯчейки" Тогда 
				
				ОбработатьВыбраннуюЯчейкуДляПеремещенияТовара(ЭтаФорма);
				
			ИначеЕсли ДополнительныеПараметры.ТипДокумента = "ЗаданиеНаИнвентаризацию" Тогда

				 ОбработатьВыбраннуюЯчейкуИзЗаданияНаИнвентаризацию(ЭтаФорма);
				 ДополнительныеПараметры.ЭтаФорма.Закрыть();
				 
			КонецЕсли; 
			
			Возврат;
			
		КонецЕсли; 

		ДополнительныеПараметры.ЭтаФорма.ТоварГУИД = Результат.ТоварГУИД;		
		
		Для Счетчик = 0 По ДополнительныеПараметры.НайденныеТовары.Количество() - 1 Цикл
			
			Строка = ДополнительныеПараметры.НайденныеТовары [Счетчик];
			
			Если Строка.Владелец = Результат.ТоварГУИД И Строка.ШтрихкодЕдИзмКоэффициент = Результат.Коэффициент Тогда
				ДополнительныеПараметры.ЭтаФорма.НайденныйТовар = Строка;			
				Прервать;
			КонецЕсли; 			
			
		КонецЦикла;                                    
		
		Если ДополнительныеПараметры.ТипДокумента = "ПоступлениеТоваровУслуг" Тогда
			
			ОбработатьШтрихкод_ДляПоступлениеТоваровУслуг(ДополнительныеПараметры.ЭтаФорма, ДополнительныеПараметры.ТипДокумента);			
			
			//+Марков И. 07.10.2025 #UT10-5451
			Если ДополнительныеПараметры.Свойство("ЭтаФорма") И ДополнительныеПараметры.ЭтаФорма.ИмяФормы = "Обработка.ПриемкаКоллективная.Форма.ФормаСканированияМаркировок" Тогда
				ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборМаркировки");	
			КонецЕсли;	
			//-Марков И. 07.10.2025 #UT10-5451
			
		КонецЕсли; 
	
		Если ДополнительныеПараметры.ТипДокумента = "ПеремещениеТовараИзЯчейки" Тогда
			ОбработатьШтрихкод_ДляПеремещенияТоваровУслуг(ДополнительныеПараметры.ЭтаФорма, ДополнительныеПараметры.ТипДокумента);			
		КонецЕсли; 
		
		Если ДополнительныеПараметры.ТипДокумента = "ЗаданиеНаИнвентаризацию" Тогда
			ОбработатьШтрихкод_ДляИнвентаризируемойЯчейки(ДополнительныеПараметры.ЭтаФорма, ДополнительныеПараметры.ТипДокумента);			
		КонецЕсли; 
		
	Иначе
		
		РежимВводаАвтоматический = ОбщегоНазначения.УстановленРежимВводаАвтоматический();
		Если  Не РежимВводаАвтоматический  Тогда
			ОбщегоНазначения.УстановитьРежимВводаНаСервере();	
		КонецЕсли; 			
		
		ОбщегоНазначения.УстановитьРежимВыбораДляДокументаИнвентаризации("ВыборНоменклатуры");
		ДополнительныеПараметры.ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();
		
	КонецЕсли; 	
	
КонецПроцедуры                                                                                 

&НаКлиенте
Функция ОбработатьВыбраннуюЯчейкуДляРазмещенияТовара(ЭтаФорма)
	
	Проверка = ОбщегоНазначенияКлиент.СканированныйШтрихкодЯвляетсяЯчейкой(ЭтаФорма.Штрихкод, ЭтаФорма.Объект.ЯчейкаПриемки);		
	Если Проверка Тогда        
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлЯчейки();
		ЭтаФорма.ОбработатьЯчейкуДляЗакрытияПриемкиТовара();		
		ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборЯчейки");
		Результат =  "ЗакрытиеЯчейкиПриемки";									
		
	Иначе                                               		
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();		
		ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборНоменклатуры");
		Результат = "ЯчейкаНеСоотвестЯчейкиПриемки";
		
	КонецЕсли; 
	
	ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();					
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОбработатьВыбраннуюЯчейкуДляПеремещенияТовара(Этаформа)
	
	Проверка = ОбщегоНазначенияКлиент.СканированныйШтрихкодЯвляетсяЯчейкой(ЭтаФорма.Штрихкод, ЭтаФорма.Объект.ЯчейкаКуда);		
	Если Проверка Тогда                                  
				
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлЯчейки();
		ЭтаФорма.СоздатьДокументПеремещенияПослеСканирЯчейкиКуда(ЭтаФорма.Объект);				
		Результат =  "ЗакрытиеЯчейкиПриемки";									
		
	Иначе                                               
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();
		ОбщегоНазначения.УстановитьРежимВвыбораДляПеремещенияТовара("ПоискНоменклатуры");
		Результат = "ЯчейкаНеСоотвестЯчейкиПриемки";
		
	КонецЕсли; 
	
	ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();					
	Возврат Результат;
	
	
КонецФункции

&НаКлиенте
Функция ОбработатьВыбраннуюЯчейкуИзЗаданияНаИнвентаризацию(ЭтаФорма)
	
	Проверка = ОбщегоНазначенияКлиент.СканированныйШтрихкодЯвляетсяЯчейкой(ЭтаФорма.Штрихкод, ЭтаФорма.КодЯчейкиФормат);		
	Если Проверка Тогда                                  
				
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлЯчейки();
		Результат =  "ЗакрытиеЯчейкиПриемки";									
		
	Иначе                                               
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();
		ОбщегоНазначения.УстановитьРежимВыбораДляДокументаИнвентаризации("ПоискНоменклатуры");
		Результат = "ЯчейкаНеСоотвестЯчейкеИнвентаризации";
		
	КонецЕсли; 
	
	ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();					
	Возврат Результат;
	
КонецФункции
 
&НаКлиенте
Функция ОбработатьШтрихкод_ДляИнвентаризируемойЯчейки(ЭтаФорма, ТипДокумента)
	
	Ошибка            = "";
	Параметры       = ЭтаФорма.Параметры;
	ЯчейкаГУИД     = Параметры.ЯчейкаГУИД;
	Штрихкод         = ЭтаФорма.Штрихкод; 
	ДокументГУИД  = ЭтаФорма.Объект.ДокументГУИД;                                                  	
	ТоварГУИД 	   = ЭтаФорма.НайденныйТовар.Владелец;
	ЭтаФорма.КоличествоНабраноТСД = 0;
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	РезультатСтруктура = ОбщегоНазначения.ПолучитьНабранноеКоличествоТовараИзИнвентаризируемойЯчейки(ДокументГУИД, ЯчейкаГУИД, Штрихкод, ТоварГУИД);
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);			
		Возврат "";
	КонецЕсли; 
	
	
	НабранноеКоличествоТовара = 0;
	Если РезультатСтруктура.Данные.Количество() > 0 Тогда
		НабранноеКоличествоТовара = РезультатСтруктура.Данные[0].Quantity;	
	КонецЕсли; 
	
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Записать отсканированный товар в буфер арм кладовщика с проверкой 
	РежимВвода = ОбщегоНазначения.УстановленРежимВводаРучной();
	
	КоличествоСУчетомКоэффициента = 1 * ЭтаФорма.НайденныйТовар.ШтрихкодЕдИзмКоэффициент;
	УдалятьЗаписиИзБуферов = ОбщегоНазначения.УдалятьЗаписиИзБуферов();
	
	РезультатСтруктура = ОбщегоНазначения.ДобавитьТоварВБуферИнвентаризацииПоЯчейкам(ДокументГУИД, 
																			    ТоварГУИД, 
																			    ОбщегоНазначения.ПолучитьПользователяГУИД(), 
																				ТекущаяДата(), 
																				Штрихкод, 
																				КоличествоСУчетомКоэффициента, 
																				Параметры.ЯчейкаГУИД);			
																																		
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда

		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		Возврат "";
		
	ИначеЕсли РезультатСтруктура.Данные = Ложь Тогда 
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();			
		ПоказатьПредупреждение(,"Ошибка добавления отсканированного товара", 4);	
		Возврат "";
		
	КонецЕсли; 
	
	// Используется дла отображения на форме ТСД в шапке "Набрано 100 ед."
	ЭтаФорма.КоличествоНабраноТСД =  ЭтаФорма.КоличествоНабраноТСД + КоличествоСУчетомКоэффициента + НабранноеКоличествоТовара;
																							 																								 																											 
	ИнформацияОТоваре =  ОбщегоНазначенияКлиент.ПолучитьДляОтсканированногоТовара_Структура_Инвентаризация(ЭтаФорма.НайденныйТовар, ЭтаФорма.КоличествоНабраноТСД);
																								 	
	ОбщегоНазначенияКлиент.ОтобразитьИнформациюОТоваре_Структура(ИнформацияОТоваре, ЭтаФорма.ОписаниеОшибки, ЭтаФорма);
	ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();
		
	Возврат "";                                                                                                             
		
КонецФункции
 
&НаКлиенте                                                                                        
Функция ОбработатьШтрихкод_ДляПеремещенияТоваровУслуг(ЭтаФорма, ТипДокумента) 
	
	Ошибка = "";
	Объект        = ЭтаФорма.Объект;
	Штрихкод      = ЭтаФорма.Штрихкод; 
	ТоварГУИД     = ЭтаФорма.ТоварГУИД;
	                                                    	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////// 
	
	Если Объект.ПеремещениеИзЯчейкиМаркировка И ЭтаФорма.НайденныйТовар.ТребуетсяМаркировка Тогда
		
		Если ЭтаФорма.НайденныйТовар.Свойство("ВведенВОборот") Тогда
			
			Если НЕ ЭтаФорма.НайденныйТовар.ВведенВОборот Тогда
				
				ЭтаФорма.НайденныйТовар = Неопределено; 
				
				ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
				ПоказатьПредупреждение(,"Ошибка: Маркировка не введена в оборот !", 4);	
				Возврат "";
				
			КонецЕсли; 
			
		Иначе
			
			ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
			ПоказатьПредупреждение(,"Ошибка: Товар подлежит маркировке . Отсканируйте марку !", 4);	
			Возврат "";
			
		КонецЕсли;
		
	КонецЕсли; 

	// Получить остаток по найденному товару в ячейке ОТКУДА		
	ТоварГУИД = ЭтаФорма.НайденныйТовар.Владелец;	
	РезультатСтруктура = ОбщегоНазначения.ПолучитьОстатокПоТоваруВЯчейке(Объект.ЯчейкаОткудаГУИД, Штрихкод, ТоварГУИД);
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);			
		Возврат "";
	КонецЕсли; 
		
	Если РезультатСтруктура.Данные.Количество() = 0 Или РезультатСтруктура.Данные[0].ОстатокВЯчейке = 0 Тогда
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
		ПоказатьПредупреждение( ,"Ошибка: Номенклатура со штрихкодом " + ЭтаФорма.Штрихкод + " " + ЭтаФорма.НайденныйТовар.Наименование
			+ " в ячейке " + Объект.ЯчейкаОткуда + " не найдена.", 4);	
		Возврат "";
	КонецЕсли; 
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////			
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////			
	// ОстатокВЯчейке, КоличествоНабрано
	ЭтаФорма.ОстатокПоТоваруВЯчейке = РезультатСтруктура.Данные[0];
	
	КоличествоСУчетомКоэффициента = 1 * ЭтаФорма.НайденныйТовар.ШтрихкодЕдИзмКоэффициент;
	КоличествоНабрано = ЭтаФорма.ОстатокПоТоваруВЯчейке.КоличествоНабрано + КоличествоСУчетомКоэффициента;
	
	Если (ЭтаФорма.ОстатокПоТоваруВЯчейке.ОстатокВЯчейке - КоличествоНабрано) < 0 Тогда
		                                                                                               
		ШаблонТекстаОшибки = "Всего в ячйеке (%1) %2 " + Символы.ПС;
		ШаблонТекстаОшибки = ШаблонТекстаОшибки + "Доступное количество %3" + Символы.ПС;
		ШаблонТекстаОшибки = ШаблонТекстаОшибки + "Уже набрано %4" + Символы.ПС;                        
		
		Ошибка  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаОшибки, 
				ЭтаФорма.Объект.ЯчейкаОткуда,
				ЭтаФорма.ОстатокПоТоваруВЯчейке.ОстатокВЯчейке, 
				?(ЭтаФорма.ОстатокПоТоваруВЯчейке.ОстатокВЯчейке - КоличествоНабрано < 0 , 0 , ЭтаФорма.ОстатокПоТоваруВЯчейке.ОстатокВЯчейке - КоличествоНабрано),
				ЭтаФорма.ОстатокПоТоваруВЯчейке.КоличествоНабрано
				);						
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
		
		ИнформацияОТоваре = ОбщегоНазначенияКлиент.ПолучитьОписаниеТовара(ЭтаФорма.НайденныйТовар);
		ОбщегоНазначенияКлиент.ОтобразитьИнформациюОТоваре(ИнформацияОТоваре, Ошибка, ЭтаФорма);                                         
		ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();
		Возврат "";		
		
	КонецЕсли; 
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////		
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	// Получить остаток по найденному товару в ячейке КУДА			
	РезультатСтруктура = ОбщегоНазначения.ПолучитьОстатокПоТоваруВЯчейке(Объект.ЯчейкаКудаГУИД, Штрихкод, ТоварГУИД);

	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();			
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		Возврат "";
	КонецЕсли; 
	
	Если РезультатСтруктура.Данные.Количество() = 0 Или РезультатСтруктура.Данные[0].ОстатокВЯчейке = 0 Тогда
		ЭтаФорма.ОстатокВЯчейкеКуда = 0;
	Иначе
		ЭтаФорма.ОстатокВЯчейкеКуда = РезультатСтруктура.Данные[0].ОстатокВЯчейке;
	КонецЕсли; 
		
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	// Получить ВЕСЬ остаток по найденному товару 
	РезультатСтруктура = ОбщегоНазначения.ПолучитьОстатокТовара(ТоварГУИД);	
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		Возврат "";
	КонецЕсли; 	
	
	ЭтаФорма.ОстатокВыбранногоТовараНаСкладе = РезультатСтруктура.Данные;
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	//Записать отсканированный товар в буфер арм кладовщика	
	РежимВвода = ОбщегоНазначения.УстановленРежимВводаРучной();
	ПользовательГУИД   = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	КоличествоСУчетомКоэффициента = 1 * ЭтаФорма.НайденныйТовар.ШтрихкодЕдИзмКоэффициент;
	РезультатСтруктура = ОбщегоНазначения.ДобавитьТоварВБуферАРМКладовщикаПеремещение(ПользовательГУИД, 
																					  Объект.ЯчейкаОткудаГУИД, 
																					  ТоварГУИД, 
																					  ТекущаяДата(), 
																					  Штрихкод, 
																					  КоличествоСУчетомКоэффициента, 
																					  Объект.ЯчейкаКудаГУИД, 
																					  РежимВвода);
																					  
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда

		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		Возврат "";
		
	ИначеЕсли РезультатСтруктура.Данные = Ложь Тогда 
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();			
		ПоказатьПредупреждение(,"Ошибка добавления отсканированного товара", 4);	
		Возврат "";
		
	КонецЕсли; 
	
	// Используется дла отображения на форме ТСД в шапке "Набрано 100 ед."
	ЭтаФорма.КоличествоНабраноТСД =  ЭтаФорма.КоличествоНабраноТСД + КоличествоСУчетомКоэффициента;
	
	// Увеличить на 1 единицу количество отсканированого товара
	ЭтаФорма.ОстатокПоТоваруВЯчейке.КоличествоНабрано = ЭтаФорма.ОстатокПоТоваруВЯчейке.КоличествоНабрано + КоличествоСУчетомКоэффициента;
	
	
	ИнформацияОТоваре =  ОбщегоНазначенияКлиент.ПолучитьОписаниеОтсканированногоТовара_Структура_Перемещение(ЭтаФорма.НайденныйТовар, 
																								 			 ЭтаФорма.ОстатокПоТоваруВЯчейке,
																								 			 ЭтаФорма.ОстатокВЯчейкеКуда,
																								 			 ЭтаФорма.ОстатокВыбранногоТовараНаСкладе);
																								 
	
	ОбщегоНазначенияКлиент.ОтобразитьИнформациюОТоваре_Структура(ИнформацияОТоваре, ЭтаФорма.ОписаниеОшибки, ЭтаФорма);
	ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////		
	
	Возврат "";
	
КонецФункции

&НаКлиенте                                                                                        
Функция ОбработатьШтрихкод_ДляПоступлениеТоваровУслуг(ЭтаФорма, ТипДокумента, ГМ = Ложь) 
	
	Ошибка = "";
	Объект        = ЭтаФорма.Объект;
	Штрихкод      = ЭтаФорма.Штрихкод; 
	//+Марков И. 04.12.2025 #UT10-5571
	ТоварГУИД     = ЭтаФорма.ТоварГУИД;
	//-Марков И. 04.12.2025 #UT10-5571
	ДокументГУИД  = Объект.ДокументГУИД;     
	
	Если ГМ Тогда      
		
		РезультатСтруктура = ОбщегоНазначения.ДобавитьТоварВБуферАРМКладовщикаГМ(ДокументГУИД, ОбщегоНазначения.ПолучитьПользователяГУИД(), ТекущаяДата(), 
		Штрихкод, Объект.ЯчейкаПриемкиГУИД);	
		
		ИнформацияОТоваре = Новый Структура("Наименование", Штрихкод);	
		ОбщегоНазначенияКлиент.ОтобразитьИнформациюОГМ_Структура(ИнформацияОТоваре, ЭтаФорма.ОписаниеОшибки, ЭтаФорма);
		ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();   
		
		Возврат ""; 
		
	КонецЕсли;
	
	Если ОбщегоНазначения.ПолучитьСтатусРаботыСРазмещениемДокумента() = "ВыборНомеклатурыДляМаркировки" Тогда
		
		ЭтаФорма.ОстатокПоТоваруВДокументе = ОбщегоНазначения.ПолучитьОстаткиПоМаркировкам(ДокументГУИД , ЭтаФорма.НайденныйТовар); 
		
		Если ЭтаФорма.ОстатокПоТоваруВДокументе.КоличествоОтсканированныхМаркировок + ЭтаФорма.ОстатокПоТоваруВДокументе.КоличествоВБуфереМаркировок 
			= ЭтаФорма.ОстатокПоТоваруВДокументе.КоличествоТоваровСМаркировкой Тогда
			
			ЭтаФорма.ОписаниеОшибки = "По товару внесены все маркировки";				
			ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
			
		КонецЕсли;	 
		
		ИнформацияОТоваре = ОбщегоНазначенияКлиент.ПолучитьДляОтсканированногоТовараДляМаркировки_Структура(ЭтаФорма.НайденныйТовар , ЭтаФорма.ОстатокПоТоваруВДокументе);	
		ОбщегоНазначенияКлиент.ОтобразитьИнформациюОТоваре_Структура(ИнформацияОТоваре , ЭтаФорма.ОписаниеОшибки , ЭтаФорма);
		ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров(); 
		
		Возврат "";
		
	КонецЕсли;
	
	Если ОбщегоНазначения.ПолучитьСтатусРаботыСРазмещениемДокумента() = "ВыборМаркировки" Тогда
		
		Если ЗначениеЗаполнено(ЭтаФорма.НайденнаяМаркировка) Тогда
					
			Если ЭтаФорма.ОстатокПоТоваруВДокументе.КоличествоОтсканированныхМаркировок + ЭтаФорма.ОстатокПоТоваруВДокументе.КоличествоВБуфереМаркировок = ЭтаФорма.ОстатокПоТоваруВДокументе.КоличествоТоваровСМаркировкой Тогда
				
				ЭтаФорма.ОписаниеОшибки = "По товару внесены все маркировки";
				ИнформацияОТоваре = ОбщегоНазначенияКлиент.ПолучитьДляОтсканированногоТовараДляМаркировки_Структура(ЭтаФорма.НайденныйТовар , ЭтаФорма.ОстатокПоТоваруВДокументе);	
				ОбщегоНазначенияКлиент.ОтобразитьИнформациюОТоваре_Структура(ИнформацияОТоваре , ЭтаФорма.ОписаниеОшибки , ЭтаФорма);
				ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров(); 
				
				ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
				Возврат "";
				
			КонецЕсли;
			
			РезультатСтруктура = ОбщегоНазначения.ДобавитьТоварВБуферМаркировок(ДокументГУИД , ОбщегоНазначения.ПолучитьПользователяГУИД(), ТекущаяДата(), 
			                 ЭтаФорма.НайденныйТовар, ЭтаФорма.НайденнаяМаркировка);	   
			
			Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
				
				ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
				ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
				Возврат "";
				
			ИначеЕсли Найти(РезультатСтруктура.Данные, "МаркировкаСоШтрихКодомУжеВнесена") > 0 Тогда 
				
				ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();					
				ЭтаФорма.ОписаниеОшибки = Сред(РезультатСтруктура.Данные, Найти(РезультатСтруктура.Данные, ":") + 1);
				
				ИнформацияОТоваре = ОбщегоНазначенияКлиент.ПолучитьОписаниеТовара(ЭтаФорма.НайденныйТовар);
				ОбщегоНазначенияКлиент.ОтобразитьИнформациюОТоваре(ИнформацияОТоваре, ЭтаФорма.ОписаниеОшибки, ЭтаФорма);                                         
				ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();
				Возврат "";
				
			ИначеЕсли Найти(РезультатСтруктура.Данные, "МаркировкаСоШтрихКодомУжеОтсканированна") > 0 Тогда 
				
				ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();					
				ЭтаФорма.ОписаниеОшибки = Сред(РезультатСтруктура.Данные, Найти(РезультатСтруктура.Данные, ":") + 1);
				
				ИнформацияОТоваре = ОбщегоНазначенияКлиент.ПолучитьОписаниеТовара(ЭтаФорма.НайденныйТовар);
				ОбщегоНазначенияКлиент.ОтобразитьИнформациюОТоваре(ИнформацияОТоваре, ЭтаФорма.ОписаниеОшибки, ЭтаФорма);                                         
				ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();
				Возврат "";
				
			КонецЕсли;
			
			Если Найти(РезультатСтруктура.Данные, "Истина") > 0 Тогда 
				ЭтаФорма.ОстатокПоТоваруВДокументе = ОбщегоНазначения.ПолучитьОстаткиПоМаркировкам(ДокументГУИД , ЭтаФорма.НайденныйТовар); 
			КонецЕсли;
			
			ИнформацияОТоваре = ОбщегоНазначенияКлиент.ПолучитьДляОтсканированногоТовараДляМаркировки_Структура(ЭтаФорма.НайденныйТовар , ЭтаФорма.ОстатокПоТоваруВДокументе);	
			ОбщегоНазначенияКлиент.ОтобразитьИнформациюОТоваре_Структура(ИнформацияОТоваре , ЭтаФорма.ОписаниеОшибки , ЭтаФорма);
			ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров(); 
			
		КонецЕсли;
		
		Возврат "";
		
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Записать отсканированный товар в буфер арм кладовщика с проверкой 
	ТоварГУИД = ЭтаФорма.НайденныйТовар.Владелец;
	РежимВвода = ОбщегоНазначения.УстановленРежимВводаРучной();
	
	КоличествоСУчетомКоэффициента = 1 * ЭтаФорма.НайденныйТовар.ШтрихкодЕдИзмКоэффициент;
	УдалятьЗаписиИзБуферов = ОбщегоНазначения.УдалятьЗаписиИзБуферов();
	РезультатСтруктура = ОбщегоНазначения.ДобавитьТоварВБуферАРМКладовщикаСПроверкой(ДокументГУИД, ТоварГУИД, 
		ОбщегоНазначения.ПолучитьПользователяГУИД(), ТекущаяДата(), Штрихкод, КоличествоСУчетомКоэффициента, Объект.ЯчейкаПриемкиГУИД);			
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
			
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		Возврат "";
		
	ИначеЕсли Найти(РезультатСтруктура.Данные, "НоменклатураПодлежитОбязательнойМаркировке") > 0 Тогда 
		                                                                                       
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();					
	    ЭтаФорма.ОписаниеОшибки = Сред(РезультатСтруктура.Данные, Найти(РезультатСтруктура.Данные, ":") + 1);
		
		ИнформацияОТоваре = ОбщегоНазначенияКлиент.ПолучитьОписаниеТовара(ЭтаФорма.НайденныйТовар);
		ОбщегоНазначенияКлиент.ОтобразитьИнформациюОТоваре(ИнформацияОТоваре, ЭтаФорма.ОписаниеОшибки, ЭтаФорма);                                         
		ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();
	  	Возврат "";

	ИначеЕсли Найти(РезультатСтруктура.Данные, "НоменклатураСоШтрихкодомНеНайдена") > 0 Тогда 
		                                                                                       
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();					
		ЭтаФорма.ОписаниеОшибки = Сред(РезультатСтруктура.Данные, Найти(РезультатСтруктура.Данные, ":") + 1);				
		ИнформацияОТоваре = ОбщегоНазначенияКлиент.ПолучитьОписаниеТовара(ЭтаФорма.НайденныйТовар);
		ОбщегоНазначенияКлиент.ОтобразитьИнформациюОТоваре(ИнформацияОТоваре, ЭтаФорма.ОписаниеОшибки, ЭтаФорма);                                         		
		Возврат "";

	ИначеЕсли Найти(РезультатСтруктура.Данные, "ПытаетсяВзятьБольшееКолво") > 0 Тогда 
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();					
		ЭтаФорма.ОписаниеОшибки = Сред(РезультатСтруктура.Данные, Найти(РезультатСтруктура.Данные, ":") + 1);
		
		ИнформацияОТоваре = ОбщегоНазначенияКлиент.ПолучитьОписаниеТовара(ЭтаФорма.НайденныйТовар);
		ОбщегоНазначенияКлиент.ОтобразитьИнформациюОТоваре(ИнформацияОТоваре, ЭтаФорма.ОписаниеОшибки, ЭтаФорма);                                         
		ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();
		Возврат "";
		
	ИначеЕсли Найти(РезультатСтруктура.Данные, "Истина") > 0 Тогда 	
		
		ТекстСообщения = Сред(РезультатСтруктура.Данные, Найти(РезультатСтруктура.Данные, ":") + 1);
		Массив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекстСообщения);
		ЭтаФорма.ОстатокПоТоваруВДокументе = Новый Структура("КоличествоНабрано, КоличествоВДокументе, КоличествоВБуфере, КоличествоВРазмещении", 
															 Число(Массив.Получить(0)), 
															 Число(Массив.Получить(1)),
															 Число(Массив.Получить(2)),
															 Число(Массив.Получить(3))
															 );
		
	КонецЕсли; 
	
		
	ИнформацияОТоваре = ОбщегоНазначенияКлиент.ПолучитьДляОтсканированногоТовара_Структура(ЭтаФорма.НайденныйТовар, ЭтаФорма.ОстатокПоТоваруВДокументе);	
	ОбщегоНазначенияКлиент.ОтобразитьИнформациюОТоваре_Структура(ИнформацияОТоваре, ЭтаФорма.ОписаниеОшибки, ЭтаФорма);
	ЭтаФорма.ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();
	
	Возврат "";
	
КонецФункции

&НаКлиенте                                                                                        
Функция ОшибкаПроверкиСостоянияКода(КодМаркировки, РазрешитьПриниматьКМБезПроверкиСостояния, СостояниеКМ)   
	
	//+Шульман А. 13.11.2025 #UT10-5504
	РезультатПроверкиКМ = ОбщегоНазначения.ПроверитьСостояниеКМ(КодМаркировки);    
	СостояниеКМ = РезультатПроверкиКМ.СостояниеКМ;
	
	Если РезультатПроверкиКМ.Действие = "Обработать ошибку сервиса" Тогда   
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	

		СписокОтветов = Новый СписокЗначений;      
		
		Если РазрешитьПриниматьКМБезПроверкиСостояния Тогда
			
			СписокОтветов.Добавить(КодВозвратаДиалога.Да  , "Пропустить проверку");  
			СписокОтветов.Добавить(КодВозвратаДиалога.Нет , "Отсканирую позже");   
			
			ОтветНаВопрос = Вопрос("" , СписокОтветов , , КодВозвратаДиалога.Да , "Сервис проверки маркировки недоступен или ошибка чтения данных на сервисе");  
			
			Если ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда   
				
				СостояниеКМ = "Разместить для возврата";
				Возврат Истина;    
				
			Иначе           
				
				СостояниеКМ = "Пропустить проверку";
				Возврат Ложь;
				
			КонецЕсли;      
			
		Иначе
			
			СписокОтветов.Добавить(КодВозвратаДиалога.Да, "Продолжить");
			ОтветНаВопрос = Вопрос("" , СписокОтветов , , КодВозвратаДиалога.Да , "Сервис недоступен или ошибка чтения данных на сервисе. Отсканируйте марку позже.");   
			СостояниеКМ = "Разместить для возврата";
			Возврат Истина;    
		
		КонецЕсли;   
		
	ИначеЕсли РезультатПроверкиКМ.Действие = "Обработать код не в обороте" Тогда
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлОшибки();	
		
		СписокОтветов = Новый СписокЗначений;      
		СписокОтветов.Добавить(КодВозвратаДиалога.Да, "Продолжить");  
		ОтветНаВопрос = Вопрос("" , СписокОтветов , , КодВозвратаДиалога.Да , "Код маркировки не в обороте. Отложите товар!");  
		СостояниеКМ = "Разместить для возврата";
        Возврат Истина;
		
	КонецЕсли;  
	
	Возврат Ложь;
    //-Шульман А. 13.11.2025 #UT10-5504

КонецФункции // ()


