&НаКлиенте
Перем Компонента;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ЗаголовокПоляВвода", ЭтаФорма.Заголовок);
	ЗаписыватьРасширенныеЛоги = Константы.ЗаписыватьРасширенныеЛоги.Получить();  
	
КонецПроцедуры
 

//Обработчики событий формы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Компонента = ОбщегоНазначенияКлиент.ПодключитьКомпоненту();
	
	Если Компонента <> Неопределено И Не Компонента.Подключить() Тогда
			
		ТекстОшибки = "";
		КодОшибки = Компонента.ПолучитьОшибку(ТекстОшибки);
		ПоказатьПредупреждение(, "Ошибка: " + КодОшибки + ", " + ТекстОшибки);   
			
	КонецЕсли;

	Адрес = ОбщегоНазначения.ПолучитьАдрес();
	
	ПодключитьОбработчикОжидания("ОтсканироватьЛичныйШК", 1, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Компонента <> Неопределено Тогда
		Компонента.Отключить();
	КонецЕсли;	
	
	ОтключитьОбработчикОжидания("ОтсканироватьЛичныйШК");
	
КонецПроцедуры

&НаКлиенте                                                                        
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если Событие = "UniversalBroadcastEvent" Тогда
		
		//+Шульман А. 05.12.2025 #UT10-5576
		//Если ЗаписыватьРасширенныеЛоги Тогда
		//	ASK_ОбработкаОшибок.ПолучитьСтекВызовов("ФормаАвторизации. ВнешнееСобытие", Данные, Истина);
		//Иначе
		//	ASK_ОбработкаОшибок.Ошибка("ФормаАвторизации. Сканирование. Данные на входе", Данные, "ВнешнееСобытие");
		//КонецЕсли;       
		//-Шульман А. 05.12.2025 #UT10-5576
		
		Результат = ОбщегоНазначения.ПолучитьЗначениеШтрихкода(Данные);
		
		Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
			
			ПоказатьПредупреждение(, "Ошибка сканирования штрихкода", 4);
			Возврат;			
			
		КонецЕсли; 
		
		Штрихкод = Результат.Штрихкод;
		
		// Пользователь может нажать несколько раз сканирование штрихкода, но форма уже закрыта.
		Если ВводДоступен() Тогда
			ОбработатьОтсканированныйШтрихкод();
		КонецЕсли; 
		
	ИначеЕсли Событие = "ClipboardEvent" Тогда
		
		Штрихкод = Данные;
		ОбработатьОтсканированныйШтрихкод();
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)
	
	ОбработатьОтсканированныйШтрихкод();	
	
КонецПроцедуры               

&НаКлиенте
Процедура ОбработатьОтсканированныйШтрихкод()
	
	//+Шульман А. 05.12.2025 #UT10-5576
	Если ЗаписыватьРасширенныеЛоги Тогда
		ASK_ОбработкаОшибок.ПолучитьСтекВызовов("ФормаПодтвержденияЛичногоШК", "ОбработатьОтсканированныйШтрихкод", Истина);
	КонецЕсли;       
	//-Шульман А. 05.12.2025 #UT10-5576
	
	Адрес = ОбщегоНазначения.ПолучитьАдрес();
	
	РезультатВозврата = ОбщегоНазначения.ПолучитьПользователя(Штрихкод, Пароль, Адрес);
	
	Если ЗначениеЗаполнено(РезультатВозврата.Ошибка) Тогда
		
		Штрихкод = "";
		Пароль = "";  
		
		СписокОтветов = Новый СписокЗначений;      
		СписокОтветов.Добавить(КодВозвратаДиалога.Да, "Продолжить");  
		ОтветНаВопрос = Вопрос("" , СписокОтветов , , КодВозвратаДиалога.Да , "Ошибка: " + РезультатВозврата.Ошибка);  
	
	ИначеЕсли РезультатВозврата.Свойство("Данные") И ТипЗнч(РезультатВозврата.Данные) = Тип("Структура") ТОгда
		
		Если РезультатВозврата.Данные.Свойство("ПользовательГУИД") И РезультатВозврата.Данные.ПользовательГУИД = ОбщегоНазначения.ПолучитьКонстанту("ПользовательГУИД") Тогда  
			Закрыть("ОК");
		КонецЕсли;
		
	Иначе
		
		// Неправильный ШК или пароль
		Штрихкод = "";
		Пароль = "";  
		
		СписокОтветов = Новый СписокЗначений;      
		СписокОтветов.Добавить(КодВозвратаДиалога.Да, "Продолжить");  
		ОтветНаВопрос = Вопрос("" , СписокОтветов , , КодВозвратаДиалога.Да , "Ошибка: Неправильный ШК");  
	
	КонецЕсли;

КонецПроцедуры
 
&НаКлиенте
Процедура ОтсканироватьЛичныйШК() Экспорт
	
	Если СтрДлина(Элементы.Пароль.ТекстРедактирования) >= 1 Тогда
		Элементы.Подтвердить.Доступность = Истина;
	Иначе
		Элементы.Подтвердить.Доступность = Ложь;
	КонецЕсли; 
	
КонецПроцедуры



