
&НаКлиенте
Перем Компонента;
&НаКлиенте
Перем РежимВводаАвтоматический;
&НаКлиенте
Перем Ошибка;
&НаКлиенте
Перем ПоказатьЗаглушкуДляОшибкиСканирования;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " " + Параметры.ЯчейкаКод;
	ЗаписьЗадНаИнвенСтруктура = ОбщегоНазначения.ПолучитьЗаписьИзРегистраСведений("СписокЗаданийНаИнвентаризацию", "Ссылка", Параметры.ЗаданиеНаИнвентаризациюГУИД);	
	
	Компонента = ОбщегоНазначенияКлиент.ПодключитьКомпоненту();	
	
	Если Компонента <> Неопределено И Не Компонента.Подключить() Тогда		
		ТекстОшибки = "";
		КодОшибки = Компонента.ПолучитьОшибку(ТекстОшибки);                                                   
		ПоказатьПредупреждение(,"Ошибка: "+КодОшибки+", " + ТекстОшибки);
	КонецЕсли;	
	

	ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();				
	Оповестить("ГруппаПоискаТовара", Истина);
			
	ОбщегоНазначенияКлиент.ЗаполнитьТабЗначОК(ЭтаФорма);	
	ЗаполнитьТЗРучнойНабор();
		
КонецПроцедуры
 
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Компонента <> Неопределено Тогда
		Компонента.Отключить();
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначения.ОчиститьРегистрСведений("СписокТоваровВБуфереИнвентаризации");
	
	ОбщегоНазначения.УстановитьРежимВыбораДляДокументаИнвентаризации("ПоискНоменклатуры");
	ОбщегоНазначения.УстановитьРежимВводаНаСервере(Истина);
	КодЯчейкиФормат = СтрЗаменить(Параметры.ЯчейкаКод , "-", "");
	Объект.ДокументГУИД = Параметры.ЗаданиеНаИнвентаризациюГУИД;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЗРучнойНабор()
	
	РучнойВводКоличества.Очистить();
	СтрокаТЗ = РучнойВводКоличества.Добавить();
	СтрокаТЗ.Заголовок = "Кол.:";
	СтрокаТЗ.ЗнакБольше = ">";
	СтрокаТЗ.ЗнакМеньше = "<";
	СтрокаТЗ.ВведенноеКоличествоВРучную = 1;
	Элементы.РучнойВводКоличества.Обновить();
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров() Экспорт
	
	
	СтатусРаботы = ОбщегоНазначения.ПолучитьСтатусРаботыСИнвентаризациейЯчейки();
	Элементы.ЗаглушкаДляОшибкиСканирования.Видимость = Ложь;
	Элементы.ГруппаСвайп.ТекущаяСтраница = Элементы.ГруппаСтраница_РаботаСТоваром;	

	ОбновитьСлуженоеСообщениеПодвал();
	
	Если ЗначениеЗаполнено(ЭтаФорма.ОписаниеОшибки) Тогда
		Элементы.ГруппаОсновноеСтраницы.ТекущаяСтраница = Элементы.ГруппаОшибкаСканирования;
		Элементы.ГруппаАвтоматическийВвод.Видимость = Ложь;
		Элементы.ГруппаОшибкаСканирования.Видимость = Истина;
		Элементы.ЗаглушкаДляОшибкиСканирования.Видимость = ПоказатьЗаглушкуДляОшибкиСканирования;
		
		Элементы.ГруппаРучнойВвод.Видимость = Ложь;	
		
		//Элементы.КнопкаПропустить.Видимость = Ложь;
		//Элементы.КнопкаДобавитьШтрихкод.Видимость = Ложь;
		//Элементы.КнопкаВыбратьТоварИзДокумента.Видимость = Ложь;
		                                                                                                                                       
		Возврат;
	КонецЕсли; 
		
	РежимВводаАвтоматический = ОбщегоНазначения.УстановленРежимВводаАвтоматический();	
	Если РежимВводаАвтоматический Тогда
		
		Элементы.ГруппаОсновноеСтраницы.ТекущаяСтраница = Элементы.ГруппаАвтоматическийВвод;
		Элементы.ГруппаАвтоматическийВвод.Видимость = Истина;
		Элементы.ГруппаОшибкаСканирования.Видимость = Ложь;
		Элементы.ГруппаРучнойВвод.Видимость = Ложь;			

		//Элементы.КнопкаПропустить.Видимость = Ложь;
		//Элементы.КнопкаВыбратьТоварИзДокумента.Видимость = Ложь;	
	//	
	ИначеЕсли Не РежимВводаАвтоматический И СтатусРаботы = "ВводКоличестваНоменклатуры" Тогда 
		                                                                                                                  
		Элементы.ГруппаОсновноеСтраницы.ТекущаяСтраница = Элементы.ГруппаРучнойВвод;
		Элементы.ГруппаАвтоматическийВвод.Видимость = Ложь;
		Элементы.ГруппаОшибкаСканирования.Видимость = Ложь;
		Элементы.ГруппаРучнойВвод.Видимость = Истина;		
		
	ИначеЕсли Не РежимВводаАвтоматический И СтатусРаботы = "ПоискНоменклатуры" Тогда 
		
		Элементы.ГруппаОсновноеСтраницы.ТекущаяСтраница = Элементы.ГруппаАвтоматическийВвод;
		Элементы.ГруппаАвтоматическийВвод.Видимость = Истина;
		Элементы.ГруппаОшибкаСканирования.Видимость = Ложь;
		Элементы.ГруппаРучнойВвод.Видимость = Ложь;		
				
	КонецЕсли; 
	
КонецПроцедуры                                                           

&НаКлиенте
Процедура УстановитьРежимВвода(Команда)
	
	ОбщегоНазначения.УстановитьРежимВводаНаСервере();
	ОбновитьСлуженоеСообщениеПодвал();
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьСлуженоеСообщениеПодвал() Экспорт
	
	ЭтаФорма.Подвал.Очистить();	
	СтрокаТЗ = Подвал.Добавить();

	СтрокаТЗ.ФИОСотрудинка = ОбщегоНазначенияКлиент.ПолучитьОписаниеСотрудника();
	СтрокаТЗ.ОписаниеРежимаВводаКоличества = ОбщегоНазначенияКлиент.ПолучитьОтображениеОРежимеВводеКоличества();
	Элементы.Подвал.Обновить();
	
	ЭтаФорма.ПодвалСообщение.Очистить();	
	СтрокаТЗ = ПодвалСообщение.Добавить();	
	СтрокаТЗ.СообщениеДляПользователя = ОбщегоНазначения.ПолучитьИнструкциюДействийДляПользователя_ИнвентаризацияЯчеейки();
	Элементы.ПодвалСообщение.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура Ок(Команда)
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Поиск) Тогда
		Сообщить("Введите код производителя или штрихкод.");
		Возврат;
	КонецЕсли; 
	
	ЭтаФорма.Штрихкод = СокрЛП(ЭтаФорма.Поиск);
	ЭтаФорма.ТоварГУИД = "";
	//Кабанов А.В. 17.03.2021 UT10-1585  
	Проверка = ОбщегоНазначенияКлиент.СканированныйШтрихкодЯвляетсяЯчейкой(ЭтаФорма.Штрихкод, Параметры.ЯчейкаКод);
	Если Проверка Тогда
		ЗавершитьРаботуСячейкой(Неопределено);
	Иначе
		Проверка = ОбщегоНазначенияКлиент.СканированныйШтрихкодЯвляетсяЯчейкой(ЭтаФорма.Штрихкод,СтрЗаменить(Параметры.ЯчейкаКод,"-",""));
		Если Проверка Тогда
			ЗавершитьРаботуСячейкой(Неопределено);
		Иначе
			ОбработкаОтсканированногоТовара();
		КонецЕсли;
	КонецЕсли;
	//Кабанов А.В. 17.03.2021 UT10-1585 
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОтсканированногоТовара()

	Оповестить("ГруппаПоискаТовара", Ложь);	
	РежимВводаАвтоматический = ОбщегоНазначения.УстановленРежимВводаАвтоматический();
	Если РежимВводаАвтоматический Тогда
				
		Результат = ОбработкаШтрихкодаАвтоматический.ОбработкаШтрихкодаВАвтоматическомРежиме(ЭтаФорма, "ЗаданиеНаИнвентаризацию");		
		Если Результат = "ЗакрытиеЯчейкиИнвентаризации" Тогда
			
			// После, чего должна открыться форма Выборка ячейки для инвентаризации.
			
			Закрыть();
			Возврат;
			
		ИначеЕсли Результат =  "ЯчейкаНеСоотвестЯчейкеИнвентаризации" Тогда  
			
			ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВыборНоменклатуры");
			ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		
			Возврат;
			
		ИначеЕсли Результат = "НеизвестныйШтрихкод" Тогда 
			
				ОписаниеОшибки = "По введеным данным " + ЭтаФорма.Штрихкод + " совпадений не найдено.";                 
				ЭтаФорма.Штрихкод = "";
				
				ЭтаФорма.Набрано.Очистить();
				НоваяСтрока = ЭтаФорма.Набрано.Добавить();		
				НоваяСтрока.СообщениеТоварНеНайден = ОписаниеОшибки; 
				
				ПоказатьЗаглушкуДляОшибкиСканирования = Истина;
				
				ОбщегоНазначения.УстановитьРежимВыбораДляДокументаИнвентаризации("ВыборНоменклатуры");
				ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();
			
		Иначе
			
			ОбщегоНазначения.УстановитьРежимВыбораДляДокументаИнвентаризации("ВыборНоменклатуры");
			ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		
			
		КонецЕсли; 
		
	КонецЕсли;
	
	
	Если Не РежимВводаАвтоматический Тогда
		
		Результат = ОбработкаШтрихкодаРучной.ОбработкаШтрихкодаВРучномРежиме(ЭтаФорма, "ЗаданиеНаИнвентаризацию");
		Если Результат = "ЗакрытиеЯчейкиИнвентаризации" Тогда
			
			// После, чего должна открыться форма Выборка ячейки для инвентаризации.
			Закрыть();
			Возврат;
			
		ИначеЕсли Результат =  "ЯчейкаНеСоотвестЯчейкеИнвентаризации" Тогда  
			
			ОбщегоНазначения.УстановитьРежимВыбораДляДокументаРазмещения("ВводКоличестваНоменклатуры");
			ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		
			Возврат;
			
		ИначеЕсли Результат = "НеизвестныйШтрихкод" Тогда 
			
				ОписаниеОшибки = "По введеным данным " + ЭтаФорма.Штрихкод + " совпадений не найдено.";                 
				ЭтаФорма.Штрихкод = "";
				
				ЭтаФорма.Набрано.Очистить();
				НоваяСтрока = ЭтаФорма.Набрано.Добавить();		
				НоваяСтрока.СообщениеТоварНеНайден = ОписаниеОшибки; 
				
				ПоказатьЗаглушкуДляОшибкиСканирования = Истина;
				
				ОбщегоНазначения.УстановитьРежимВыбораДляДокументаИнвентаризации("ВыборНоменклатуры");
				ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();
			
		Иначе
			
			ОбщегоНазначения.УстановитьРежимВыбораДляДокументаИнвентаризации("ВводКоличестваНоменклатуры");
			ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		
			
		КонецЕсли; 
		
	КонецЕсли; 	
	
КонецПроцедуры
 

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////		
	Если ИмяСобытия = "СканированиеШтрихкода" Тогда
		
		#Если МобильноеПриложениеКлиент Тогда
		Если ЗначениеЗаполнено(ЭтаФорма.ОписаниеОшибки) Тогда
			Компонента.Отключить();
		Иначе
			Компонента.Подключить();
		КонецЕсли; 
		#КонецЕсли 	
		Возврат;		
	КонецЕсли; 
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////		
	Если ИмяСобытия = "ВидимостьОписанияНайденногоТовара" Тогда
		
		Элементы.ГруппаОписаниеНайденногоТовара.Видимость = Параметр.ГруппаОписаниеНайденногоТовара;
		Элементы.ГруппаОписаниеНайденногоТовараПолное.Видимость = Параметр.ГруппаОписаниеНайденногоТовараПолное;
		Элементы.ГруппаОписаниеОшибки.Видимость = Параметр.ГруппаОписаниеОшибки;
		Возврат;
		
	КонецЕсли; 

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	Если ИмяСобытия = "ГруппаПоискаТовара" Тогда
		
		Элементы.ГруппаПоискаТовара.Видимость = Параметр;
		ЭтаФорма.Поиск = "";
		Возврат;
		
	КонецЕсли; 
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	
КонецПроцедуры


&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если Не ВводДоступен() Тогда
		Возврат;
	КонецЕсли; 
	Если Событие = "UniversalBroadcastEvent" Тогда
		
		Результат = ОбщегоНазначения.ПолучитьЗначениеШтрихкода(Данные);
		Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
			ПоказатьПредупреждение(, "Ошибка сканирования штрихкода", 4);
			Возврат;
		КонецЕсли; 
		ЭтаФорма.Штрихкод = Результат.Штрихкод;
		ЭтаФорма.ТоварГУИД = "";
		//Кабанов А.В. 17.03.2021 UT10-1585
		Проверка = ОбщегоНазначенияКлиент.СканированныйШтрихкодЯвляетсяЯчейкой(ЭтаФорма.Штрихкод, СтрЗаменить(Параметры.ЯчейкаКод,"-",""));
		Если Проверка Тогда
			ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлЯчейки();
			ЗавершитьРаботуСячейкой(Неопределено);
			Возврат;
		Иначе
		СтатусРаботы = ОбщегоНазначения.ПолучитьСтатусРаботыСИнвентаризациейЯчейки();
		Если СтатусРаботы = "ПоискНоменклатуры" Тогда
			ОбработкаОтсканированногоТовара();								
		КонецЕсли; 					
		КонецЕсли;
		//Кабанов А.В. 17.03.2021 UT10-1585
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ВключитьПоискТовара(Команда)
	
		
	ЭтаФорма.ОписаниеОшибки = "";
	ЭтаФорма.ОписаниеНайденногоТовара =  "";
	ЭтаФорма.Штрихкод = "";
	ЭтаФорма.Поиск = "";
	
	ОбщегоНазначенияКлиент.ОчиститьПоляНайденныйТовар(ЭтаФорма);		
	ОбщегоНазначения.УстановитьРежимВыбораДляДокументаИнвентаризации("ПоискНоменклатуры");		
	ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();	
	
	Оповестить("ГруппаПоискаТовара", Истина);	
	Оповестить("СканированиеШтрихкода");		
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПродолжитьСканирование(Команда)
	
	ЭтаФорма.ОписаниеОшибки = "";
	ЭтаФорма.ОписаниеНайденногоТовара =  "";
	ЭтаФорма.Штрихкод = "";
	ЭтаФорма.Поиск = "";
	
	ОбщегоНазначенияКлиент.ОчиститьПоляНайденныйТовар(ЭтаФорма);	
	ОбщегоНазначения.УстановитьРежимВыбораДляДокументаИнвентаризации("ПоискНоменклатуры");		
	ОбщегоНазначения.УстановитьРежимВводаНаСервере(Истина);
	
	ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();		
	
	Оповестить("ГруппаПоискаТовара", Истина);
	Оповестить("СканированиеШтрихкода");	
	
КонецПроцедуры
  
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Обновить информацию о статусах ячеек по всем заданиям сотрудника
	РезультатСтруктура = ОбщегоНазначения.ЗагрузитьЗаданияНаИнвентаризцию();
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		Возврат;
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура КнопкаВнестиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "КнопкаВнестиОк" Тогда
		
		ОбработкаШтрихкодаРучной.ОбработатьВведеноеКоличествоТовара(ЭтаФорма,  "ИнвентаризацияЯчейки");		
		ОбщегоНазначения.УстановитьРежимВыбораДляДокументаИнвентаризации("ПоискНоменклатуры");
		ПоказатьСтраницу_ГруппаСтраницыРаботаСТоваров();
		
	КонецЕсли; 
 
	                                                                                         
КонецПроцедуры

&НаКлиенте
Процедура РучнойВводКоличестваВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "РучнойВводКоличестваЗнакМеньше" Тогда
		
		Если РучнойВводКоличества[0].ВведенноеКоличествоВРучную > 1 Тогда
			РучнойВводКоличества[0].ВведенноеКоличествоВРучную = РучнойВводКоличества[0].ВведенноеКоличествоВРучную - 1;	
		КонецЕсли; 
				
	ИначеЕсли Поле.Имя = "РучнойВводКоличестваЗнакБольше" Тогда 
		
		РучнойВводКоличества[0].ВведенноеКоличествоВРучную = РучнойВводКоличества[0].ВведенноеКоличествоВРучную + 1;	
		
	ИначеЕсли Поле.Имя = "РучнойВводКоличестваВведенноеКоличествоВРучную" Тогда 
		
		Оповещение = Новый ОписаниеОповещения("ПолучениеДанныхПриЗакрытииФормыВводКоличестваВРучную", ЭтаФорма);				
		ПараметрыФормы = Новый Структура("Количество", РучнойВводКоличества[0].ВведенноеКоличествоВРучную);
		ОткрытьФорму("Обработка.ИнвентаризацияПоЯчейкам.Форма.ФормаВводКоличестваВРучную", ПараметрыФормы, ЭтаФорма,,, , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли; 

КонецПроцедуры


&НаКлиенте
Процедура ПолучениеДанныхПриЗакрытииФормыВводКоличестваВРучную(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Или Результат.ВведеноеКоличествоВРучную = 0 Тогда
		Количество = 1;
	Иначе 
		Количество = Результат.ВведеноеКоличествоВРучную;
	КонецЕсли; 
	
	РучнойВводКоличества[0].ВведенноеКоличествоВРучную = Количество;
		
КонецПроцедуры


&НаКлиенте
Процедура ПодвалВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ПодвалОписаниеРежимаВводаКоличества" Тогда
		
		ОбщегоНазначения.УстановитьРежимВводаНаСервере();
		ОбновитьСлуженоеСообщениеПодвал();

	КонецЕсли; 	
		
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокПроинвентарТоваров(Команда)
	
	РезультатСтруктура = ОбщегоНазначения.ПолучитьСписокЗаписейИзБуфераИнвентаризации(Параметры.ЗаданиеНаИнвентаризациюГУИД, Параметры.ЯчейкаГУИД );
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		Возврат;
	КонецЕсли; 
		
	Элементы.ГруппаСвайп.ТекущаяСтраница = Элементы.ГруппаСтраница_ИнвентаризируемыеТовары;		
	Элементы.СписокПроИнвентаризТоваровИзЯчейки.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСвайпПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "ГруппаСтраница_ИнвентаризируемыеТовары" Тогда 
		
		ОбщегоНазначения.ОчиститьРегистрСведений("СписокТоваровВБуфереИнвентаризации");
		
		РезультатСтруктура = ОбщегоНазначения.ПолучитьСписокЗаписейИзБуфераИнвентаризации(Параметры.ЗаданиеНаИнвентаризациюГУИД, Параметры.ЯчейкаГУИД );
		Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
			ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
			Возврат;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Элементы.СписокПроИнвентаризТоваровИзЯчейки.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРаботуСячейкой(Команда)
	Если Компонента <> Неопределено Тогда
		Компонента.Подключить();
	КонецЕсли;
	СтатусЯчейки = 2;
	РезультатСтруктура = ОбщегоНазначения.УстановитьСтатусИнвентаризируемойЯчейки(Параметры.ЗаданиеНаИнвентаризациюГУИД, Параметры.ЯчейкаГУИД, СтатусЯчейки );
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		Возврат;
	КонецЕсли; 
	Оповестить("Закрытие","Список");
	Закрыть();
КонецПроцедуры








	

